{"id":"HD","type":"DataType","name":"Hierarchic Designator","description":"The HD is designed to be more powerful and more general replacement for the application identifier of HL7 versions 2.1 and 2.2. It adds two additional components, the <universal ID> and the <universal ID type> to the former application ID (which is renamed more generically to be the namespace ID)","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"HD.1","type":"DataTypeComponent","position":"HD.1","length":0,"dataType":"IS","dataTypeName":"Coded value for user-defined tables","usage":"O","rpt":"1","tableId":"0300","tableName":"Namespace ID","name":"Namespace Id","description":"User-defined table 0300 - Namespace ID is used as the HL7 identifier for the user-defined table of values for this component."},{"id":"HD.2","type":"DataTypeComponent","position":"HD.2","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Universal Id","description":"The HDs second component, <universal ID (UID), is a string formatted according to the scheme defined by the third component, <universal ID type> (UID type). The UID is intended to be unique over time within the UID type. It is rigorously defined. Each UID must belong to one of the specifically enumerated schemes for constructing UIDs (defined by the UID type). The UID (second component) must follow the syntactic rules of the particular universal identifier scheme (defined by the third component). Note that these syntactic rules are not defined within HL7 but are defined by the rules of the particular universal identifier scheme (defined by the third component)."},{"id":"HD.3","type":"DataTypeComponent","position":"HD.3","length":0,"dataType":"ID","dataTypeName":"Coded values for HL7 tables","usage":"O","rpt":"1","tableId":"0301","tableName":"Universal ID type","name":"Universal Id Type","description":"The third component governs the interpretation of the second component of the HD. If the third component is a known UID refer to HL7 table 0301 - Universal ID type for valid values, then the second component is a universal ID of that type."}]}