{"id":"RI","type":"DataType","name":"Repeat Interval","description":"This field contains the interval between repeating appointments. The default setting indicates that the appointment should occur once, when the component is not valued. The definition of this field is equivalent to the definition of the Interval component of the Quantity/Timing field given in Chapter 4, Section 4.4.2 Interval component (CM).","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"RI.1","type":"DataTypeComponent","position":"RI.1","length":0,"dataType":"IS","dataTypeName":"Coded value for user-defined tables","usage":"O","rpt":"1","tableId":"0335","tableName":"Repeat pattern","name":"Repeat Pattern","description":"The repeating frequency with which the treatment is to be administered.  It is similar to the frequency and SIG code tables used in order entry systems. "},{"id":"RI.2","type":"DataTypeComponent","position":"RI.2","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Explicit Time Interval","description":"This field explicitly lists the actual times referenced by the code in the first subcomponent, in the following format: HHMM,HHMM,HHMM,.…  This second subcomponent will be used to clarify the first subcomponent in cases where the actual administration times vary within an institution.  If the time of the order spans more than a single day, this new subcomponent is only practical if the same times of administration occur for each day of the order.  If the actual start time of the order (as given by the fourth subcomponent of the quantity/timing field) is after the first explicit time, the first administration is taken to be the first explicit time after the start time.  In the case where the patient moves to a location having a different set of explicit times, the existing order may be updated with a new quantity/timing field showing the changed explicit times."}]}