{"id":"RFR","type":"DataType","name":"Reference Range","description":"Describes a reference range and its supporting detail.","dataType":null,"dataTypeName":null,"length":352,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"RFR.1","type":"DataTypeComponent","position":"RFR.1","length":33,"dataType":"NR","dataTypeName":"Numeric Range","usage":"R","rpt":"1","tableId":null,"tableName":null,"name":"Numeric Range","description":"This component specifies the numeric interval of the reference data. Range is taken to be inclusive (i.e., the range includes the end points). Units are context sensitive and are defined in the usage note for the field where this data type is used."},{"id":"RFR.2","type":"DataTypeComponent","position":"RFR.2","length":8,"dataType":"IS","dataTypeName":"Coded value for user-defined tables","usage":"O","rpt":"1","tableId":"0001","tableName":"Administrative Sex","name":"Administrative Sex","description":"This component specifies which gender for which the reference range is valid. Refer to User-defined Table 0001 - Administrative Sex for suggested values."},{"id":"RFR.3","type":"DataTypeComponent","position":"RFR.3","length":33,"dataType":"NR","dataTypeName":"Numeric Range","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Age Range","description":"This component specifies the age range for which the reference range is valid. Ages of less than one year should be specified as a fraction (e.g., 1 month = 0.0830, 1 week = 0.01920, 1 day = 0.0027300). However, for most purposes involving infants, the gestational age (measured in weeks) is preferred. The lower end of the range is not indicated; the upper end is, assuring that series of ranges do not overlap."},{"id":"RFR.4","type":"DataTypeComponent","position":"RFR.4","length":33,"dataType":"NR","dataTypeName":"Numeric Range","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Gestational Age Range","description":"This component specifies the gestational age range for which the reference range is valid. Gestational age is relevant only when the reference range is influenced by the stage of pregnancy. The gestational age is measured in weeks from conception. For example, |1&4| implies that the normals apply to gestational ages from 1 week to 4 weeks inclusive. The lower end of the range is not included; the upper end is, assuring that series of age ranges do not overlap."},{"id":"RFR.5","type":"DataTypeComponent","position":"RFR.5","length":20,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Species","description":"This component specifies the species for which the reference range is valid. Species is assumed to be human unless otherwise stated. Example values are rabbit, mouse, and rat."},{"id":"RFR.6","type":"DataTypeComponent","position":"RFR.6","length":20,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Race/Subspecies","description":"This component specifies the race or subspecies for which the reference range is valid. In the case of humans (the default species), the race is specified when race influences the reference range. When normal ranges for animals are being described, this component can be used to describe subspecies or special breeds of animals."},{"id":"RFR.7","type":"DataTypeComponent","position":"RFR.7","length":199,"dataType":"TX","dataTypeName":"Text Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Conditions","description":"This component specifies any arbitrary condition for which the reference range is valid. This may include such conditions as phase of menstrual cycle or dose of a particular drug. It is provided as a way to communicate the normal ranges for special conditions. It does not allow automatic checking of these text conditions."}]}