{"id":"0203","tableId":"0203","tableType":"HL7","name":"Identifier type","chapters":["CH_02"],"entries":[{"value":"AM","description":"American Express","comment":"Deprecated and replaced by BC in v 2.5."},{"value":"AN","description":"Account number","comment":"An identifier that is unique to an account."},{"value":"ANC","description":"Account number Creditor","comment":"Class: Financial A more precise definition of an account number: sometimes two distinct account numbers must be transmitted in the same message, one as the creditor, the other as the debitor. Kreditorenkontonummer"},{"value":"AND","description":"Account number debitor","comment":"Class: Financial A more precise definition of an account number: sometimes two distinct account numbers must be transmitted in the same message, one as the creditor, the other as the debitor. Debitorenkontonummer"},{"value":"ANON","description":"Anonymous identifier","comment":"An identifier for a living subject whose real identity is protected or suppressed Justification: For public health reporting purposes, anonymous identifiers are occasionally used for protecting patient identity in reporting certain results. For instance, a state health department may choose to use a scheme for generating an anonymous identifier for reporting a patient that has had a positive human immunodeficiency virus antibody test. Anonymous identifiers can be used in PID 3 by replacing the medical record number or other non-anonymous identifier. The assigning authority for an anonymous identifier would be the state/local health department."},{"value":"ANT","description":"Temporary Account Number","comment":"Class: FinancialTemporary version of an Account Number. Use Case: An ancillary system that does not normally assign account numbers is the first time to register a patient. This ancillary system will generate a temporary account number that will only be used until an official account number is assigned."},{"value":"APRN","description":"Advanced Practice Registered Nurse number","comment":"An identifier that is unique to an advanced practice registered nurse within the jurisdiction of a certifying board"},{"value":"BA","description":"Bank Account Number","comment":"Class: Financial"},{"value":"BC","description":"Bank Card Number","comment":"Class: Financial An identifier that is unique to a person’s bank card. Replaces AM, DI, DS, MS, and VS beginning in v 2.5."},{"value":"BR","description":"Birth registry number","comment":null},{"value":"BRN","description":"Breed Registry Number","comment":null},{"value":"CC","description":"Cost Center number","comment":"Class: Financial Use Case: needed especially for transmitting information about invoices."},{"value":"CY","description":"County number","comment":null},{"value":"DDS","description":"Dentist license number","comment":"An identifier that is unique to a dentist within the jurisdiction of the licensing board"},{"value":"DEA","description":"Drug Enforcement Administration registration number","comment":"An identifier for an individual or organization relative to controlled substance regulation and transactions. Use case: This is a registration number that identifies an individual or organization relative to controlled substance regulation and transactions. A DEA number has a very precise and widely accepted meaning within the United States. Surprisingly, the US Drug Enforcement Administration does not solely assign DEA numbers in the United States. Hospitals have the authority to issue DEA numbers to their medical residents. These DEA numbers are based upon the hospital’s DEA number, but the authority rests with the hospital on the assignment to the residents. Thus, DEA as an Identifier Type is necessary in addition to DEA as an Assigning Authority."},{"value":"DFN","description":"Drug Furnishing or prescriptive authority Number","comment":"An identifier issued to a health care provider authorizing the person to write drug orders Use Case: A nurse practitioner has authorization to furnish or prescribe pharmaceutical substances; this identifier is in component 1."},{"value":"DI","description":"Diner’s Club card","comment":"Deprecated and replaced by BC in v 2.5."},{"value":"DL","description":"Driver’s license number","comment":null},{"value":"DN","description":"Doctor number","comment":null},{"value":"DO","description":"Osteopathic License number","comment":"An identifier that is unique to an osteopath within the jurisdiction of a licensing board."},{"value":"DPM","description":"Podiatrist license number","comment":"An identifier that is unique to a podiatrist within the jurisdiction of the licensing board."},{"value":"DR","description":"Donor Registration Number","comment":null},{"value":"DS","description":"Discover Card","comment":"Deprecated and replaced by BC in v 2.5."},{"value":"EI","description":"Employee number","comment":"A number that uniquely identifies an employee to an employer."},{"value":"EN","description":"Employer number","comment":null},{"value":"FI","description":"Facility ID","comment":null},{"value":"GI","description":"Guarantor internal identifier","comment":"Class: Financial"},{"value":"GL","description":"General ledger number","comment":"Class: Financial"},{"value":"GN","description":"Guarantor external  identifier","comment":"Class: Financial"},{"value":"HC","description":"Health Card Number","comment":null},{"value":"IND","description":"Indigenous/Aboriginal","comment":"A number assigned to a member of an indigenous or aboriginal group outside of Canada."},{"value":"JHN","description":"Jurisdictional health number (Canada)","comment":"Class: Insurance 2 uses: a) UK jurisdictional CHI number; b) Canadian provincial health card number:"},{"value":"LI","description":"Labor and industries number","comment":null},{"value":"LN","description":"License number","comment":null},{"value":"LR","description":"Local Registry ID","comment":null},{"value":"MA","description":"Patient Medicaid number","comment":"Class: Insurance"},{"value":"MB","description":"Member Number","comment":"An identifier for the insured of an insurance policy (this insured always has a subscriber), usually assigned by the insurance carrier. Use Case: Person is covered by an insurance policy. This person may or may not be the subscriber of the policy."},{"value":"MC","description":"Patient's Medicare number","comment":"Class: Insurance"},{"value":"MCD","description":"Practitioner Medicaid number","comment":"Class: Insurance"},{"value":"MCN","description":"Microchip Number","comment":null},{"value":"MCR","description":"Practitioner Medicare number","comment":"Class: Insurance"},{"value":"MD","description":"Medical License number","comment":"An identifier that is unique to a medical doctor within the jurisdiction of a licensing board. Use Case: These license numbers are sometimes used as identifiers. In some states, the same authority issues all three identifiers, e.g., medical, osteopathic, and physician assistant licenses all issued by one state medical board. For this case, the CX data type requires distinct identifier types to accurately interpret component 1. Additionally, the distinction among these license types is critical in most health care settings (this is not to convey full licensing information, which requires a segment to support all related attributes)."},{"value":"MI","description":"Military ID number","comment":"A number assigned to an individual who has had military duty, but is not currently on active duty. The number is assigned by the DOD or Veterans’ Affairs (VA)."},{"value":"MR","description":"Medical record number","comment":"An identifier that is unique to a patient within a set of medical records, not necessarily unique within an application."},{"value":"MRT","description":"Temporary Medical Record Number","comment":"Temporary version of a Medical Record Number Use Case: An ancillary system that does not normally assign medical record numbers is the first time to register a patient. This ancillary system will generate a temporary medical record number that will only be used until an official medical record number is assigned."},{"value":"MS","description":"MasterCard","comment":"Deprecated and replaced by BC in v 2.5."},{"value":"NE","description":"National employer identifier","comment":"In the US, the Assigning Authority for this value is typically CMS, but it may be used by all providers and insurance companies in HIPAA related transactions."},{"value":"NH","description":"National Health Plan Identifier","comment":"Class: InsuranceUsed for the UK NHS national identifier. In the US, the Assigning Authority for this value is typically CMS, but it may be used by all providers and insurance companies in HIPAA related transactions."},{"value":"NI","description":"National unique individual identifier","comment":"Class: Insurance In the US, the Assigning Authority for this value is typically CMS, but it may be used by all providers and insurance companies in HIPAA related transactions."},{"value":"NII","description":"National Insurance Organization Identifier","comment":"Class: Insurance In Germany a national identifier for an insurance company. It is printed on the insurance card (health card). It is not to be confused with the health card number itself. Krankenkassen-ID der KV-Karte"},{"value":"NIIP","description":"National Insurance Payor Identifier (Payor)","comment":"Class: Insurance In Germany the insurance identifier addressed as the payor. Krankenkassen-ID des Rechnungsempfängers Use case: a subdivision issues the card with their identifier, but the main division is going to pay the invoices."},{"value":"NNxxx","description":"National Person Identifier where the xxx is the ISO table 3166 3-character (alphabetic) country code","comment":null},{"value":"NP","description":"Nurse practitioner number","comment":"An identifier that is unique to a nurse practitioner within the jurisdiction of a certifying board."},{"value":"NPI","description":"National provider identifier","comment":"Class: Insurance In the US, the Assigning Authority for this value is typically CMS, but it may be used by all providers and insurance companies in HIPAA related transactions."},{"value":"OD","description":"Optometrist license number","comment":"A number that is unique to an individual optometrist within the jurisdiction of the licensing board."},{"value":"PA","description":"Physician Assistant number","comment":"An identifier that is unique to a physician assistant within the jurisdiction of a licensing board"},{"value":"PCN","description":"Penitentiary/correctional institution Number","comment":"A number assigned to individual who is incarcerated."},{"value":"PE","description":"Living Subject Enterprise Number","comment":"An identifier that is unique to a living subject within an enterprise (as identified by the Assigning Authority)."},{"value":"PEN","description":"Pension Number","comment":null},{"value":"PI","description":"Patient internal identifier","comment":"A number that is unique to a patient within an Assigning Authority."},{"value":"PN","description":"Person number","comment":"A number that is unique to a living subject within an Assigning Authority."},{"value":"PNT","description":"Temporary Living Subject Number","comment":"Temporary version of a Lining Subject Number."},{"value":"PPN","description":"Passport number","comment":"A unique number assigned to the document affirming that a person is a citizen of the country. In the US this number is issued only by the State Department."},{"value":"PRC","description":"Permanent Resident Card Number","comment":null},{"value":"PRN","description":"Provider number","comment":"A number that is unique to an individual provider, a provider group or an organization within an Assigning Authority. Use case: This allows PRN to represent either an individual (a nurse) or a group/organization (orthopedic surgery team)."},{"value":"PT","description":"Patient external identifier","comment":null},{"value":"QA","description":"QA number","comment":null},{"value":"RI","description":"Resource identifier","comment":"A generalized resource identifier. Use Case: An identifier type is needed to accommodate what are commonly known as resources. The resources can include human (e.g. a respiratory therapist), non-human (e.g., a companion animal), inanimate object (e.g., an exam room), organization (e.g., diabetic education class) or any other physical or logical entity."},{"value":"RN","description":"Registered Nurse Number","comment":"An identifier that is unique to a registered nurse within the jurisdiction of the licensing board."},{"value":"RPH","description":"Pharmacist license number","comment":"An identifier that is unique to a pharmacist within the jurisdiction of the licensing board."},{"value":"RR","description":"Railroad Retirement number","comment":null},{"value":"RRI","description":"Regional registry ID","comment":null},{"value":"SL","description":"State license","comment":null},{"value":"SN","description":"Subscriber Number","comment":"Class: Insurance An identifier for a subscriber of an insurance policy which is unique for, and usually assigned by, the insurance carrier. Use Case: A person is the subscriber of an insurance policy. The person’s family may be plan members, but are not the subscriber."},{"value":"SR","description":"State registry ID","comment":null},{"value":"SS","description":"Social Security number","comment":null},{"value":"TAX","description":"Tax ID number","comment":null},{"value":"TN","description":"Treaty Number/ (Canada)","comment":"A number assigned to a member of an indigenous group in Canada. Use Case: First Nation."},{"value":"U","description":"Unspecified identifier","comment":null},{"value":"UPIN","description":"Medicare/CMS (formerly HCFA)’s Universal Physician Identification numbers","comment":"Class: Insurance"},{"value":"VN","description":"Visit number","comment":null},{"value":"VS","description":"VISA","comment":"Deprecated and replaced by BC in v 2.5."},{"value":"WC","description":"WIC identifier","comment":null},{"value":"WCN","description":"Workers’ Comp Number","comment":null},{"value":"XX","description":"Organization identifier","comment":null}]}