{"id":"CH_08","title":"Master Files","description":"In an open-architecture healthcare environment there often exists a set of common reference files used by one or more application systems.  Such files are called master files.  Some common examples of master files in the healthcare environment include: staff and health practitioner master file, system user(and password) master file, location(census and clinic) master file, device type and location(e.g., workstations, terminals, printers, etc.), lab test definition file, exam code(radiology) definition file, charge master file, patient status master, patient type master, service item master file. These common reference files need to be synchronized across the various applications at a given site.The Master Files Notification message provides a way of maintaining this synchronization by specifying a standard for the transmission of this data between applications. In many implementations, one application system will & quot; own & quot; a particular master file such as the staff and practitioner master file.The changes(e.g., adds, deletes, updates) to this file are made available to various other applications on a routine basis.  The Master Files Notification message supports this common case, but also supports the situation where an application not & quot; owning & quot; a particular master file transmits update information to other systems(usually to the &quot; owning & quot; system) for review and possible inclusion. The Master Files Notification message supports the distribution of changes to various master files between systems in either online or batch modes, and allows the use of either original or enhanced acknowledgment modes.These messages use the MSH segment to pass the basic event code (master files notification or acknowledgment).  The MFI(master file identification) segment identifies the master file being updated as well as the initial and requested dates for &quot;file-level&quot; events(such as &quot; replace file&quot;).  For each record being changed, the MFE(Master File Entry) segment carries the record-level event code (such as add, update, etc.), the initial and requested dates for the event, and the record-level key identifying the entry in the master file.  The MFA (master file acknowledgment) segment returns record-specific acknowledgment information. "}