{"id":"CX","type":"DataType","name":"Extended Composite Id With Check Digit","description":"This data type is used for specifying an identifier with its associated administrative detail.\r\n\r\nNote: The check digit and check digit scheme are null if ID is alphanumeric.\r\n\r\nExample:\r\n|1234567^4^M11^ADT01^MR^University Hospital|","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"CX.1","type":"DataTypeComponent","position":"CX.1","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"R","rpt":"1","tableId":null,"tableName":null,"name":"Id Number","description":"The value of the identifier itself."},{"id":"CX.2","type":"DataTypeComponent","position":"CX.2","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Identifier Check Digit","description":"A digit, or digits, exclusive of the identifier in CX.1, calculated by applying an algorithm to all or some of the digits in the number, which may be used to test validity of the non-check-digit identifier."},{"id":"CX.3","type":"DataTypeComponent","position":"CX.3","length":3,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"O","rpt":"1","tableId":"0061","tableName":"Check Digit Scheme","name":"Check Digit Scheme","description":"Contains the code identifying the check digit scheme employed.\r\n\r\nRefer to HL7 Table 0061 - Check Digit Scheme for valid values.\r\n\r\nNote: The check digit and code identifying check digit scheme are null if ID is alphanumeric."},{"id":"CX.4","type":"DataTypeComponent","position":"CX.4","length":0,"dataType":"HD","dataTypeName":"Hierarchic Designator","usage":"C","rpt":"1","tableId":"0363","tableName":"Assigning Authority","name":"Assigning Authority","description":"The assigning authority is a unique name of the system (or organization or agency or department) that creates the data. As of v2.7, CX.4 Assigning Authority is required if neither CX.9 nor CX.10 are populated. Best practice is to always send an OID in the Assigning Authority component\r\n\r\nRefer to User-defined Table 0363 - Assigning Authority for suggested values.\r\n\r\nThe reader is referred to the CX.9 and the CX.10 if there is a need to transmit values with semantic meaning for an assigning jurisdiction or assigning department or agency in addition to, or instead of, an assigning authority. However, all 3 components may be valued. If, in so doing, it is discovered that the values in CX.9 and/or CX.10 conflict with CX.4, the user would look to the Message Profile or other implementation agreement for a statement as to which takes precedence.\r\n\r\nNote: When the HD data type is used in a given segment as a component of a field of another data type, User-defined Table 0300 - Namespace ID (referenced by the first sub-component of the HD component) may be re-defined (given a different user-defined table number and name) by the technical committee responsible for that segment.\r\n\r\nBy site agreement, implementers may continue to use User-defined Table 0300 – Namespace ID for the first sub-component."},{"id":"CX.5","type":"DataTypeComponent","position":"CX.5","length":5,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"R","rpt":"1","tableId":"0203","tableName":"Identifier Type","name":"Identifier Type Code","description":"A code corresponding to the type of identifier. As of v2.7, CX.5 Identifier Type Code is required. Refer to HL7 Table 0203 – Identifier Type for suggested values."},{"id":"CX.6","type":"DataTypeComponent","position":"CX.6","length":0,"dataType":"HD","dataTypeName":"Hierarchic Designator","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Assigning Facility","description":"The place or location identifier where the identifier was first assigned to the patient. This component is not an inherent part of the identifier but rather part of the history of the identifier: as part of this data type, its existence is a convenience for certain intercommunicating systems.\r\n\r\nNote: When the HD data type is used in a given segment as a component of a field of another data type, User-defined Table 0300 - Namespace ID (referenced by the first sub-component of the HD component), may be re-defined (given a different user-defined table number and name) by the technical committee responsible for that segment."},{"id":"CX.7","type":"DataTypeComponent","position":"CX.7","length":0,"dataType":"DT","dataTypeName":"Date","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Effective Date","description":"The first date, if known, on which the identifier is valid and active."},{"id":"CX.8","type":"DataTypeComponent","position":"CX.8","length":0,"dataType":"DT","dataTypeName":"Date","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Expiration Date","description":"The last date, if known, on which the identifier is valid and active."},{"id":"CX.9","type":"DataTypeComponent","position":"CX.9","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"C","rpt":"1","tableId":null,"tableName":null,"name":"Assigning Jurisdiction","description":"The geo-political body that assigned the identifier in component 1. As of v2.7, Assigning Jurisdiction is required if neither CX.4 nor CX.10 are populated. \r\n - Refer to HL7 Table 0399 – Country Code for valid values if the administrative unit under whose jurisdiction the identifier was issued is a country.\r\n - Refer to User-Defined Table 0347 – State/Province for suggested values if the administrative unit under whose jurisdiction the identifier was issued is a state or province. This table is country specific. In the US, postal codes may be used.\r\n - Refer to User-defined Table –0289 County/Parish for suggested values if the administrative unit under whose jurisdiction the identifier was issued is a county or parish.\r\n\r\nThe reader is referred to the CX.4 if there is a need to transmit this information as an OID."},{"id":"CX.10","type":"DataTypeComponent","position":"CX.10","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"C","rpt":"1","tableId":null,"tableName":null,"name":"Assigning Agency Or Department","description":"The agency or department that assigned the identifier in component 1. As of v2.7, Assigning Agency or Department is required if neither CX.4 nor CX.9 are populated.\r\n\r\nRefer to User-defined Table 0530 – Organizations, agency, department for suggested values if the administrative unit under whose jurisdiction the identifier was issued is an organization, agency or department. This is populated with site-specific assigning authorities. It also should contain national or international codes when CX.5 Identifier Type Code may be assigned by more than one authority within a governmental or organizational unit. For example, a federal government may have 2 departments that assign a military identifier, its Veterans Affairs department and its Department of Defense. It is not recommended to include values for entities such as Social Security Administration (SSA), Immigration and Naturalization Service (INS), Center for Medicare and Medicaid Services (CMS) because they are included in the identifier type table. In these cases the name of the country plus the identifier type yields the correct interpretation of the identifier in component 1. Likewise, entries like department of motor vehicles (DMV) and licensing boards are not recommended for inclusion because the combination of state and identifier type yields the correct interpretation of the identifier in component 1. This approach is not to be confused with the detailed information provided in the Chapter 15 segments that have provision for specifying the precise granting body and issuing body information needed in personnel management messages.\r\n\r\nExample 1: <Identifier> plus <Visa> yields a unique identifier.\r\n\r\nExample 2: <identifier> plus <state> plus <DLN> yields a unique driver’s license number.\r\n\r\nExample 3: <identifier> plus <country> plus <INS> yields a unique immigration number.\r\n\r\nThe reader is referred to the CX.4, if there is a need to transmit this information as an OID."},{"id":"CX.11","type":"DataTypeComponent","position":"CX.11","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Security Check","description":"This component is used to communicate a version code that may be assigned to the value given in CX.1 ID."},{"id":"CX.12","type":"DataTypeComponent","position":"CX.12","length":3,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"O","rpt":"1","tableId":"0904","tableName":"Security Check Scheme","name":"Security Check Scheme","description":"This component is used to transmit information intended to validate the veracity of the supplied identifier or the presenter of the identifier. For example, this component may be used to ensure that the presenter of a credit card is an authorized user of that card.\r\n\r\nRefer to HL7 Table 0904 - Security Check Scheme for valid values."}]}