{"id":"EI","type":"DataType","name":"Entity Identifier","description":"The entity identifier defines a given entity within a specified series of identifiers.\r\n\r\nThe EI is appropriate for, but not limited to, machine or software generated identifiers. The generated identifier goes in the first component. The remaining components, 2 through 4, are known as the assigning authority; they identify the machine/system responsible for generating the identifier in component 1.\r\n\r\nThe specified series, the assigning authority, is defined by components 2 through 4. The assigning authority is of the hierarchic designator (HD) data type, but it is defined as three separate components in the EI data type, rather than as a single component as would normally be the case. This is in order to maintain backward compatibility with the EI’s use as a component in several existing data fields. Otherwise, the components 2 through 4 are as defined in Section 2.A.33, \"HD - hierarchic designator\". Hierarchic designators (HD) are unique across a given HL7 implementation.","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"EI.1","type":"DataTypeComponent","position":"EI.1","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Entity Identifier","description":"The first component, <entity identifier>, is usually defined to be unique within the series of identifiers created by the <assigning authority>, defined by a hierarchic designator, represented by components 2 through 4. See Section 2.A.33, \"HD - hierarchic designator\"."},{"id":"EI.2","type":"DataTypeComponent","position":"EI.2","length":0,"dataType":"IS","dataTypeName":"Coded Value For User-defined Tables","usage":"O","rpt":"1","tableId":"0363","tableName":"Assigning Authority","name":"Namespace Id","description":"See Section 2.A.33.1, \"Namespace ID (IS)\" for definition. The component intentionally remains associated with the IS data type in v 2.7.\r\n\r\nThe assigning authority is a unique identifier of the system (or organization or agency or department) that creates the data. Refer to User-defined Table 0363 – Assigning Authority for suggested values.\r\n\r\nNote: When the HD is used as a part of another data type, in this case as part of the EI data type, this table may be re-defined (given a different user-defined table number and name) by the technical committee responsible for that segment. \r\n\r\nBy site agreement, implementers may continue to use User-defined Table 0300 – Namespace ID for the first component"},{"id":"EI.3","type":"DataTypeComponent","position":"EI.3","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"C","rpt":"1","tableId":null,"tableName":null,"name":"Universal Id","description":"See Section 2.A.33.2, \"Universal ID (ST)\" for definition."},{"id":"EI.4","type":"DataTypeComponent","position":"EI.4","length":6,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"C","rpt":"1","tableId":"0301","tableName":"Universal ID Type","name":"Universal Id Type","description":"Refer to HL7 Table 0301 - Universal ID Type for valid values. See Section 2.A.33.3, \"Universal ID Type (ID),\" for definition."}]}