{"id":"RI","type":"DataType","name":"Repeat Interval","description":"Contains the interval between repeated services.\r\n\r\nNote: The reader is referred to the RPT – Repeat pattern data type, which provides a more rigorous framework for defining repeating time intervals.","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"RI.1","type":"DataTypeComponent","position":"RI.1","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"O","rpt":"1","tableId":"0335","tableName":"Repeat Pattern","name":"Repeat Pattern","description":"The repeating frequency with which the treatment is to be administered. It is similar to the frequency and SIG code tables used in order entry systems.\r\n\r\nRefer to User-defined Table 0335 - Repeat Pattern for suggested values.\r\n\r\nThe first component may repeat, with repeat values separated by a space. The repeats are interpreted as connected by logical ANDs.\r\n\r\nExample:\r\n - Twice per day, every other day: BID QOD\r\n - Three times per day, Monday Wednesday and Friday: TID QJ135 \r\n\r\nBecause of this syntax, repeat values should never contain blanks."},{"id":"RI.2","type":"DataTypeComponent","position":"RI.2","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Explicit Time Interval","description":"This component explicitly lists the actual times referenced by the code in the first component, in the following format: HHMM,HHMM,HHMM,.... This second component will be used to clarify the first component in cases where the actual times vary within an institution. If the time of the order spans more than a single day, this new component is only practical if the same times of administration occur for each day of the order. If the actual start time of the order (as given by the fourth component of the quantity/timing field) is after the first explicit time, the first administration is taken to be the first explicit time after the start time. In the case where the patient moves to a location having a different set of explicit times, the existing order may be updated with a new quantity/timing field showing the changed explicit times.\r\n\r\nExample: 2nd component of quantity/timing field:\r\n|QID^0230,0830,1430,2030|"}]}