{"id":"RPT","type":"DataType","name":"Repeat Pattern","description":"The repeat pattern data type should be used where it is necessary to define the frequency at which an event is to take place. This data type provides a way to define repeat pattern codes \"on the fly\". The repeat pattern code is equivalent to the TQ data type, component 2, sub-component 1 (repeat pattern). The additional components define the meaning of the repeat pattern code. Components 2 - 10 are used to define relatively simple repeat patterns. Component 11 is provided to define complex repeat patterns. This data type forms a bridge between the 2.x Repeat Pattern concept from Quantity/Timing, and the Version 3.0 GTS General Timing Specification. Component 1 is the 2.x concept of repeat pattern. Components 2-7 are derived from the version 3.0 data type PIVL. Components 8-10 are derived from the version 3.0 EIVL data type. If a repeat pattern cannot be defined using components 2-10, then component 11, General Timing Specification is provided. This allows the full literal form of the version 3.0 GTS to be specified.\r\n\r\nWhen using the RPT, if an application doesn't recognize the code in component 1, then it may attempt to determine the appropriate frequency using the remaining components. If the application does recognize the code in component 1, the application is not required to determine the frequency from the remaining components.\r\nUse Case: The use case supporting this proposal is the need to define repeat patterns on the fly while placing an order. The TQ data type did not have the capability to define the meaning of a repeat pattern on the fly. To get around this problem, vendors have implemented a variety of solutions to solve this issue. One way was to add Z-components to the TQ data type to transmit information about the repeat pattern. Another solution was to attempt to parse the repeat pattern code in an attempt to decipher what the code meant.\r\n\r\nExamples:\r\n|Q1H&Every 1 Hour&HL7xxx^^^^1^h|\r\n|Q2J2&Every second Tuesday&HL7xxx^DW^2^^2^wk|\r\n|BID&Twice a day at institution specified times&HL7xxx^^^^12^h^Y|\r\n|QAM&Every morning at the institution specified time&HL7xxx^HD^00^11^1^d^Y|\r\n|QHS&Every day before the hours of sleep&HL7xxx^^^^1^d^^AHS|\r\n|ACM&Before Breakfast&HL7xxx^^^^^^^ACM|","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"RPT.1","type":"DataTypeComponent","position":"RPT.1","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"R","rpt":"1","tableId":"0335","tableName":"Repeat Pattern","name":"Repeat Pattern Code","description":"A code representing the repeat pattern defined by the other components of this data type. Refer to User-defined Table 0335 – Repeat Pattern for suggested values."},{"id":"RPT.2","type":"DataTypeComponent","position":"RPT.2","length":2,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"O","rpt":"1","tableId":"0527","tableName":"Calendar Alignment","name":"Calendar Alignment","description":"Specifies an alignment of the repetition to a calendar (e.g., to distinguish every 30 days from “the 5th of every month”). Refer to HL7 Table 0527 - Calendar Alignment for valid values."},{"id":"RPT.3","type":"DataTypeComponent","position":"RPT.3","length":0,"dataType":"NM","dataTypeName":"Numeric","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Phase Range Begin Value","description":"Used for Calendar aligned repeat patterns to determine the amount of time from the beginning of particular RPT.2 - Calendar Alignment to the beginning of the phase. If Calendar Alignment is DW (days of week), then this would be the offset from the beginning of the week. \r\n\r\nIf Phase Range Begin Value is populated, but Phase Range End Value is not populated, then this component defines when the period (RPT.5, 6) begins.\r\nIf both Phase Range Begin Value and Phase Range End Value are populated, then this component defines the earliest point in time at which the period (RPT.5, 6) will begin.\r\n\r\nThe units of measure for this component are derived from the Calendar Alignment value in RPT.2. See HL7 Table 0527 - Calendar Alignment for the units of measure associated with a particular calendar alignment."},{"id":"RPT.4","type":"DataTypeComponent","position":"RPT.4","length":0,"dataType":"NM","dataTypeName":"Numeric","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Phase Range End Value","description":"Used for Calendar aligned repeat patterns to determine the amount of time from the beginning of particular RPT.2 - Calendar Alignment to the end of the phase. \r\n\r\nIf Phase Range End Value is populated, but Phase Range Begin Value is not populated, then this component defines when the timing period (RPT.5, 6) begins.\r\n\r\nIf both Phase Range Begin Value and Phase Range End Value are populated, then this component defines the latest point in time at which the period (RPT.5, 6) will begin.\r\n\r\nThe units of measure for this component are derived from the Calendar Alignment value in RPT.2. See HL7 Table 0527 - Calendar Alignment for the units of measure associated with a particular calendar alignment."},{"id":"RPT.5","type":"DataTypeComponent","position":"RPT.5","length":0,"dataType":"NM","dataTypeName":"Numeric","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Period Quantity","description":"A time duration specifying the frequency at which the periodic interval repeats. RPT.6 - Period Units defines the units of time for this component."},{"id":"RPT.6","type":"DataTypeComponent","position":"RPT.6","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"C","rpt":"1","tableId":null,"tableName":null,"name":"Period Units","description":"Defines the units used for RPT.5 - Period Quantity. Constrained to units of time.  Best practice is to use UCUM. Refer to External table the Unified Code for Units of Measure (UCUM) [http://aurora.rg.iupui.edu/UCUM] for valid values. \r\n\r\nCondition Rule: This component is required if RPT.5 - Period Quantity is populated."},{"id":"RPT.7","type":"DataTypeComponent","position":"RPT.7","length":1,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"O","rpt":"1","tableId":"0136","tableName":"Yes/no Indicator","name":"Institution Specified Time","description":"A code that indicates whether the exact timing is up to the party executing the schedule (e.g., to distinguish “every 8 hours” from “3 times a day”).  Refer to HL7 Table 0136 - Yes/No Indicator for valid values.\r\n\r\n - Y - exact timing up to party executing schedule. \r\n - N - exact timing as specified."},{"id":"RPT.8","type":"DataTypeComponent","position":"RPT.8","length":3,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"O","rpt":"1","tableId":"0528","tableName":"Event Related Period","name":"Event","description":"A code for a common (periodical) activity of daily living. Refer to HL7 Table 0528 - Event-Related Period for valid values."},{"id":"RPT.9","type":"DataTypeComponent","position":"RPT.9","length":0,"dataType":"NM","dataTypeName":"Numeric","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Event Offset Quantity","description":"An interval that marks the offsets for the beginning, width and end of the event-related periodic interval measured from the time each such event actually occurred. A positive numeric value indicates the amount of time after the event in RPT.8. A negative numeric value indicates the amount of time prior to the event in RPT.8. RPT.10 - Event Offset Units defines the units of time for this component.\r\n\r\nUsage Note: This component should not be valued unless there is a value in RPT-8 (Event)."},{"id":"RPT.10","type":"DataTypeComponent","position":"RPT.10","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"C","rpt":"1","tableId":null,"tableName":null,"name":"Event Offset Units","description":"Defines the units used for RPT-9 (Event Offset Quantity). Constrained to units of time. The codes for unit of measure are specified in the Unified Code for Units of Measure (UCUM) [http://aurora.rg.iupui.edu/UCUM].\r\n\r\nCondition Rule: This component is required if RPT.9 - Event Offset Quantity is populated."},{"id":"RPT.11","type":"DataTypeComponent","position":"RPT.11","length":0,"dataType":"GTS","dataTypeName":"General Timing Specification","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"General Timing Specification","description":"The General Timing Specification as defined by the Version 3 Data Types document."}]}