{"id":"TM","type":"DataType","name":"Time","description":"Specifies the hour of the day with optional minutes, seconds, fraction of second using a 24-hour clock notation and time zone.\r\n\r\nAs of v 2.3, the number of characters populated (excluding the time zone specification) specifies the precision. \r\n\r\nFormat: HH[MM[SS[.S[S[S[S]]]]]][+/-ZZZZ]\r\n\r\nThe fractional seconds could be sent by a transmitter who requires greater precision than whole seconds. Fractional representations of minutes, hours or other higher-order units of time are not permitted.\r\n\r\nNote: The time zone [+/-ZZZZ], when used, is restricted to legally-defined time zones and is represented in HHMM format.\r\n\r\nThe time zone of the sender may be sent optionally as an offset from the coordinated universal time (previously known as Greenwich Mean Time). Where the time zone is not present in a particular TM field but is included as part of the date/time field in the MSH segment, the MSH value will be used as the default time zone. Otherwise, the time is understood to refer to the local time of the sender.\r\n\r\nPrior to v 2.3, this data type was specified in the format HHMM[SS[.SSSS]][+/-ZZZZ]. As of v 2.3 minutes are no longer required. By site-specific agreement, HHMM[SS[.SSSS]][+/-ZZZZ] may be used where backward compatibility must be maintained.This corresponds a minimum length of 4.\r\n\r\nThe TM data type does not follow the normal truncation pattern, and the truncation character is never valid in the TM data type. Instead, the truncation behavior is based on the semantics of times. \r\n\r\nUnless otherwise specified in the context where the DTM type is used, the DTM type may be truncated to a particular minute. When a TM is truncated, the truncated form SHALL still be a valid TM type. Refer to Chapter 2, section 2.5.5.2, \"Truncation Pattern\", for further information.","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[]}