{"id":"TX","type":"DataType","name":"Text Data","description":"String data meant for user display (on a terminal or printer). Such data would not necessarily be left justified since leading spaces may contribute greatly to the clarity of the presentation to the user. Because this type of data is intended for display, it may contain certain escape character sequences designed to control the display. Escape sequence formatting is defined in Section 2.7, \"Use of escape sequences in text fields\". Leading spaces should be included. Trailing spaces should be removed.\r\n\r\nExample:\r\n|  leading spaces are allowed.|\r\n\r\nSince TX data is intended for display purposes, the repeat delimiter, when used with a TX data field, implies a series of repeating lines to be displayed on a printer or terminal. Therefore, the repeat delimiters are regarded as paragraph terminators or hard carriage returns (e.g., they would display as though a CR/LF were inserted in the text (DOS type system) or as though a LF were inserted into the text (UNIX style system)).\r\n\r\nA receiving system would word wrap the text between repeat delimiters in order to fit it into an arbitrarily sized display window but start any line beginning with a repeat delimiter on a new line.\r\n\r\nTo include alternative character sets, use the appropriate escape sequence. See Chapter 2, section 2.14.9.18, \"MSH-18 - Character Set\" and section 2.14.9.20, \"MSH-20 - Alternate Character Set Handling Scheme\".\r\n\r\nThis specification applies no limit to the length of the TX data type, either here where the data type is defined, or elsewhere where the data type is used. While there is no intrinsic reason to limit the length of this data type for semantic or syntactical reasons, it is expected that some sort of limitation will be imposed for technical reasons in implementations. HL7 recommends that implementation length limits be published in implementation profiles.","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[]}