[{"id":"ACK","type":"Message","label":"ACK - General acknowledgment message","description":"The simple general acknowledgment (ACK) can be used where the application does not define a special application level acknowledgment message or where there has been an error that precludes application processing.  It is also used for accept level acknowledgments.  The details are described in Section 2.13.1, “Original and enhanced processing rules.”\r\n\r\nNote: For the general acknowledgment (ACK) message, the value of MSH-9-2-Trigger event is equal to the value of MSH-9-2-Trigger event in the query message being acknowledged.  The value of MSH-9-3-Message structure for the general acknowledgment message is always ACK.","chapters":["CH_02"]},{"id":"ADR_A19","type":"Message","label":"ADR_A19 - Patient query","description":"The following trigger event is served by QRY (a query from another system) and ADR (a response from an Patient Administration system.)","chapters":["CH_03"]},{"id":"ADT_A01","type":"Message","label":"ADT_A01 - Admit/visit notification","description":"An A01 event is intended to be used for \"Admitted\" patients only.  An A01 event is sent as a result of a patient undergoing the admission process which assigns the patient to a bed.  It signals the beginning of a patient’s stay in a healthcare facility.  Normally, this information is entered in the primary Patient Administration system and broadcast to the nursing units and ancillary systems.  It includes short stay and \"John Doe\" (e.g. patient name is unknown) admissions.","chapters":["CH_03"]},{"id":"ADT_A02","type":"Message","label":"ADT_A02 - Transfer a patient","description":"An A02 event is issued as a result of the patient changing his or her assigned physical location.","chapters":["CH_03"]},{"id":"ADT_A03","type":"Message","label":"ADT_A03 - Discharge/end visit","description":"An A03 event signals the end of a patient’s stay in a healthcare facility.  It signals that the patient’s status has changed to \"discharged\" and that a discharge date has been recorded.  The patient is no longer in the facility.  The patient’s location prior to discharge should be entered in PV1-3 - Assigned Patient Location.","chapters":["CH_03"]},{"id":"ADT_A04","type":"Message","label":"ADT_A04 - Register a patient","description":"An A04 event signals that the patient has arrived or checked in as a one-time, or recurring outpatient, and is not assigned to a bed.  One example might be its use to signal the beginning of a visit to the Emergency Room (= Casualty, etc.).  Note that some systems refer to these events as outpatient registrations or emergency admissions.  PV1-44 - Admit Date/Time is used for the visit start date/time.","chapters":["CH_03"]},{"id":"ADT_A05","type":"Message","label":"ADT_A05 - Pre-admit a patient","description":"An A05 event is sent when a patient undergoes the pre-admission process.  During this process, episoderelated data is collected in preparation for a patient’s visit or stay in a healthcare facility.  For example, a pre-admit may be performed prior to inpatient or outpatient surgery so that lab tests can be performed prior to the surgery.  This event can also be used to pre-register a non-admitted patient.","chapters":["CH_03"]},{"id":"ADT_A06","type":"Message","label":"ADT_A06 - Change an outpatient to an inpatient","description":"An A06 event is sent when a patient who was present for a non-admitted visit is being admitted after an evaluation of the seriousness of the patient’s condition.  This event changes a patient’s status from nonadmitted to admitted.  The new patient location should appear in PV1-3 - Assigned patient location, while the old patient location (if different) should appear in PV1-6 - Prior patient location.  The new patient class should appear in PV1-2 - Patient class.","chapters":["CH_03"]},{"id":"ADT_A07","type":"Message","label":"ADT_A07 - Change an inpatient to an outpatient","description":"An A07 event is sent when a patient who was admitted changes his/her status to \"no longer admitted\" but is still being seen for this episode of care.  This event changes a patient from an \"admitted\" to a \"nonadmitted\" status.  The new patient location should appear in PV1-3 - Assigned patient location, while the old patient location (if different) should appear in PV1-6 - Prior patient location.","chapters":["CH_03"]},{"id":"ADT_A08","type":"Message","label":"ADT_A08 - Update patient information","description":"This trigger event is used when any patient information has changed but when no other trigger event has occurred.  For example, an A08 event can be used to notify the receiving systems of a change of address or a name change.  We recommend that the A08 transaction be used to update fields that are not related to any of the other trigger events.  The A08 event can include information specific to an episode of care, but it can also be used for demographic information only.","chapters":["CH_03"]},{"id":"ADT_A09","type":"Message","label":"ADT_A09 - Patient departing - tracking","description":"The A09 and A10 - patient arriving-tracking events are used when there is a change in a patient’s physical location (inpatient or outpatient) and when this is NOT a change in the official census bed location, as in the case of an outpatient setting.  There are three situations that qualify as non-census location changes:  (a) patient tracking, (b) the patient is in transit between locations for some time, (c) a notification of temporary location change.\r\n\r\nThe DG1 segment remains in this message for backward compatibility only.","chapters":["CH_03"]},{"id":"ADT_A10","type":"Message","label":"ADT_A10 - Patient arriving - tracking","description":"The A10 event is sent when a patient arrives at a new location in the healthcare facility (inpatient or outpatient).  The A09 - patient departing-tracking and A10 events are used when there is a change in a patient’s physical location and when this is NOT a change in the official census bed location, as in the case of an outpatient setting.  There are three varieties of these non-census location changes involving three different kinds of notification:  (a) an unofficial notification of location change prior to the official notification of patient tracking, (b) the patient is in transit between locations for some time, (c) a notification of a temporary location change.\r\n\r\nThe DG1 segment remains in this message for backward compatibility only.","chapters":["CH_03"]},{"id":"ADT_A11","type":"Message","label":"ADT_A11 - Cancel admit/visit notification","description":"For \"admitted\" patients, the A11 event is sent when an A01 (admit/visit notification) event is cancelled, either because of an erroneous entry of the A01 event, or because of a decision not to admit the patient after all.\r\n\r\nFor \"non-admitted\" patients, the A11 event is sent when an A04 (register a patient) event is cancelled, either because of an erroneous entry of the A04 event, or because of a decision not to check the patient in for the visit after all.  To cancel an A05 (pre-admit a patient) event, use the A38 (cancel pre-admit), which is new for Version 2.3 of this Standard.\r\n\r\nThe DG1 segment remains in this message for backward compatibility only.","chapters":["CH_03"]},{"id":"ADT_A12","type":"Message","label":"ADT_A12 - Cancel transfer","description":"The A12 event is sent when an A02 (transfer a patient) event is cancelled, either because of erroneous entry of the A02 event or because of a decision not to transfer the patient after all.  PV1-3 - assigned patient location must show the location of the patient prior to the original transfer.\r\n\r\nThe DG1 segment remains in this message for backward compatibility only.","chapters":["CH_03"]},{"id":"ADT_A13","type":"Message","label":"ADT_A13 - Cancel discharge/end visit","description":"The A13 event is sent when an A03 (discharge/end visit) event is cancelled, either because of erroneous entry of the A03 event or because of a decision not to discharge or end the visit of the patient after all. PV1-3 - assigned patient location should reflect the location of the patient after the cancellation has been processed.  Note that this location may be different from the patient’s location prior to the erroneous discharge.  Prior Location could be used to show the location of the patient prior to the erroneous discharge.","chapters":["CH_03"]},{"id":"ADT_A14","type":"Message","label":"ADT_A14 - Pending admit","description":"An A14 event notifies other systems of a planned admission, when there is a reservation or when patient admission is to occur imminently.  The A14 event is similar to a pre-admit, but without the implication that an account should be opened for the purposes of tests prior to admission.  It is used when advanced notification of an admit is required in order to prepare for the patient’s arrival.","chapters":["CH_03"]},{"id":"ADT_A15","type":"Message","label":"ADT_A15 - Pending transfer","description":"An A15 event notifies other systems of a plan to transfer a patient to a new location when the patient has not yet left the old location.  It is used when advanced notification of a transfer is required in order to prepare for the patient’s location change.  For example, this transaction could be sent so that staff will be on hand to move the patient or so that dietary services can route the next meal to the new location.\r\n\r\nThe DG1 segment remains in this message for backward compatibility only.","chapters":["CH_03"]},{"id":"ADT_A16","type":"Message","label":"ADT_A16 - Pending discharge","description":"An A16 event notifies other systems of a plan to discharge a patient when the patient has not yet left the healthcare facility.  It is used when advanced notification of a discharge is required in order to prepare for the patient’s change in location.  For example, it is used to notify the pharmacy of the possible need for discharge drugs or to notify psychotherapy of the possible need for post-discharge appointments.","chapters":["CH_03"]},{"id":"ADT_A17","type":"Message","label":"ADT_A17 - Swap patients","description":"The A17 is used when it is decided that two patients will exchange beds.  The patient ID and visit data are repeated for the two patients changing places.  See Section 3.6.1, \"Swapping a patient,\" for a discussion of issues related to implementing this trigger event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.","chapters":["CH_03"]},{"id":"ADT_A18","type":"Message","label":"ADT_A18 - Merge patient information","description":"Event A18 has been retained for backward compatibility.  The A18 event was used to merge current and previous patient identification numbers: PID-3 - patient identifier list, PID-2 - patient ID, PID-4 alternate patient ID-PID, and PID-18 - patient account number.  This procedure is required, for example, when a previous patient is registered under a new patient identification number because of an error, or because there was insufficient time to determine the actual patient identification number.  The merge event occurs when a decision is made to combine the information under either the new or the old identifier(s).  The PID segment contains the surviving patient ID information.  The MRG segment contains the non-surviving information.\r\n\r\nFrom V2.3.1 onwards events A40 (merge patient-patient identifier list), A41 (merge account-patient account number), and A42 (merge visit-visit number) should be utilized in place of the A18 event.\r\n\r\nThis merge event is non-specific in that, as a result of the merge, several patient identifiers may or may not have changed.  For sites requiring (or desiring) greater specificity with regard to this type of message, new events A40 (merge patient-patient identifier list), A41 (merge account-patient account number) and A42 (merge visit-visit number)) are now available as alternatives. ","chapters":["CH_03"]},{"id":"ADT_A20","type":"Message","label":"ADT_A20 - Bed status update","description":"Certain nursing/census applications need to be able to update the Patient Administration system’s bed status.","chapters":["CH_03"]},{"id":"ADT_A21","type":"Message","label":"ADT_A21 - Patient goes on a \"leave of absence\"","description":"An A21 event is sent to notify systems that an admitted patient has left the healthcare institution temporarily.  It is used for systems in which a bed is still assigned to the patient, and it puts the current admitted patient activities on hold.  For example, it is used to notify dietary services and laboratory systems when the patient goes home for the weekend.","chapters":["CH_03"]},{"id":"ADT_A22","type":"Message","label":"ADT_A22 - Patient returns from a \"leave of absence\"","description":"An A22 event is sent to notify systems that an admitted patient has returned to the healthcare institution after a temporary \"leave of absence.\"  It is used for systems in which a bed is still assigned to the patient, and it takes their current admitted patient activities off of \"hold\" status.  For example, it is used to notify dietary services and laboratory systems when the patient returns from a weekend trip to his/her home.","chapters":["CH_03"]},{"id":"ADT_A23","type":"Message","label":"ADT_A23 - Delete a patient record","description":"The A23 event is used to delete visit or episode-specific information from the patient record.  For example, it is used to remove old data from a database that cannot hold all historical patient visit data. When an event was entered erroneously, use one of the cancel transactions.  This event can be used to purge account-level data while retaining the person in the database.","chapters":["CH_03"]},{"id":"ADT_A24","type":"Message","label":"ADT_A24 - Link patient information","description":"The A24 event is used when the first PID segment needs to be linked to the second PID segment and when both patient identifiers identify the same patient.  Linking two or more patients does not require the actual merging of patient information; following a link event, the affected patient data records should remain distinct.  For example, this event could be used in a hospital network environment in which there are multiple campuses and in which records need to be linked.  For example, hospital A, hospital B, and hospital C would each keep their own records on a patient, but an A24 link event would be sent to a corporate-wide MPI to enable the coupling of ID information with the corporate ID number.  It is used for corporate data repositories, etc.  This event is not meant to link mothers and babies since a field exists (PID-21 - mother’s identifier) for that purpose.  See Section 3.6.3, \"Patient record links,\" for a discussion of issues related to implementing patient link messages and MPI issues.","chapters":["CH_03"]},{"id":"ADT_A25","type":"Message","label":"ADT_A25 - Cancel pending discharge","description":"The A25 event is sent when an A16 (pending discharge) event is cancelled, either because of erroneous entry of the A16 event or because of a decision not to discharge the patient after all.","chapters":["CH_03"]},{"id":"ADT_A26","type":"Message","label":"ADT_A26 - Cancel pending transfer","description":"The A26 event is sent when an A15 (pending transfer) event is cancelled, either because of erroneous entry of the A15 event or because of a decision not to transfer the patient after all.","chapters":["CH_03"]},{"id":"ADT_A27","type":"Message","label":"ADT_A27 - Cancel pending admit","description":"The A27 event is sent when an A14 (pending admit) event is canceled, either because of erroneous entry of the A14 event or because of a decision not to admit the patient after all.","chapters":["CH_03"]},{"id":"ADT_A28","type":"Message","label":"ADT_A28 - Add person information","description":"The A28 event can be used to send everything that is known about a person.  For example, it can be sent to an ICU unit (in addition to the A02 (transfer a patient) event) when a patient is transferred to the ICU unit in order to backload all demographic information for the patient into the ICU system.  An A28 (add person information) or A31 (update person information) can also be used for backloading MPI information for the person, or for backloading person and historical information.","chapters":["CH_03"]},{"id":"ADT_A29","type":"Message","label":"ADT_A29 - Delete person information","description":"An A29 event can be used to delete all demographic information related to a given person.  This event \"undoes\" an A28 (add person information) event.  The information from the A28 event is deleted.  This event is used, for example, when adding the information was performed in error, or when another record already exists for the person, or when one wants to purge the person from the database.  When this event occurs, all visit and account level data for this person is also purged.","chapters":["CH_03"]},{"id":"ADT_A30","type":"Message","label":"ADT_A30 - Merge person information","description":"An A30 (merge person information) is intended for merging person records without merging patient identifiers.\r\n\r\nEvent A30 has been retained for backward compatibility only.  An A30 event was used to merge person information on an MPI.  From V 2.3.1 onwards, the A40 (merge patient-patient identifier list) events should be used to merge patient information for a current episode.  The \"incorrect MRN\" identified on the MRG segment (MRG-1 - prior patient identifier list) is to be merged with the \"correct MRN\" identified on the PID segment (PID-3 - patient identifier list).  The \"incorrect MRN\" then no longer exists.  All PID data associated with the \"correct MRN\" are treated as updated information.","chapters":["CH_03"]},{"id":"ADT_A31","type":"Message","label":"ADT_A31 - Update person information","description":"An A31 event can be used to update person information on an MPI.  It is similar to an A08 (update patient information) event, but an A08 (update patient information) event should be used to update patient information for a current episode.  An A28 (add person information) or A31 can also be used for backloading MPI information for the person, or for backloading person and historical information.","chapters":["CH_03"]},{"id":"ADT_A32","type":"Message","label":"ADT_A32 - Cancel patient arriving - tracking","description":"The A32 event is sent when an A10 (patient arriving-tracking) event is cancelled, either because of erroneous entry of the A10 event or because of a decision not to receive the patient after all.","chapters":["CH_03"]},{"id":"ADT_A33","type":"Message","label":"ADT_A33 - Cancel patient departing - tracking","description":"The A33 event is sent when an A09 (patient departing-tracking) event is cancelled, either because of erroneous entry of the A09 event or because of a decision not to send the patient after all.                                                                                                  ","chapters":["CH_03"]},{"id":"ADT_A34","type":"Message","label":"ADT_A34 - Merge patient information - patient id only","description":"An A34 (merge patient information-patient ID only) event was intended for merging or changing patient identifiers.  It was used to change patient identifiers on all of this patient’s existing accounts.\r\n\r\nEvent A34 has been retained for backward compatibility only.  From V2.3.1 onwards, event A40 (Merge patient - patient identifier list) should be used instead. Only the patient identifier list has changed as a result of the merge.  See Section 3.6.2, \"Merging patient/person information,\" for a discussion of issues related to the implementation of merge messages.","chapters":["CH_03"]},{"id":"ADT_A35","type":"Message","label":"ADT_A35 - Merge patient information - account number only","description":"An A35 (merge patient information-account number only) event was intended for merging or changing an account number only.\r\n\r\nEvent A35 has been retained for backward compatibility only.  From V2.3.1 onwards, event A41 (Merge patient - patient account number) should be used instead. Only the patient account number has changed as a result of the merge.  See Section 3.6.2, \"Merging patient/person information,\" for a discussion of issues related to the implementation of merge message.","chapters":["CH_03"]},{"id":"ADT_A36","type":"Message","label":"ADT_A36 - Merge patient information - patient id and account number","description":"Event A36 has been retained for backward compatibility only. From V2.3.1 onwards, events A40 (merge patient - patient identifier list) and A41 (merge patient - patient account number) should be used instead. Both patient identifier list and the patient account number have changed as a result of the merge.","chapters":["CH_03"]},{"id":"ADT_A37","type":"Message","label":"ADT_A37 - Unlink patient information","description":"The A37 event unlinks two patient identifiers.","chapters":["CH_03"]},{"id":"ADT_A38","type":"Message","label":"ADT_A38 - Cancel pre-admit","description":"The A38 event is sent when an A05 (pre-admit a patient) event is cancelled, either because of erroneous entry of the A05 event or because of a decision not to pre-admit the patient after all.","chapters":["CH_03"]},{"id":"ADT_A39","type":"Message","label":"ADT_A39 - Merge person - patient id","description":"An A39 event is used to signal a merge of records for a person that was incorrectly filed under two different PID-2 - patient IDs.  The \"incorrect source patient ID\" identified in the MRG segment (MRG-4 prior patient ID) is to be merged with the required \"correct target patient ID\" identified in the PID segment (PID-2 - patient ID).  The \"incorrect source patient ID\" would then logically never be referenced in future transactions.  It is noted that some systems may still physically keep this \"incorrect identifier\" for audit trail purposes or other reasons associated with database index implementation requirements.\r\n\r\nEvent A39 has been retained for backward compatibility only. From V2.3.1 onwards, event A40 (merge patient - patient identifier list) should be used instead. A merge has been done at the patient identifier level.  That is, two PID-2 - patient ID identifiers have been merged into one.","chapters":["CH_03"]},{"id":"ADT_A40","type":"Message","label":"ADT_A40 - Merge patient - patient identifier list","description":"An A40 event is used to signal a merge of records for a patient that was incorrectly filed under two different identifiers.  The \"incorrect source identifier\" identified in the MRG segment (MRG-1 - prior patient identifier list) is to be merged with the required \"correct target identifier\" of the same \"identifier type code\" component identified in the PID segment (PID-3 - patient identifier list). The \"incorrect source identifier\" would then logically never be referenced in future transactions.  It is noted that some systems may still physically keep this \"incorrect identifier\" for audit trail purposes or other reasons associated with database index implementation requirements.","chapters":["CH_03"]},{"id":"ADT_A41","type":"Message","label":"ADT_A41 - Merge account - patient account number","description":"An A41 event is used to signal a merge of records for an account that was incorrectly filed under two different account numbers.  The \"incorrect source patient account number\" identified in the MRG segment (MRG-3 - prior patient account number) is to be merged with the \"correct target patient account number\" identified in the PID segment (PID-18 - patient account number). The \"incorrect source patient account number\" would then logically never be referenced in future transactions.  It is noted that some systems may still physically keep this \"incorrect identifier\" for audit trail purposes or other reasons associated with database index implementation requirements.\r\n\r\nA merge has been done at the account identifier level.  That is, two PID-18 - patient account number identifiers have been merged into one.","chapters":["CH_03"]},{"id":"ADT_A42","type":"Message","label":"ADT_A42 - Merge visit - visit number","description":"An A42 event is used to signal a merge of records for a visit that was incorrectly filed under two different visit numbers.  The \"incorrect source visit number\" identified in the MRG segment (MRG-5 - prior visit number) is to be merged with the required \"correct target visit number\" identified in the PV1 segment (PV1-19 - visit number). The \"incorrect source visit number\" would then logically never be referenced in future transactions.  It is noted that some systems may still physically keep this \"incorrect identifier\" for audit trail purposes or other reasons associated with database index implementation requirements.\r\n\r\nA merge has been done at the visit identifier level.  That is, two PV1-19 - visit number identifiers have been merged into one.","chapters":["CH_03"]},{"id":"ADT_A43","type":"Message","label":"ADT_A43 - Move patient information - patient identifier list","description":"A move has been done at the patient identifier list level.  Identifier to be moved in the PID-3 - Patient identifier list and MRG-1 - prior patient identifier list will have the same value. The \"from\" (incorrect source patient ID) and \"to\" (correct target patient ID) identifiers have different values. See A43 examples in section 5.  The identifiers involved in identifying the patient to be moved (MRG-1 - prior patient identifier list) may or may not have accounts, which may or may not have visits.  In any case, all subordinate data sets associated with the identifier in MRG-1 - prior patient identifier list are moved along with the identifier, from the \"incorrect source patient ID\" to the \"correct target patient ID\".","chapters":["CH_03"]},{"id":"ADT_A44","type":"Message","label":"ADT_A44 - Move account information - patient account number","description":"An A44 event is used to signal a move of records identified by the MRG-3 - prior patient account number from the \"incorrect source patient identifier list\" identified in the MRG segment (MRG-1 - prior patient identifier list) to the \"correct target patient identifier list\" identified in the PID segment (PID-3 - patient identifier list).\r\n\r\nA move has been done at the account identifier level.  That is, a PID-18 - patient account number associated with one PID-3 - patient identifier list has been moved to another patient identifier lis.","chapters":["CH_03"]},{"id":"ADT_A45","type":"Message","label":"ADT_A45 - Move visit information - visit number","description":"An A45 event is used to signal a move of records identified by the MRG-5 - prior visit number or the MRG-6 - prior alternate visit ID from the \"incorrect source account identifier\" identified in the MRG segment (MRG-3 - prior patient account number) to the \"correct target account identifier\" identified in the PID segment (PID-18 - patient account number).\r\n\r\nA move has been done at the visit identifier level.  That is, a PV1-19 - visit number or PV1-50 - alternate visit ID associated with one account identifier (PID-18 - patient account number) has been moved to another account identifier.","chapters":["CH_03"]},{"id":"ADT_A46","type":"Message","label":"ADT_A46 - Change patient id (for backward compatibility only)","description":"An A46 event is used to signal a change of an incorrectly assigned PID-2 - patient ID value.  The \"incorrect source patient ID\" value is stored in the MRG segment (MRG-4 - prior patient ID) and is to be changed to the \"correct target patient ID\" value stored in the PID segment (PID-2 - patient ID).\r\n\r\nEvent A46 has been retained for backward compatibility only, corresponding with PID-2 - patient ID, which is also retained for backward compatibility. From V2.3.1 onwards, event A47 (change patient identifier list) should be used instead. A change has been done at the patient identifier level.  That is, a PID-2 - patient ID has been found to be incorrect and has been changed.","chapters":["CH_03"]},{"id":"ADT_A47","type":"Message","label":"ADT_A47 - Change patient identifier list","description":"An A47 event is used to signal a change of an incorrectly assigned PID-3 - patient identifier list value. The \"incorrect source identifier\" value is stored in the MRG segment (MRG-1 - prior patient identifier list) and is to be changed to the \"correct target patient ID\" value stored in the PID segment (PID-3 patient identifier list).\r\n\r\nA change has been done at the patient identifier list level.  That is, a single PID-3 - patient identifier list value has been found to be incorrect and has been changed.","chapters":["CH_03"]},{"id":"ADT_A48","type":"Message","label":"ADT_A48 - Change alternate patient id","description":"An A48 event is used to signal a change of an incorrectly assigned alternate patient identifier value.  The \"incorrect source alternate patient ID\" value is stored in the MRG segment (MRG-2 - prior alternate patient ID) and is to be changed to the \"correct target alternate patient ID\" value stored in the PID segment (PID-4 - alternate patient ID-PID).\r\n\r\nEvent A48 has been retained for backward compatibility only, corresponding with PID-4 - alternate Patient ID-PID, which is also retained for backward compatibility.  From V2.3.1 onwards, event A47 (change patient identifier list) should be used instead.  A change has been done at the alternate patient identifier level.  That is, a PID-4 - alternate patient ID-PID has been found to be incorrect and has been changed.","chapters":["CH_03"]},{"id":"ADT_A49","type":"Message","label":"ADT_A49 - Change patient account number","description":"An A49 event is used to signal a change of an incorrectly assigned account number value.  The \"incorrect source account number\" value is stored in the MRG segment (MRG-3 - prior patient account number) and is to be changed to the \"correct target account number\" value stored in the PID segment (PID-18 - patient account number).\r\n\r\nA change has been done at the account identifier level.  That is, a PID-18 - patient account number has been found to be incorrect and has been changed.","chapters":["CH_03"]},{"id":"ADT_A50","type":"Message","label":"ADT_A50 - Change visit number","description":"An A50 event is used to signal a change of an incorrectly assigned visit number value.  The \"incorrect source visit number\" value is stored in the MRG segment (MRG-5 - prior visit number) and is to be changed to the \"correct target visit number\" value stored in the PV1 segment (PV1-19 - visit number).\r\n\r\nA change has been done at the visit identifier level.  That is, a PV1-19 - visit number has been found to be incorrect and has been changed.","chapters":["CH_03"]},{"id":"ADT_A51","type":"Message","label":"ADT_A51 - Change alternate visit id","description":"An A51 event is used to signal a change of an incorrectly assigned alternate visit ID value.  The \"incorrect source alternate visit ID\" value is stored in the MRG segment (MRG-6 - prior alternate visit ID) and is to be changed to the \"correct target alternate visit ID\" value stored in the PV1 segment (PV1-50 - alternate visit ID).\r\n\r\nA change has been done at the alternate visit identifier level.  That is, a PV1-50 - alternate visit ID has been found to be incorrect and has been changed.","chapters":["CH_03"]},{"id":"ADT_A52","type":"Message","label":"ADT_A52 - Cancel leave of absence for a patient","description":"The A52 event is sent when an A21 (patient goes on \"leave of absence\") event is cancelled, either because of erroneous entry of the A21 event or because of a decision not to put the patient on \"leave of absence\" after all.","chapters":["CH_03"]},{"id":"ADT_A53","type":"Message","label":"ADT_A53 - Cancel patient returns from a leave of absence","description":"The A53 event is sent when an A22 (patient returns from \"leave of absence\") event is cancelled, either because of erroneous entry of the A22 event or because of a decision not to return the patient from \"leave of absence\" after all.","chapters":["CH_03"]},{"id":"ADT_A54","type":"Message","label":"ADT_A54 - Change attending doctor","description":"An A54 event is issued as a result of a change in the attending doctor responsible for the treatment of a patient.","chapters":["CH_03"]},{"id":"ADT_A55","type":"Message","label":"ADT_A55 - Cancel change attending doctor","description":"The A55 event is sent when an A54 (change attending doctor) event is cancelled, either because of erroneous entry of the A54 event or because of a decision not to change the attending doctor after all. PV1-7 - attending doctor must contain the patient's doctor prior to the change of attending doctor.","chapters":["CH_03"]},{"id":"ADT_A60","type":"Message","label":"ADT_A60 - Update allergy information","description":"This trigger event is used when person/patient allergy information has changed.  It is used in conjunction with a new allergy segment, the IAM - patient allergy information segment-unique identifier, which supports Action code/unique identifier mode update for repeating segments as defined in 2.14.4 Modes for updating via repeating segments.","chapters":["CH_03"]},{"id":"ADT_A61","type":"Message","label":"ADT_A61 - Change consulting doctor","description":"An A61 event is used as a result of a change in the consulting physician(s) for the treatment of a patient.","chapters":["CH_03"]},{"id":"ADT_A62","type":"Message","label":"ADT_A62 - Cancel change consulting doctor","description":null,"chapters":["CH_03"]},{"id":"BAR_P01","type":"Message","label":"BAR_P01 - Add patient accounts","description":"Data are sent from some application (usually a Registration or an ADT system) for example, to the patient accounting or financial system to establish an account for a patient’s billing/accounts receivable record. Many of the segments associated with this event are optional.  This optionality allows those systems needing these fields to set up transactions that fulfill their requirements and yet satisfy the HL7 requirements.\r\n\r\nFrom Standard Version 2.3 onward, the P01 event should only be used to add a new account that did not exist before, not to update an existing account.  The new P05 (update account) event should be used to update an existing account.  The new P06 (end account) event should be used to close an account.  With the P01 event, EVN-2 - recorded date/time should contain the account start date.","chapters":["CH_06"]},{"id":"BAR_P02","type":"Message","label":"BAR_P02 - Purge patient accounts","description":"Generally, the elimination of all billing/accounts receivable records will be an internal function controlled, for example, by the patient accounting or financial system.  However, on occasion, there will be a need to correct an account, or a series of accounts, that may require that a notice of account deletion be sent from another sub-system and processed, for example, by the patient accounting or financial system.  Although a series of accounts may be purged within this one event, we recommend that only one PID segment be sent per event.","chapters":["CH_06"]},{"id":"BAR_P05","type":"Message","label":"BAR_P05 - Update account","description":"The P05 event is sent when an existing account is being updated.  From Standard Version 2.3 onward, the P01 (add account) event should no longer be used for updating an existing account, but only for creating a new account.  With the addition of P10 (transmit ambulatory payment classification [APC] groups) in Version 2.4, it is expected that the P05 (update account) will be used to send inpatient coding information and the P10 (transmit ambulatory payment classification [APC] groups) will be used to send outpatient coding information.","chapters":["CH_06"]},{"id":"BAR_P06","type":"Message","label":"BAR_P06 - End account","description":"The P06 event is a notification that the account is no longer open, that is, no new charges can accrue to this account.  This notification is not related to whether or not the account is paid in full.  EVN-2 - recorded date/time must contain the account end date.\r\n\r\nNote: P07-P09 have been defined by the Orders/Observations Technical Committee as product experience messages.","chapters":["CH_06"]},{"id":"BAR_P10","type":"Message","label":"BAR_P10 - Transmit ambulatory payment classification(apc)","description":"The P10 event is used to communicate Ambulatory Payment Classification (APC) grouping.  The grouping can be estimated or actual, based on the APC status indictor in GP1-1.  This information is mandated in the USA by the Health Care Financing Administration (HCFA) for reimbursement of outpatient services.  The PID and PV1 segments are included for identification purposes only. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.","chapters":["CH_06"]},{"id":"CRM_C01","type":"Message","label":"CRM_C01 - Register a patient on a clinical trial","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems.  They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place","chapters":["CH_07"]},{"id":"CRM_C02","type":"Message","label":"CRM_C02 - Cancel a patient registration on clinical trial (for clerical mistakes since an intended registration should not be canceled)","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems.  They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place","chapters":["CH_07"]},{"id":"CRM_C03","type":"Message","label":"CRM_C03 - Correct/update registration information","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems.  They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place","chapters":["CH_07"]},{"id":"CRM_C04","type":"Message","label":"CRM_C04 - Register a patient on a clinical trial","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems.  They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place","chapters":["CH_07"]},{"id":"CRM_C05","type":"Message","label":"CRM_C05 - Patient enters phase of clinical trial","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems.  They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place","chapters":["CH_07"]},{"id":"CRM_C06","type":"Message","label":"CRM_C06 - Cancel patient entering a phase (clerical mistake)","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems.  They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place","chapters":["CH_07"]},{"id":"CRM_C07","type":"Message","label":"CRM_C07 - Correct/update phase information","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems.  They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place","chapters":["CH_07"]},{"id":"CRM_C08","type":"Message","label":"CRM_C08 - Patient has gone off phase of clinical trial","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems.  They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place","chapters":["CH_07"]},{"id":"CSU_C09","type":"Message","label":"CSU_C09 - Automated time intervals for reporting, like monthly","description":"Data are entered in the clinical trials system or may reside in laboratory, pathology, radiology, pharmacy and/or other clinical applications.  Most clinical trials data - clinical observations and study variables will be communicated in OBR and OBX segments.  The CSR, CSP, and CSS segments will identify the specific association these OBR and OBX have to the clinical trial.  Data can be broadcast or transmitted in batch mode to study sponsors or the data management center for collaborative studies","chapters":["CH_07"]},{"id":"CSU_C10","type":"Message","label":"CSU_C10 - Patient completes the clinical trial","description":"Data are entered in the clinical trials system or may reside in laboratory, pathology, radiology, pharmacy and/or other clinical applications.  Most clinical trials data - clinical observations and study variables will be communicated in OBR and OBX segments.  The CSR, CSP, and CSS segments will identify the specific association these OBR and OBX have to the clinical trial.  Data can be broadcast or transmitted in batch mode to study sponsors or the data management center for collaborative studies","chapters":["CH_07"]},{"id":"CSU_C11","type":"Message","label":"CSU_C11 - Patient completes a phase of the clinical trial","description":"Data are entered in the clinical trials system or may reside in laboratory, pathology, radiology, pharmacy and/or other clinical applications.  Most clinical trials data - clinical observations and study variables will be communicated in OBR and OBX segments.  The CSR, CSP, and CSS segments will identify the specific association these OBR and OBX have to the clinical trial.  Data can be broadcast or transmitted in batch mode to study sponsors or the data management center for collaborative studies","chapters":["CH_07"]},{"id":"CSU_C12","type":"Message","label":"CSU_C12 - Update/correction of patient order/result information","description":"Data are entered in the clinical trials system or may reside in laboratory, pathology, radiology, pharmacy and/or other clinical applications.  Most clinical trials data - clinical observations and study variables will be communicated in OBR and OBX segments.  The CSR, CSP, and CSS segments will identify the specific association these OBR and OBX have to the clinical trial.  Data can be broadcast or transmitted in batch mode to study sponsors or the data management center for collaborative studies","chapters":["CH_07"]},{"id":"DFT_P03","type":"Message","label":"DFT_P03 - Post detail financial transaction","description":"The Detail Financial Transaction (DFT) message is used to describe a financial transaction transmitted between systems, that is, to the billing system for ancillary charges, ADT to billing system for patient deposits, etc.  In HL7 2.4, the message construct for the P03 is expanded to support the use cases described below.","chapters":["CH_06"]},{"id":"DOC_T12","type":"Message","label":"DOC_T12 - Document response","description":null,"chapters":["CH_09"]},{"id":"DSR_P04","type":"Message","label":"DSR_P04 - Response - Generate bills and accounts receivable statements","description":"For patient accounting systems that support demand billing, the QRY/DSR transaction, as defined in Chapter 5, will provide the mechanism with which to request a copy of the bill for printing or viewing by the requesting system","chapters":["CH_06"]},{"id":"DSR_Q01","type":"Message","label":"DSR_Q01 - Display response message","description":null,"chapters":["CH_05"]},{"id":"DSR_Q03","type":"Message","label":"DSR_Q03 - Deferred response to a query","description":null,"chapters":["CH_05"]},{"id":"EAC_U07","type":"Message","label":"EAC_U07 - Automated equipment command","description":"This message is used to send equipment commands from one application to another (e.g., a Laboratory Automation System to an automated Equipment).","chapters":["CH_13"]},{"id":"EAN_U09","type":"Message","label":"EAN_U09 - Automated equipment notification","description":"This message is used to send equipment notifications from one application to another (e.g., alerts sent by automated equipment to a Laboratory Automation System).","chapters":["CH_13"]},{"id":"EAR_U08","type":"Message","label":"EAR_U08 - Automated equipment response","description":"This message is used to send equipment responses to previously issued commands from one application to another (e.g., automated Equipment to a Laboratory Automation System).","chapters":["CH_13"]},{"id":"EDR_R07","type":"Message","label":"EDR_R07 - Enhanced display response","description":null,"chapters":["CH_05"]},{"id":"EQQ_Q04","type":"Message","label":"EQQ_Q04 - Embedded query language query","description":"This query provides an envelope with which a query expressed in a language (e.g., SQL) is packaged and sent to the responding system. It is meant to provide the maximum query function without reinventing the wheel.\r\nThe EQQ with its EQL query defining segment supports free-form select statements, based on the query language of choice (e.g., SQL).\r\n\r\nThe response to the EQQ could be tabular TBR or display EQQ. The segment pattern response (the ERP) is invalid given that there is no way to specify the desired segment pattern in the query defining segment, EQL.","chapters":["CH_05"]},{"id":"ERP_R09","type":"Message","label":"ERP_R09 - Event replay response","description":"The Event Replay Query under version 2.3 provides a way for the querying system to request data formatted very similar to the format that would have been used were this data to be sent as an update in response to a trigger event.\r\nThe RQQ is used to request data formatted as an event replay response","chapters":["CH_05"]},{"id":"ESR_U02","type":"Message","label":"ESR_U02 - Automated equipment status request","description":"This message is used to request information about a device’s or piece of equipment’s status from one application to another (e.g., Laboratory Automation System to automated equipment). The equipment identified in the EQU segment should respond with its status using the “Automated Equipment Status Update.”","chapters":["CH_13"]},{"id":"ESU_U01","type":"Message","label":"ESU_U01 - Automated equipment status update","description":"This message is used to send information about the status of a device or equipment from one application to another (e.g., automated device to a Laboratory Automation System). The status update can be sent unsolicited or as a response to the trigger “Automated Equipment Status Request.”","chapters":["CH_13"]},{"id":"INR_U06","type":"Message","label":"INR_U06 - Automated equipment inventory request","description":"This message is used to request information about inventory items from one application to another (e.g., Laboratory Automation System to automated equipment). The equipment specified in the EQU segment should respond with the information about inventory item requested in the INV segment (or all items).","chapters":["CH_13"]},{"id":"INU_U05","type":"Message","label":"INU_U05 - Automated equipment inventory update","description":"This message is used to send information about inventory items from one application to another (e.g., automated Equipment to a Laboratory Automation System).","chapters":["CH_13"]},{"id":"LSR_U13","type":"Message","label":"LSR_U13 - Automated equipment log/service request","description":"This message is used to request log and/or service events from one application to another (e.g., Laboratory Automation System to automated equipment).","chapters":["CH_13"]},{"id":"LSU_U12","type":"Message","label":"LSU_U12 - Automated equipment log/service update","description":"This message is used to send log and/or service events from one application to another (e.g., automated equipment to Laboratory Automation System).","chapters":["CH_13"]},{"id":"MDM_T01","type":"Message","label":"MDM_T01 - Original document notification","description":"This is a notification of the creation of a document without the accompanying content","chapters":["CH_09"]},{"id":"MDM_T02","type":"Message","label":"MDM_T02 - Original document notification and content","description":"This is a notification of the creation of a document with the accompanying content","chapters":["CH_09"]},{"id":"MDM_T03","type":"Message","label":"MDM_T03 - Document status change notification ","description":"This is a notification of a change in a status of a document without the accompanying content.","chapters":["CH_09"]},{"id":"MDM_T04","type":"Message","label":"MDM_T04 - Document status change notification and content","description":"This is a notification of the creation of a document with the accompanying content","chapters":["CH_09"]},{"id":"MDM_T05","type":"Message","label":"MDM_T05 - Document addendum notification","description":"This is a notification of an addendum to a document without the accompanying content.","chapters":["CH_09"]},{"id":"MDM_T06","type":"Message","label":"MDM_T06 - Document addendum notification and content","description":"This is a notification of an addendum to a document with the accompanying content.","chapters":["CH_09"]},{"id":"MDM_T07","type":"Message","label":"MDM_T07 - Document edit  notification","description":"This is a notification of an edit to a document without the accompanying content\r\n\r\nNote: The only valid use of this trigger event is for documents whose availability status is “Unavailable,” i.e., the document has not been made available for patient care.","chapters":["CH_09"]},{"id":"MDM_T08","type":"Message","label":"MDM_T08 - Document edit notification and content ","description":"This is a notification of an edit to a document with the accompanying content.\r\n\r\nNote: The only valid use of this trigger event is for documents whose availability status is \"Unavailable,\" i.e., the document has not been made available for patient care.","chapters":["CH_09"]},{"id":"MDM_T09","type":"Message","label":"MDM_T09 - Document replacement notification","description":"This is a notification of replacement to a document without the accompanying content.\r\n\r\nNote: This trigger event is generally used when the original document availability status is “Available.”","chapters":["CH_09"]},{"id":"MDM_T10","type":"Message","label":"MDM_T10 - Document replacement notification and content","description":"Scenario:   Errors discovered in a document are corrected.  The original document is replaced with the revised document.  The replacement document has its own new unique document ID that is linked to the original document via the parent ID.  The availability status of the original document is changed to “Obsolete” but the original document should be retained in the system for historical reference.  Document replacement notification and document content are sent.","chapters":["CH_09"]},{"id":"MDM_T11","type":"Message","label":"MDM_T11 - Original document notification","description":"This is a notification of a cancellation of a document.   This trigger event should be used only for an original document with an availability status of “Unavailable.”  When a document has been made available for patient care, the process should be to replace the original document, which then becomes obsolete.  The replacement document describes why the erroneous information exists.","chapters":["CH_09"]},{"id":"MFD_MFA","type":"Message","label":"MFD_MFA - Master files delayed application acknowledgment","description":"The MFD transaction is the delayed application acknowledgment.  It can be used to return  \"deferred\" application-level acknowledgment statuses at the MFE level, without reference to the original MFN message. ","chapters":["CH_08"]},{"id":"MFK_M01","type":"Message","label":"MFK_M01 - Master file application acknowledgment","description":null,"chapters":["CH_08"]},{"id":"MFK_M02","type":"Message","label":"MFK_M02 - Master file acknowledgment - Staff/practitioner master file","description":"The staff identification (STF), practitioner detail (PRA), and practitioner organization unit segment (ORG) segments can be used to transmit master files information between systems. The STF segment provides general information about personnel; the PRA and ORG segments provides detailed information for a staff member who is also a health practitioner. Other segments may be defined to follow the STF segment to provide additional detail information for a particular type of staff member: the PRA and ORG segments are the first such segments","chapters":["CH_08"]},{"id":"MFK_M04","type":"Message","label":"MFK_M04 - Master file acknowledgment - Charge description master file","description":"The charge description (CDM) master file segment should be used in conjunction with the general master file segments in Section 8.5, \"GENERAL MASTER FILE SEGMENTS.\"  Interfacing systems often need not only to communicate data about a patient’s detailed charges, but also to communicate the charge identification entries by which an application knows how to handle a particular charge code.  The charge description master is a master file.  The CDM segment below is a specially designed master file segment for interfacing charge description masters.  In the following message, the MFI-master file identifier should equal \"CDM.\"","chapters":["CH_08"]},{"id":"MFK_M05","type":"Message","label":"MFK_M05 - Master file acknowledgment - Patient location master file","description":"This section is specifically concerned with describing a master file message that should be used to transmit information which identifies the inventory of healthcare patient locations, such as nursing units, rooms, beds, clinics, exam rooms, etc.  In a network environment, this segment can be used to define patient locations to other applications.  The segment also includes the readiness states and support locations for the patient locations.","chapters":["CH_08"]},{"id":"MFK_M06","type":"Message","label":"MFK_M06 - Master file acknowledgment - Clinical study with phases and schedules master file","description":null,"chapters":["CH_08"]},{"id":"MFK_M07","type":"Message","label":"MFK_M07 - Master file acknowledgment - Clinical study without phases but with schedules master file","description":null,"chapters":["CH_08"]},{"id":"MFN_M02","type":"Message","label":"MFN_M02 - Master files notification - Staff/practitioner master file","description":"The staff identification (STF), practitioner detail (PRA), and practitioner organization unit segment (ORG) segments can be used to transmit master files information between systems. The STF segment provides general information about personnel; the PRA and ORG segments provides detailed information for a staff member who is also a health practitioner. Other segments may be defined to follow the STF segment to provide additional detail information for a particular type of staff member: the PRA and ORG segments are the first such segments.","chapters":["CH_08"]},{"id":"MFN_M04","type":"Message","label":"MFN_M04 - Master files notification - Charge description master file","description":"The charge description (CDM) master file segment should be used in conjunction with the general master file segments in Section 8.5, \"GENERAL MASTER FILE SEGMENTS.\"  Interfacing systems often need not only to communicate data about a patient’s detailed charges, but also to communicate the charge identification entries by which an application knows how to handle a particular charge code.  The charge description master is a master file.  The CDM segment below is a specially designed master file segment for interfacing charge description masters.  In the following message, the MFI-master file identifier should equal \"CDM.\"","chapters":["CH_08"]},{"id":"MFN_M05","type":"Message","label":"MFN_M05 - Master files notification - Patient location master file","description":"This section is specifically concerned with describing a master file message that should be used to transmit information which identifies the inventory of healthcare patient locations, such as nursing units, rooms, beds, clinics, exam rooms, etc.  In a network environment, this segment can be used to define patient locations to other applications.  The segment also includes the readiness states and support locations for the patient locations.","chapters":["CH_08"]},{"id":"MFN_M06","type":"Message","label":"MFN_M06 - Master files notification - Clinical study with phases and schedules master file","description":"The CM0 (Clinical Study Master), CM1 (Clinical Study Phase), and CM2 (Clinical Study Schedule) segments can be used to transmit master files information between systems. The CM0 segment contains the information about the study itself; the CM1 contains the information about one phase of the study identified in the preceding CM0; and the CM2 contains the information about the scheduled time points for the preceding study or phase-related treatment or evaluation events. \r\n\r\nCase 1: MFN message for Clinical Study with phases and schedules\r\nMFI-1 - master file identifier code = CMA","chapters":["CH_08"]},{"id":"MFN_M07","type":"Message","label":"MFN_M07 - Master files notification - Clinical study without phases but with schedules master file","description":"The CM0 (Clinical Study Master), CM1 (Clinical Study Phase), and CM2 (Clinical Study Schedule) segments can be used to transmit master files information between systems. The CM0 segment contains the information about the study itself; the CM1 contains the information about one phase of the study identified in the preceding CM0; and the CM2 contains the information about the scheduled time points for the preceding study or phase-related treatment or evaluation events.\r\n\r\nCase 2: MFN message for Clinical Study without phases but with schedules\r\nMFI-1 - master file identifier code = CMB ","chapters":["CH_08"]},{"id":"MFN_M08","type":"Message","label":"MFN_M08 - Master files notification - Test/observation (numeric) master file","description":null,"chapters":["CH_08"]},{"id":"MFN_M09","type":"Message","label":"MFN_M09 - Master files notification - Test/observation (categorical) master file","description":null,"chapters":["CH_08"]},{"id":"MFN_M10","type":"Message","label":"MFN_M10 - Master files notification - Test/observation batteries master file","description":null,"chapters":["CH_08"]},{"id":"MFN_M11","type":"Message","label":"MFN_M11 - Master files notification - Test/calculated observations master file","description":null,"chapters":["CH_08"]},{"id":"MFN_M12","type":"Message","label":"MFN_M12 - Master files notification - Service/text/observation master file","description":"Note: A service/test/observation definition may have both an OM2 (numeric) and OM3 (categorical) segment included in case the value may be either numeric and/or categorical.","chapters":["CH_08"]},{"id":"MFQ_M01","type":"Message","label":"MFQ_M01 - Master files query - Master file not otherwise specified","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. \r\n\r\n(for backward compatibility only)","chapters":["CH_08"]},{"id":"MFQ_M02","type":"Message","label":"MFQ_M02 - Master files query - Staff/practitioner master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. ","chapters":["CH_08"]},{"id":"MFQ_M03","type":"Message","label":"MFQ_M03 - Master files query - Service/test/observation master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. \r\n\r\n(for backward compatibility only)","chapters":["CH_08"]},{"id":"MFQ_M04","type":"Message","label":"MFQ_M04 - Master files query - Charge description master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. ","chapters":["CH_08"]},{"id":"MFQ_M05","type":"Message","label":"MFQ_M05 - Master files query - Patient location master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. ","chapters":["CH_08"]},{"id":"MFQ_M06","type":"Message","label":"MFQ_M06 - Master files query - Clinical study with phases and schedules master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. ","chapters":["CH_08"]},{"id":"MFQ_M07","type":"Message","label":"MFQ_M07 - Master files query - Clinical study without phases but with schedules master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. ","chapters":["CH_08"]},{"id":"MFQ_M08","type":"Message","label":"MFQ_M08 - Master files query - Test/observation (numeric) master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. ","chapters":["CH_08"]},{"id":"MFQ_M09","type":"Message","label":"MFQ_M09 - Master files query - Test/observation (categorical) master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. ","chapters":["CH_08"]},{"id":"MFQ_M10","type":"Message","label":"MFQ_M10 - Master files query - Test/observation batteries master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. ","chapters":["CH_08"]},{"id":"MFQ_M11","type":"Message","label":"MFQ_M11 - Master files query - Test/calculated observations master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. ","chapters":["CH_08"]},{"id":"MFQ_M12","type":"Message","label":"MFQ_M12 - Master files query - Service/text/observation master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. ","chapters":["CH_08"]},{"id":"MFR_M01","type":"Message","label":"MFR_M01 - Master Files Response - Master file not otherwise specified","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file. \r\n\r\n(for backward compatibility only)","chapters":["CH_08"]},{"id":"MFR_M02","type":"Message","label":"MFR_M02 - Master Files Response - Staff/practitioner master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file.","chapters":["CH_08"]},{"id":"MFR_M03","type":"Message","label":"MFR_M03 - Master Files Response - Service/test/observation master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file.\r\n\r\n(for backward compatibility only) ","chapters":["CH_08"]},{"id":"MFR_M04","type":"Message","label":"MFR_M04 - Master Files Response - Charge description master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file.","chapters":["CH_08"]},{"id":"MFR_M05","type":"Message","label":"MFR_M05 - Master Files Response - Patient Location master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file.","chapters":["CH_08"]},{"id":"MFR_M06","type":"Message","label":"MFR_M06 - Master Files Response - Clinical study with phases and schedules master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file.","chapters":["CH_08"]},{"id":"MFR_M07","type":"Message","label":"MFR_M07 - Master Files Response - Clinical study without phases but with schedules master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file.","chapters":["CH_08"]},{"id":"MFR_M08","type":"Message","label":"MFR_M08 - Master Files Response - Test/observation (numeric) master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file.","chapters":["CH_08"]},{"id":"MFR_M09","type":"Message","label":"MFR_M09 - Master Files Response - Test/observation (categorical) master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file.","chapters":["CH_08"]},{"id":"MFR_M10","type":"Message","label":"MFR_M10 - Master Files Response - Test/observation batteries master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file.","chapters":["CH_08"]},{"id":"MFR_M11","type":"Message","label":"MFR_M11 - Master Files Response - Test/calculated observations master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file.","chapters":["CH_08"]},{"id":"MFR_M12","type":"Message","label":"MFR_M12 - Master Files Response - Service/text/observation master file","description":"The MFQ/MFR transaction allows a system to query for a particular record or group records (defined by the primary key) in a particular master file.","chapters":["CH_08"]},{"id":"NMD_N02","type":"Message","label":"NMD_N02 - Application management data message","description":null,"chapters":["CH_14"]},{"id":"NMQ_N01","type":"Message","label":"NMQ_N01 - Application management query message","description":"The N01 event signifies when the NMQ (Application Management Query) message is used by one application to make application control-level requests for information or action to another application.  It has three segments, the NCK segment (system clock), the NST segment (application control-level statistics), and the NSC segment (application control-level status change). At least one of these three segments must be present in the NMQ message. If a segment is present in the NMQ message, the corresponding segment needs to be present in the NMR message to return the requested data or status","chapters":["CH_14"]},{"id":"NMR_N01","type":"Message","label":"NMR_N01 - Application management response","description":"The N01 event signifies when the NMQ (Application Management Query) message is used by one application to make application control-level requests for information or action to another application.  It has three segments, the NCK segment (system clock), the NST segment (application control-level statistics), and the NSC segment (application control-level status change). At least one of these three segments must be present in the NMQ message. If a segment is present in the NMQ message, the corresponding segment needs to be present in the NMR message to return the requested data or status","chapters":["CH_14"]},{"id":"OMD_O03","type":"Message","label":"OMD_O03 - Dietary order","description":"A diet office needs to receive specific information, the most important being the diet order itself.  Diet restrictions (often called diet codes) are the basic building blocks of a diet order.  The diet order segments may be sent as part of the ORM and ORR message structure to support backwards compatibility, or may be sent as part of the following dedicated message structures.","chapters":["CH_04"]},{"id":"OMG_O19","type":"Message","label":"OMG_O19 - General clinical order","description":"The function of this message is to initiate the transmission of information about a general clinical order that uses the OBR segment.  Messages using the ORM message with the OBR segment are supported for backward compatibility.  This includes placing new orders, cancellation of existing orders, discontinuation, holding, etc.  OMG messages can originate also with a placer, filler, or an interested third party.","chapters":["CH_04"]},{"id":"OML_O21","type":"Message","label":"OML_O21 - Laboratory order","description":"The following message structure may be used for the communication of laboratory and other order messages and must be used for lab automation messages.  While the ORM message with the OBR segment can be used for backwards compatibility for general lab messages, only the OML message should be used to take advantage of the specimen and container extensions required in laboratory automation.","chapters":["CH_04"]},{"id":"OMN_O07","type":"Message","label":"OMN_O07 - Non-stock requisition order","description":"Non-stock requisitions can use the ORM message with the RQD and RQ1 segments as the detail segment, or use the OMN and ORN messages described.","chapters":["CH_04"]},{"id":"OMP_O09","type":"Message","label":"OMP_O09 - Pharmacy/treatment order","description":"Pharmacy/Treatment Orders can use the ORM message with the RXO, RXC, and RXR segments for the detail segment, or use the OMP and ORP messages as described.","chapters":["CH_04"]},{"id":"OMS_O05","type":"Message","label":"OMS_O05 - Stock requisition order","description":"Stock requisition orders use the ORM where RQD is the detail segment for backward compatibility or can use the OMS and ORS messages described.","chapters":["CH_04"]},{"id":"ORD_O04","type":"Message","label":"ORD_O04 - Dietary order acknowledgment","description":"A diet office needs to receive specific information, the most important being the diet order itself.  Diet restrictions (often called diet codes) are the basic building blocks of a diet order.  The diet order segments may be sent as part of the ORM and ORR message structure to support backwards compatibility, or may be sent as part of the following dedicated message structures.","chapters":["CH_04"]},{"id":"ORF_R04","type":"Message","label":"ORF_R04 - Response to query; transmission of requested observation","description":null,"chapters":["CH_07"]},{"id":"ORF_W02","type":"Message","label":"ORF_W02 - Waveform result, response to query","description":"The W02 trigger event identifies QRF messages which are a response to a QRY message specifying an immediate mode query for waveform results/observations with record-oriented format.","chapters":["CH_07"]},{"id":"ORG_O20","type":"Message","label":"ORG_O20 - General clinical order response","description":"The function of this message is to respond to an OMG message.  An ORG message is the application acknowledgment to an OMG message. \r\n\r\nIn ORG the PID and ORC segments are optional, particularly in case of an error response.  However, ORC segments are always required in ORG when the OBR is present.  For example, a response ORG might include only the MSH and MSA.","chapters":["CH_04"]},{"id":"ORL_O22","type":"Message","label":"ORL_O22 - General laboratory order response message","description":"The function of this message is to respond to an OML message.  An ORL message is the application acknowledgment to an OML message.","chapters":["CH_04"]},{"id":"ORM_O01","type":"Message","label":"ORM_O01 - Order message","description":"Left for backward compatibility only.  It is recommended that the trigger events OMG, OML, OMD, OMS OMN and OMP be used instead when communicating orders and order related events.\r\n\r\nThe function of this message is to initiate the transmission of information about an order.  This includes placing new orders, cancellation of existing orders, discontinuation, holding, etc.  ORM messages can originate also with a placer, filler, or an interested third party.","chapters":["CH_04"]},{"id":"ORN_O08","type":"Message","label":"ORN_O08 - Non-stock requisition acknowledgement","description":"Non-stock requisitions can use the ORM message with the RQD and RQ1 segments as the detail segment, or use the OMN and ORN messages described.","chapters":["CH_04"]},{"id":"ORP_O10","type":"Message","label":"ORP_O10 - Pharmacy/treatment order acknowledgement","description":"Pharmacy/Treatment Orders can use the ORM message with the RXO, RXC, and RXR segments for the detail segment, or use the OMP and ORP messages as described ","chapters":["CH_04"]},{"id":"ORR_O02","type":"Message","label":"ORR_O02 - Order response","description":"The function of this message is to respond to an ORM message.  An ORR message is the application acknowledgment to an ORM message. ","chapters":["CH_04"]},{"id":"ORS_O06","type":"Message","label":"ORS_O06 - Stock requisition acknowledgement","description":"Stock requisition orders use the ORM where RQD is the detail segment for backward compatibility or can use the OMS and ORS messages described.","chapters":["CH_04"]},{"id":"ORU_R01","type":"Message","label":"ORU_R01 - Unsolicited transmission of an observation message","description":"The OUL message is designed to accommodate the laboratory processes of laboratory automation systems. The ORU message is still fully supported by HL7 for transmitting laboratory results to other systems\r\n\r\nNote:  The ORC is permitted but not required in this message.  Any information that could be included in either the ORC or the OBR must be included in the OBR on reporting.  Notice also that the ORU (and the QRY) messages accommodate reports about many patients. ","chapters":["CH_07"]},{"id":"ORU_W01","type":"Message","label":"ORU_W01 - Waveform result, unsolicited transmission of requested information","description":"The waveform response unsolicited trigger event identifies ORU messages used to transmit waveform data which are results of an ordered test or series of observations. The W01 trigger event may also be used to identify ORU messages sent as the eventual response to a QRY message specifying a deferred mode query for waveform results/observations with record-oriented format (similar to the deferred response display mode DSR message type described in Chapter 2).  One or more ORU messages with the W01 trigger event  may result from this type of QRY message.","chapters":["CH_07"]},{"id":"OSQ_Q06","type":"Message","label":"OSQ_Q06 - Query for order status","description":null,"chapters":["CH_04"]},{"id":"OSR_Q06","type":"Message","label":"OSR_Q06 - Query response for order status","description":null,"chapters":["CH_04"]},{"id":"OUL_R21","type":"Message","label":"OUL_R21 - Unsolicited laboratory observation","description":"This message was designed to accommodate laboratory automation systems.  It permits the communication of the following kinds of information in addition to the results themselves: relation of the analysis results to a particular container with patient sample (SAC segment),","chapters":["CH_07"]},{"id":"PEX_P07","type":"Message","label":"PEX_P07 - Unsolicited initial individual product experience report","description":"The primary application of this message is to transfer information related to an adverse event occurring while a patient was exposed to a product","chapters":["CH_07"]},{"id":"PEX_P08","type":"Message","label":"PEX_P08 - Unsolicited update individual product experience report","description":"The primary application of this message is to transfer information related to an adverse event occurring while a patient was exposed to a product","chapters":["CH_07"]},{"id":"PGL_PC6","type":"Message","label":"PGL_PC6 - Goal add","description":"This message is used to send goals from one application to another (e.g., a point of care system to a clinical repository).  Many of the segments associated with this event are optional.  This optionality allows systems in need of this information to set up transactions that fulfill their requirements.","chapters":["CH_12"]},{"id":"PGL_PC7","type":"Message","label":"PGL_PC7 - Goal update","description":"This message is used to send goals from one application to another (e.g., a point of care system to a clinical repository).  Many of the segments associated with this event are optional.  This optionality allows systems in need of this information to set up transactions that fulfill their requirements.","chapters":["CH_12"]},{"id":"PGL_PC8","type":"Message","label":"PGL_PC8 - Goal delete","description":"This message is used to send goals from one application to another (e.g., a point of care system to a clinical repository).  Many of the segments associated with this event are optional.  This optionality allows systems in need of this information to set up transactions that fulfill their requirements.","chapters":["CH_12"]},{"id":"PIN_I07","type":"Message","label":"PIN_I07 - Unsolicited insurance information","description":"This trigger event is used by an entity or organization to transmit to a healthcare provider the insurance information on a specific patient.  Typically, the healthcare provider will be a primary care provider.","chapters":["CH_11"]},{"id":"PMU_B01","type":"Message","label":"PMU_B01 - Add personnel record","description":"An event B01 signals to add a new record for healthcare administration information about an individual healthcare practitioner establishing a relationship between that practitioner and the institution.\r\n\r\nThe EVN segment is used to indicate the effective or planned date.","chapters":["CH_15"]},{"id":"PMU_B02","type":"Message","label":"PMU_B02 - Update personnel record","description":"An event B02 signals to update the record with the healthcare administration information about an individual healthcare practitioner.","chapters":["CH_15"]},{"id":"PMU_B03","type":"Message","label":"PMU_B03 - Delete personnel record","description":"An event B03 signals to delete the record with the healthcare administration information about an individual healthcare practitioner to correct erroneous entries.","chapters":["CH_15"]},{"id":"PMU_B04","type":"Message","label":"PMU_B04 - Active practicing person","description":"An event B04 signals that a staff member is available for work (e.g. schedules can be created) and has a relationship with the institution.  This message applies to STF-7.","chapters":["CH_15"]},{"id":"PMU_B05","type":"Message","label":"PMU_B05 - Deactivate practicing person","description":"An event B05 indicates that a staff member is temporarily unavailable for work, while maintaining a relationship with the institution.  This message applies to STF-7.","chapters":["CH_15"]},{"id":"PMU_B06","type":"Message","label":"PMU_B06 - Terminate practicing person","description":"An event B06 signals that the formal relationship between a staff member and the institution has ended (e.g. upon termination).","chapters":["CH_15"]},{"id":"PPG_PCG","type":"Message","label":"PPG_PCG - Pathway (goal-oriented) add","description":null,"chapters":["CH_12"]},{"id":"PPG_PCH","type":"Message","label":"PPG_PCH - Pathway (goal-oriented) update","description":null,"chapters":["CH_12"]},{"id":"PPG_PCJ","type":"Message","label":"PPG_PCJ - Pathway (goal-oriented) delete","description":null,"chapters":["CH_12"]},{"id":"PPP_PCB","type":"Message","label":"PPP_PCB - Pathway (problem-oriented) add","description":null,"chapters":["CH_12"]},{"id":"PPP_PCC","type":"Message","label":"PPP_PCC - Pathway (problem-oriented) update","description":null,"chapters":["CH_12"]},{"id":"PPP_PCD","type":"Message","label":"PPP_PCD - Pathway (problem-oriented) delete","description":null,"chapters":["CH_12"]},{"id":"PPR_PC1","type":"Message","label":"PPR_PC1 - Problem add","description":"The patient problem message is used to send problems from one application to another (e.g., a point of care system to a clinical repository).  Many of the segments associated with this event are optional.  This optionality allows systems in need of this information to set up transactions that fulfill their requirements","chapters":["CH_12"]},{"id":"PPR_PC2","type":"Message","label":"PPR_PC2 - Problem update","description":"The patient problem message is used to send problems from one application to another (e.g., a point of care system to a clinical repository).  Many of the segments associated with this event are optional.  This optionality allows systems in need of this information to set up transactions that fulfill their requirements","chapters":["CH_12"]},{"id":"PPR_PC3","type":"Message","label":"PPR_PC3 - Problem delete","description":"The patient problem message is used to send problems from one application to another (e.g., a point of care system to a clinical repository).  Many of the segments associated with this event are optional.  This optionality allows systems in need of this information to set up transactions that fulfill their requirements","chapters":["CH_12"]},{"id":"PPT_PCL","type":"Message","label":"PPT_PCL - Pathway (goal-oriented) query response","description":"The following trigger/message event is served by PPT (a response from the system responsible for maintaining the goal-oriented pathway information).","chapters":["CH_12"]},{"id":"PPV_PCA","type":"Message","label":"PPV_PCA - Patient goal response","description":"The following trigger/message event is served by PPV (a response from the system responsible for maintaining the goal information).","chapters":["CH_12"]},{"id":"PRR_PC5","type":"Message","label":"PRR_PC5 - Patient problem response","description":"The following trigger/message event is served by PRR (a response from the system responsible for maintaining the problem information).","chapters":["CH_12"]},{"id":"PTR_PCF","type":"Message","label":"PTR_PCF - Pathway (problem-oriented) query response","description":"The following trigger/message event is served by PTR (a response from the system responsible for maintaining the problem-oriented pathway information).","chapters":["CH_12"]},{"id":"QBP_Q11","type":"Message","label":"QBP_Q11 - Query by parameter","description":"The QBP_Q11 structure supports a Segment Pattern Response and contains the MSH, QPD, RCP, and DSC segments.  Its default trigger event is Q11.  A standard or site-defined query may use this trigger event or may specify a unique trigger event value in its Conformance Statement.  If a unique trigger event value is chosen for a site-defined query, that value must begin with Z.","chapters":["CH_05"]},{"id":"QBP_Q13","type":"Message","label":"QBP_Q13 - Query by parameter/tabular response ","description":"The QBP_Q13 structure supports a Tabular Response and contains the MSH, RDF, RCP, and DSC segments.  Its default trigger event is Q13.  A standard or site-defined query may use this trigger event or may specify a unique trigger event value in its Conformance Statement.  If a unique trigger event value is chosen for a site-defined query, that value must begin with Z.","chapters":["CH_05"]},{"id":"QBP_Q15","type":"Message","label":"QBP_Q15 - Query by parameter/display response","description":"The QBP_Q15 structure supports a Display Response and contains the MSH, QPD, RCP, and DSC segments.  Its default trigger event is Q15.  A standard or site-defined query may use this trigger event or may specify a unique trigger event value in its Conformance Statement.  If a unique trigger event value is chosen for a site-defined query, that value must begin with Z.","chapters":["CH_05"]},{"id":"QBP_Q21","type":"Message","label":"QBP_Q21 - Query - Get Person Demographics","description":"This query/response is designed for interaction between a client system and an MPI (Master Person Index). The query consists of an identifier for a person, and the response the demographics for that person.","chapters":["CH_03"]},{"id":"QBP_Q22","type":"Message","label":"QBP_Q22 - Query - Find Candidates","description":"This query/response is designed for interaction between a client system and an MPI (Master Person Index). The query consists of a set of demographics for a person, and the response is the list of candidates considered by the MPI to match that set.","chapters":["CH_03"]},{"id":"QBP_Q23","type":"Message","label":"QBP_Q23 - Query - Get Corresponding Identifiers","description":"This query/response is designed for interaction between a client system and an MPI (Master Person Index). The query consists of an identifier for a person, and the response is a list of identifiers for that person from the domains specified.","chapters":["CH_03"]},{"id":"QBP_Q24","type":"Message","label":"QBP_Q24 - Query - Allocate identifiers","description":"This query/response is designed for interaction between a client system and an MPI (Master Person Index). The query consists of domains in which identifiers should be allocated. The response is new identifiers in those domains.","chapters":["CH_03"]},{"id":"QBP_Q25","type":"Message","label":"QBP_Q25 - Query - Personnel information","description":"The following trigger event is served by the following Conformance Statement: Another application determines a need for Personnel data about a person and sends a query to a system providing this information.","chapters":["CH_15"]},{"id":"QCK_Q02","type":"Message","label":"QCK_Q02 - Deferred query","description":null,"chapters":["CH_05"]},{"id":"QCN_J01","type":"Message","label":"QCN_J01 - Cancel query/acknowledge message","description":null,"chapters":["CH_05"]},{"id":"QRY_A19","type":"Message","label":"QRY_A19 - Patient query","description":"The following trigger event is served by QRY (a query from another system) and ADR (a response from an Patient Administration system.)","chapters":["CH_03"]},{"id":"QRY_P04","type":"Message","label":"QRY_P04 - Query - Generate bills and accounts receivable statements","description":"For patient accounting systems that support demand billing, the QRY/DSR transaction, as defined in Chapter 5, will provide the mechanism with which to request a copy of the bill for printing or viewing by the requesting system","chapters":["CH_06"]},{"id":"QRY_PC4","type":"Message","label":"QRY_PC4 - Patient care problem query","description":"The following trigger/message event is served by QRY (a query from another system).  The QRD-8-who filter identifies the patient or account number upon which the query is defined and can contain a Format Code of R (record-oriented).  If the query is based on the Patient ID and there are data associated with multiple accounts, the problem of which account data should be returned becomes an implementation issue.","chapters":["CH_12"]},{"id":"QRY_PC9","type":"Message","label":"QRY_PC9 - Patient goal query","description":"The following trigger/message event is served by QRY (a query from another system).  The QRD-8-who filter identifies the patient or account number upon which the query is defined and can contain a Format Code of R (record-oriented).  If the query is based on the Patient ID and there are data associated with multiple accounts, the problem of which account data should be returned becomes an implementation issue.","chapters":["CH_12"]},{"id":"QRY_PCE","type":"Message","label":"QRY_PCE - Patient pathway (problem-oriented) query","description":"The following trigger/message event is served by QRY (a query from another system).  The QRD-8-who filter identifies the patient or account number upon which the query is defined and can contain a Format Code of R (record-oriented).  If the query is based on the Patient ID and there are data associated with multiple accounts, the problem of which account data should be returned becomes an implementation issue.","chapters":["CH_12"]},{"id":"QRY_PCK","type":"Message","label":"QRY_PCK - Patient pathway (goal-oriented) query","description":"The following trigger/message event is served by QRY (a query from another system).  The QRD-8-who filter identifies the patient or account number upon which the query is defined and can contain a Format Code of R (record-oriented).  If the query is based on the Patient ID and there are data associated with multiple accounts, the problem of which account data should be returned becomes an implementation issue","chapters":["CH_12"]},{"id":"QRY_Q01","type":"Message","label":"QRY_Q01 - Query sent for immediate response","description":null,"chapters":["CH_05"]},{"id":"QRY_Q02","type":"Message","label":"QRY_Q02 - Query sent for deferred response","description":null,"chapters":["CH_05"]},{"id":"QRY_Q26","type":"Message","label":"QRY_Q26 - Pharmacy/treatment order query","description":"Query (QRY_Q26) / Response (ROR_ROR)","chapters":["CH_04"]},{"id":"QRY_Q27","type":"Message","label":"QRY_Q27 - Pharmacy/treatment administration information query","description":"Query (QRY_Q27) / Response (RAR_RAR)","chapters":["CH_04"]},{"id":"QRY_Q28","type":"Message","label":"QRY_Q28 - Pharmacy/treatment dispense information query","description":"Query (QRY_Q28) / Response (RDR_RDR)","chapters":["CH_04"]},{"id":"QRY_Q29","type":"Message","label":"QRY_Q29 - Pharmacy/treatment encoded order information query","description":"Query (QRY_Q29) / Response (RER_RER)","chapters":["CH_04"]},{"id":"QRY_Q30","type":"Message","label":"QRY_Q30 - Pharmacy/treatment dose information query","description":"Query (QRY_Q30) / Response (RGR_RGR)","chapters":["CH_04"]},{"id":"QRY_R02","type":"Message","label":"QRY_R02 - Query for results of observation","description":null,"chapters":["CH_07"]},{"id":"QRY_T12","type":"Message","label":"QRY_T12 - Document query","description":null,"chapters":["CH_09"]},{"id":"QSB_Q16","type":"Message","label":"QSB_Q16 - Create subscription","description":"Returns lab results reports for the patient(s) as constrained in the input parameters.","chapters":["CH_05"]},{"id":"QSX_J02","type":"Message","label":"QSX_J02 - Cancel subscription/acknowledge message","description":null,"chapters":["CH_05"]},{"id":"QVR_Q17","type":"Message","label":"QVR_Q17 - Query for previous events","description":"The Query for Previous Events is like a Query by Parameter with a Segment Pattern Response except that the response consists of zero to many messages of the type defined in the Conformance Statement rather than a single response message containing multiple iterations of the segment pattern.  While the messages sent in response to a QVR will reflect events which occurred in the past, the time stamp in the message header will reflect the time the message is actually constructed (current time).  It is also similar to the previous generation VQQ/RQQ Event Replay.","chapters":["CH_05"]},{"id":"RAR_RAR","type":"Message","label":"RAR_RAR - Pharmacy/treatment administration information response","description":"This query/response pair is retained for backward compatibility only.  Please refer to Chapter 5 for detailed coverage of query/response methodology to be employed in Versions 2.4 and later.","chapters":["CH_04"]},{"id":"RAS_O17","type":"Message","label":"RAS_O17 - Pharmacy/treatment administration","description":"The RAS message may be created by the administering application (e.g., nursing application) for each instance of administration for an existing order.  If the administering application wants to report several administrations of medication/treatment for a given order with a single RAS message, each instance is reported by a separate (repeating) RXA segment.  In addition, the administration records for a group of orders may be sent in a single message by creating repeating groups of segments at the ORC level.","chapters":["CH_04"]},{"id":"RCI_I05","type":"Message","label":"RCI_I05 - Request for patient clinical information acknowledgement","description":"This event is used to request clinical information for a specific patient.  Generally, this transaction occurs between one provider and another (typically a laboratory or radiology, etc.).  However, it may also be very useful for a payor-to-provider request for clinical observation information to be used in considering a request for treatment authorization.","chapters":["CH_11"]},{"id":"RCL_I06","type":"Message","label":"RCL_I06 - Request/receipt of clinical data listing acknowledgement","description":"This event code is sent from one healthcare provider to another  (typically a laboratory or radiology, etc.) to request a list of available clinical observation information.  When the provider is dealing with a community model in which remote requests make transmission of large amounts of data impractical, this event code will provide for interactive lists of transactions from which more specific selections can be made.","chapters":["CH_11"]},{"id":"RDE_O11","type":"Message","label":"RDE_O11 - Pharmacy/treatment encoded order","description":"This message communicates the pharmacy or treatment application’s encoding of the pharmacy/treatment order (ORM message with RXO segment, see above).  It may be sent as an unsolicited message to report on either a single order or multiple pharmacy/treatment orders for a patient.\r\n\r\nThe RDE/RRE is also used to communicate a refill authorization request originating with the pharmacy","chapters":["CH_04"]},{"id":"RDR_RDR","type":"Message","label":"RDR_RDR - Pharmacy/treatment dispense information response","description":"This query/response pair is retained for backward compatibility only.  Please refer to Chapter 5 for detailed coverage of query/response methodology to be employed in Versions 2.4 and later.","chapters":["CH_04","CH_05"]},{"id":"RDS_O13","type":"Message","label":"RDS_O13 - Pharmacy/treatment dispense","description":"The RDS message may be created by the pharmacy/treatment application for each instance of dispensing a drug or treatment to fill an existing order or orders.  In the most common case, the RDS messages would be routed to a Nursing application or to some clinical application, which needs the data about drugs dispensed or treatments given.  As a site-specific variant, the original order segments (RXO, RXE and their associated RXR/RXCs) may be sent optionally (for comparison).","chapters":["CH_04"]},{"id":"RDY_K15","type":"Message","label":"RDY_K15 - Display based response","description":"The RDY_K15 supports a Display Response to the QBP and contains the MSH, MSA, ERR, QAK, DSP, and the DSC.  Its default trigger event is K15.  A standard or site-defined response may use this trigger event or may specify a unique trigger event value in its Conformance Statement.  If a unique trigger event value is chosen for a site-defined response, that value must begin with Z.","chapters":["CH_05"]},{"id":"REF_I12","type":"Message","label":"REF_I12 - Patient referral","description":"This event triggers a message to be sent from one healthcare provider to another regarding a specific patient.  The referral message may contain patient demographic information, specific medical procedures to be performed (accompanied by previously obtained authorizations) and relevant clinical information pertinent to the patient’s case.","chapters":["CH_11"]},{"id":"REF_I13","type":"Message","label":"REF_I13 - Modify patient referral","description":"This event triggers a message to be sent from one healthcare provider to another regarding changes to an existing referral.  Changes in a referral may include additional instructions from the referring provider, additional clinical information, and even additional information on patient demographics.","chapters":["CH_11"]},{"id":"REF_I14","type":"Message","label":"REF_I14 - Cancel patient referral","description":"This event triggers a message to be sent from one healthcare provider to another canceling a referral.  A previous referral may have been made in error, or perhaps the cancellation has come from the patient.","chapters":["CH_11"]},{"id":"REF_I15","type":"Message","label":"REF_I15 - Request patient referral status","description":"This event triggers a message to be sent between healthcare providers regarding the status of a patient referral request.  A previous referral has been made and acknowledged; however, no response has been received to indicate results and/or procedures performed.","chapters":["CH_11"]},{"id":"RER_RER","type":"Message","label":"RER_RER - Pharmacy/treatment encoded order information response","description":"This query/response pair is retained for backward compatibility only.  Please refer to Chapter 5 for detailed coverage of query/response methodology to be employed in Versions 2.4 and later.","chapters":["CH_04"]},{"id":"RGR_RGR","type":"Message","label":"RGR_RGR - Pharmacy/treatment dose information response","description":"This query/response pair is retained for backward compatibility only.  Please refer to Chapter 5 for detailed coverage of query/response methodology to be employed in Versions 2.4 and later.","chapters":["CH_04"]},{"id":"RGV_O15","type":"Message","label":"RGV_O15 - Pharmacy/treatment give","description":"The RGV message uses the RXG segment to record drug or treatment administration instructions.  It may carry information about a single scheduled administration on a drug or treatment, or it may carry information about multiple administrations.","chapters":["CH_04"]},{"id":"ROR_ROR","type":"Message","label":"ROR_ROR - Pharmacy prescription order query response","description":"This query/response pair is retained for backward compatibility only.  Please refer to Chapter 5 for detailed coverage of query/response methodology to be employed in Versions 2.4 and later.","chapters":["CH_04"]},{"id":"RPA_I08","type":"Message","label":"RPA_I08 - Request for treatment authorization information acknowledgement","description":"This event triggers a message to be sent from a healthcare provider to a payor requesting authorization to perform specific medical procedures or tests on a given patient.  The specific medical procedures must be filled out in the PR1 segments.  Each repeating PR1 segment may be paired with an AUT segment so that authorization information can be given regarding dollar amounts, number of treatments, and perhaps the estimated length of stay for treatment.  The OBR and OBX segments should be used to include any relevant clinical information that may be required to support or process the authorization.","chapters":["CH_11"]},{"id":"RPA_I09","type":"Message","label":"RPA_I09 - Request for modification to an authorization acknowledgement","description":"This event triggers a message sent from a healthcare provider to a payor requesting changes to a previously referenced authorization.  For example, a provider may determine that a substitute testing or surgical procedure should be performed on a specified patient.","chapters":["CH_11"]},{"id":"RPA_I10","type":"Message","label":"RPA_I10 - Request for resubmission of an authorization acknowledgement","description":"If a previously submitted request for treatment authorization is rejected or canceled, this event could trigger a resubmission message for a referenced authorization.  For example, the payor may have rejected a request until additional clinical information is sent to support the authorization request.","chapters":["CH_11"]},{"id":"RPA_I11","type":"Message","label":"RPA_I11 - Request for cancellation of an authorization acknowledgement","description":"This event may trigger the cancellation of an authorization.  It may be used by the provider to indicate that an authorized service was not performed, or perhaps that the patient changed to another provider.  A payor may use this request to reject a submitted authorization request from a provider.","chapters":["CH_11"]},{"id":"RPI_I01","type":"Message","label":"RPI_I01 - Request for insurance information acknowledgement","description":"This event triggers a message to be sent from one healthcare provider to another to request insurance information for a specified patient.","chapters":["CH_11"]},{"id":"RPI_I04","type":"Message","label":"RPI_I04 - Request for patient demographic data acknowledgement","description":"This event triggers a request from one healthcare provider to another for patient demographic information, including insurance and billing information.  Typically, this transaction would occur between one provider to another, but it could also be directed to a payor.","chapters":["CH_11"]},{"id":"RPL_I02","type":"Message","label":"RPL_I02 - Request/receipt of patient selection display list acknowledgement","description":"This trigger event occurs when the inquirer specifies a request for a name lookup listing.  Generally, this request is used by the responder when insufficient data is on hand for a positive match.  In this case, the requester may ask for a list of possible candidates from which to make a selection.  This event code is also used by the responder to signify that the return information contains a list of information rather than information specific to a single patient.","chapters":["CH_11"]},{"id":"RPR_I03","type":"Message","label":"RPR_I03 - Request/receipt of patient selection list acknowledgement","description":"This trigger event occurs when the inquirer specifies a request for a listing of patient names.  This event differs from event I02 (request/receipts of patient selection display list) in that it returns the patient list in repeating PID segments instead of repeating DSP segments.","chapters":["CH_11"]},{"id":"RQA_I08","type":"Message","label":"RQA_I08 - Request for treatment authorization information","description":"This event triggers a message to be sent from a healthcare provider to a payor requesting authorization to perform specific medical procedures or tests on a given patient.  The specific medical procedures must be filled out in the PR1 segments.  Each repeating PR1 segment may be paired with an AUT segment so that authorization information can be given regarding dollar amounts, number of treatments, and perhaps the estimated length of stay for treatment.  The OBR and OBX segments should be used to include any relevant clinical information that may be required to support or process the authorization.","chapters":["CH_11"]},{"id":"RQA_I09","type":"Message","label":"RQA_I09 - Request for modification to an authorization","description":"This event triggers a message sent from a healthcare provider to a payor requesting changes to a previously referenced authorization.  For example, a provider may determine that a substitute testing or surgical procedure should be performed on a specified patient.","chapters":["CH_11"]},{"id":"RQA_I10","type":"Message","label":"RQA_I10 - Request for resubmission of an authorization","description":"If a previously submitted request for treatment authorization is rejected or canceled, this event could trigger a resubmission message for a referenced authorization.  For example, the payor may have rejected a request until additional clinical information is sent to support the authorization request.","chapters":["CH_11"]},{"id":"RQA_I11","type":"Message","label":"RQA_I11 - Request for cancellation of an authorization","description":"This event may trigger the cancellation of an authorization.  It may be used by the provider to indicate that an authorized service was not performed, or perhaps that the patient changed to another provider.  A payor may use this request to reject a submitted authorization request from a provider.","chapters":["CH_11"]},{"id":"RQC_I05","type":"Message","label":"RQC_I05 - Request for patient clinical information","description":"This event is used to request clinical information for a specific patient.  Generally, this transaction occurs between one provider and another (typically a laboratory or radiology, etc.).  However, it may also be very useful for a payor-to-provider request for clinical observation information to be used in considering a request for treatment authorization.","chapters":["CH_11"]},{"id":"RQC_I06","type":"Message","label":"RQC_I06 - Request/receipt of clinical data listing","description":"This event code is sent from one healthcare provider to another  (typically a laboratory or radiology, etc.) to request a list of available clinical observation information.  When the provider is dealing with a community model in which remote requests make transmission of large amounts of data impractical, this event code will provide for interactive lists of transactions from which more specific selections can be made.","chapters":["CH_11"]},{"id":"RQI_I01","type":"Message","label":"RQI_I01 - Request for insurance information","description":"This event triggers a message to be sent from one healthcare provider to another to request insurance information for a specified patient.","chapters":["CH_11"]},{"id":"RQI_I02","type":"Message","label":"RQI_I02 - Request/receipt of patient selection display list","description":"This trigger event occurs when the inquirer specifies a request for a name lookup listing.  Generally, this request is used by the responder when insufficient data is on hand for a positive match.  In this case, the requester may ask for a list of possible candidates from which to make a selection.  This event code is also used by the responder to signify that the return information contains a list of information rather than information specific to a single patient.","chapters":["CH_11"]},{"id":"RQI_I03","type":"Message","label":"RQI_I03 - Request/receipt of patient selection list","description":"This trigger event occurs when the inquirer specifies a request for a listing of patient names.  This event differs from event I02 (request/receipts of patient selection display list) in that it returns the patient list in repeating PID segments instead of repeating DSP segments.","chapters":["CH_11"]},{"id":"RQP_I04","type":"Message","label":"RQP_I04 - Request for patient demographic data","description":"This event triggers a request from one healthcare provider to another for patient demographic information, including insurance and billing information.  Typically, this transaction would occur between one provider to another, but it could also be directed to a payor.","chapters":["CH_11"]},{"id":"RQQ_Q09","type":"Message","label":"RQQ_Q09 - Event replay query","description":"The Event Replay Query under version 2.3 provides a way for the querying system to request data formatted very similar to the format that would have been used were this data to be sent as an update in response to a trigger event.\r\nThe RQQ is used to request data formatted as an event replay response","chapters":["CH_05"]},{"id":"RRA_O18","type":"Message","label":"RRA_O18 - Pharmacy/treatment administration acknowledgement","description":"The RAS message may be created by the administering application (e.g., nursing application) for each instance of administration for an existing order.  If the administering application wants to report several administrations of medication/treatment for a given order with a single RAS message, each instance is reported by a separate (repeating) RXA segment.  In addition, the administration records for a group of orders may be sent in a single message by creating repeating groups of segments at the ORC level.","chapters":["CH_04"]},{"id":"RRD_O14","type":"Message","label":"RRD_O14 - Pharmacy/treatment dispense acknowledgement","description":"The RDS message may be created by the pharmacy/treatment application for each instance of dispensing a drug or treatment to fill an existing order or orders.  In the most common case, the RDS messages would be routed to a Nursing application or to some clinical application, which needs the data about drugs dispensed or treatments given.  As a site-specific variant, the original order segments (RXO, RXE and their associated RXR/RXCs) may be sent optionally (for comparison).","chapters":["CH_04"]},{"id":"RRE_O12","type":"Message","label":"RRE_O12 - Pharmacy/treatment encoded order acknowledgement","description":"This message communicates the pharmacy or treatment application’s encoding of the pharmacy/treatment order (ORM message with RXO segment, see above).  It may be sent as an unsolicited message to report on either a single order or multiple pharmacy/treatment orders for a patient.\r\n\r\nThe RDE/RRE is also used to communicate a refill authorization request originating with the pharmacy","chapters":["CH_04"]},{"id":"RRG_O16","type":"Message","label":"RRG_O16 - Pharmacy/treatment give acknowledgement","description":"The RGV message uses the RXG segment to record drug or treatment administration instructions.  It may carry information about a single scheduled administration on a drug or treatment, or it may carry information about multiple administrations.","chapters":["CH_04"]},{"id":"RRI_I12","type":"Message","label":"RRI_I12 - Patient referral acknowledgement","description":"This event triggers a message to be sent from one healthcare provider to another regarding a specific patient.  The referral message may contain patient demographic information, specific medical procedures to be performed (accompanied by previously obtained authorizations) and relevant clinical information pertinent to the patient’s case.","chapters":["CH_11"]},{"id":"RRI_I13","type":"Message","label":"RRI_I13 - Modify patient referral acknowledgement","description":"This event triggers a message to be sent from one healthcare provider to another regarding changes to an existing referral.  Changes in a referral may include additional instructions from the referring provider, additional clinical information, and even additional information on patient demographics.","chapters":["CH_11"]},{"id":"RRI_I14","type":"Message","label":"RRI_I14 - Cancel patient referral acknowledgement","description":"This event triggers a message to be sent from one healthcare provider to another canceling a referral.  A previous referral may have been made in error, or perhaps the cancellation has come from the patient.","chapters":["CH_11"]},{"id":"RRI_I15","type":"Message","label":"RRI_I15 - Request patient referral status acknowledgement","description":"This event triggers a message to be sent between healthcare providers regarding the status of a patient referral request.  A previous referral has been made and acknowledged; however, no response has been received to indicate results and/or procedures performed.","chapters":["CH_11"]},{"id":"RSP_K11","type":"Message","label":"RSP_K11 - Segment pattern response","description":"The RSP_K11 supports a Segment Pattern Response to the QBP and contains the MSH, MSA, ERR, QAK, QPD, variable content segments, and the DSC.  Its default trigger event is K11.  A standard or sitedefined response may use this trigger event or may specify a unique trigger event value in its Conformance Statement.  If a unique trigger event value is chosen for a site-defined response, that value must begin with Z.","chapters":["CH_05"]},{"id":"RSP_K13","type":"Message","label":"RSP_K13 - Segment pattern response","description":null,"chapters":["CH_05"]},{"id":"RSP_K15","type":"Message","label":"RSP_K15 - Segment pattern response","description":null,"chapters":["CH_05"]},{"id":"RSP_K21","type":"Message","label":"RSP_K21 - Response - Person demographics","description":"This query/response is designed for interaction between a client system and an MPI (Master Person Index). The query consists of an identifier for a person, and the response the demographics for that person.","chapters":["CH_03"]},{"id":"RSP_K22","type":"Message","label":"RSP_K22 - Response - Find candidates","description":"This query/response is designed for interaction between a client system and an MPI (Master Person Index). The query consists of a set of demographics for a person, and the response is the list of candidates considered by the MPI to match that set.","chapters":["CH_03"]},{"id":"RSP_K23","type":"Message","label":"RSP_K23 - Response - Get corresponding identifiers","description":"This query/response is designed for interaction between a client system and an MPI (Master Person Index). The query consists of an identifier for a person, and the response is a list of identifiers for that person from the domains specified.","chapters":["CH_03"]},{"id":"RSP_K24","type":"Message","label":"RSP_K24 - Response - Allocate identifiers","description":"This query/response is designed for interaction between a client system and an MPI (Master Person Index). The query consists of domains in which identifiers should be allocated. The response is new identifiers in those domains.","chapters":["CH_03"]},{"id":"RSP_K25","type":"Message","label":"RSP_K25 - Response - Personnel information","description":"The following trigger event is served by the following Conformance Statement: Another application determines a need for Personnel data about a person and sends a query to a system providing this information.","chapters":["CH_15"]},{"id":"RTB_K13","type":"Message","label":"RTB_K13 - Table Based Response","description":"The RTB_K13 supports a Tabular Response to the QBP and contains the MSH, MSA, ERR, QAK, QPD, RDF, RDT and the DSC.  Its default trigger event is K13.  A standard or site-defined response may use this trigger event or may specify a unique trigger event value in its Conformance Statement.  If a unique trigger event value is chosen for a site-defined response, that value must begin with Z.","chapters":["CH_05"]},{"id":"RTB_Q13","type":"Message","label":"RTB_Q13 - Tabular response","description":null,"chapters":["CH_05"]},{"id":"SIU_S12","type":"Message","label":"SIU_S12 - Notification of new appointment booking","description":"This message is sent from a filler application to notify other applications that a new appointment has been booked.  The information provided in the SCH segment and the other detail segments as appropriate describe the appointment that has been booked by the filler application.","chapters":["CH_10"]},{"id":"SIU_S13","type":"Message","label":"SIU_S13 - Notification of Appointment Rescheduling","description":"This message is sent from a filler application to notify other applications that an existing appointment has been rescheduled.  The information in the SCH segment and the other detail segments as appropriate describe the new date(s) and time(s) to which the previously booked appointment has been moved.  Additionally, it describes the unchanged information in the previously booked appointment.","chapters":["CH_10"]},{"id":"SIU_S14","type":"Message","label":"SIU_S14 - Notification of Appointment Modification","description":"This message notifies other applications that an existing appointment has been modified on the filler application.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.","chapters":["CH_10"]},{"id":"SIU_S15","type":"Message","label":"SIU_S15 - Notification of Appointment Cancellation","description":"A notification of appointment cancellation is sent by the filler application to other applications when an existing appointment has been canceled.  A cancel event is used to stop a valid appointment from taking place.  For example, if a patient scheduled for an exam cancels his/her appointment, then the appointment is canceled on the filler application.","chapters":["CH_10"]},{"id":"SIU_S16","type":"Message","label":"SIU_S16 - Notification of Appointment Discontinuation","description":"A notification of appointment discontinuation is sent by the filler application to notify other applications that an appointment in progress has been stopped, or that the remaining occurrences of a parent appointment will not occur.  If none of the child appointments of a parent appointment have taken place, then a cancel trigger event should be sent instead.","chapters":["CH_10"]},{"id":"SIU_S17","type":"Message","label":"SIU_S17 - Notification of Appointment Deletion","description":"A notification of appointment deletion is sent by the filler application to other applications when an appointment that had been entered in error has been removed from the system.  A delete trigger event should only be used when an appointment has been erroneously scheduled.  It must be removed from the schedule so that it does not affect any statistical processing.  A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from occurring. This trigger event should not be used for any appointment that has already begun, or that has already been completed.  Likewise, it should not be used for any parent appointment if any child appointments have either begun or been completed.","chapters":["CH_10"]},{"id":"SIU_S18","type":"Message","label":"SIU_S18 - Notification of Addition of Service/Resource on Appointment","description":"The notification of addition of service/resource is triggered on the filler application when a new service or resource has been added to an existing appointment.  Services and resources are represented by the AIS, AIG, AIL, and AIP segments on an HL7 scheduling interface transaction.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.","chapters":["CH_10"]},{"id":"SIU_S19","type":"Message","label":"SIU_S19 - Notification of Modification of Service/Resource on Appointment","description":"The notification of modification of service/resource is triggered on the filler application when the information pertaining to an existing service or resource has been changed for an existing appointment.  Services and resources are represented by the AIS, AIG, AIL, and AIP segments on an HL7 scheduling interface transaction.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.","chapters":["CH_10"]},{"id":"SIU_S20","type":"Message","label":"SIU_S20 - Notification of Cancellation of Service/Resource on Appointment","description":"This trigger event notifies other applications that a service or resource has been removed from an existing scheduled appointment that has not yet begun.  A cancel event is used to stop a valid service or resource from participating in the appointment.  For example, if a portable X-ray machine scheduled for an exam is no longer needed, then the resource is canceled on the filler application.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.","chapters":["CH_10"]},{"id":"SIU_S21","type":"Message","label":"SIU_S21 - Notification of Discontinuation of Service/Resource on Appointment","description":"A notification of discontinuation of service/resource is sent by the filler application to other applications when the remaining children of a parent appointment no longer require a particular service or resource.  In other words, this trigger event is sent to discontinue the performance of a service or resource in a parent appointment that has already begun.  If the first appointment in a set of recurring appointments has not yet taken place, then a cancel trigger event should be sent instead.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.","chapters":["CH_10"]},{"id":"SIU_S22","type":"Message","label":"SIU_S22 - Notification of Deletion of Service/Resource on Appointment","description":"A notification of deletion of service/resource is sent by the filler application to other applications when a scheduled appointment requiring a service or resource entered in error has been removed from the system. A delete trigger event should only be used in those circumstances when a service or resource has been erroneously attached to an appointment, and must be removed from the schedule so that it does not affect any statistical processing.  A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from taking place.","chapters":["CH_10"]},{"id":"SIU_S23","type":"Message","label":"SIU_S23 - Notification of Blocked Schedule Time Slot(S)","description":"A notification of blocked schedule time slots is sent by the filler application to other applications when a schedule has had one or more time slots blocked and made unavailable for reasons other than the scheduling of an appointment.  For example, if an exam room is unavailable for several hours because of maintenance needs or contamination, a user may block off those several hours on the exam room’s schedule. Similarly, if a physician is unavailable because he or she has taken vacation time, his or her schedule may be blocked off for the duration of the vacation.  When these types of conditions exist, the filler application may use this transaction to notify other applications that the resources controlled by schedules are unavailable.","chapters":["CH_10"]},{"id":"SIU_S24","type":"Message","label":"SIU_S24 - Notification of Opened (un-blocked) Schedule Time Slot(s)","description":"A notification of blocked schedule time slots is sent by the filler application to other applications when a schedule has one or more time slots open up (“un-blocked”) and become available for use.  Typically, the blocked period of time on a schedule is simply allowed to expire, because the blocked amount of time is generally used for non-appointment activities. This transaction can be used either to discontinue the blocked status on the schedule, or to reverse a previous block made in error.  For the purposes of this transaction, discontinuing a block currently in progress (the blocked period has started, but not yet completed) and canceling a blocked period in the future are not significantly different.  Therefore, a separate discontinue block transaction is not necessary.  If this transaction is received prior to the inception of a blocked period, then the entire block period is simply canceled according to the data provided in the transaction.  If the transaction is received after the blocked period has begun, but prior to the end of the blocked period, then the blocked period is discontinued according to the data provided in the transactions.  Applications may decide how to handle transactions that attempt to open a blocked period that has both started and ended in the past; however, these transactions can generally be ignored.","chapters":["CH_10"]},{"id":"SIU_S26","type":"Message","label":"SIU_S26 - Notification That Patient Did Not Show Up for Scheduled Appointment","description":"A notification that a patient did not show up for an appointment.  For example, if a patient was scheduled for a clinic visit, and never arrived for that appointment, this trigger event can be used to set a status on the appointment record for statistical purposes, as well as to free resources assigned to the appointment (or any other application level actions that must be taken in the event a patient does not appear for an appointment).","chapters":["CH_10"]},{"id":"SPQ_Q08","type":"Message","label":"SPQ_Q08 - Stored procedure request","description":"The Stored Procedure Query provides a mechanism for the querying system to invoke a stored procedure on the responding system. The request includes a stored procedure name and a list of parameters passed to it.\r\n\r\nThe SPQ enables an application on one system to execute a stored procedure on another system, which is coded to extract specific data.\r\n\r\nSince the SPR segment includes a response format code, the response could be tabular, display or segment pattern.","chapters":["CH_05"]},{"id":"SQM_S25","type":"Message","label":"SQM_S25 - Schedule query message and response","description":"Original Mode record-oriented query transactions are initiated from the querying application using the Schedule Query (SQM) to request information about a filler application’s schedule(s).  The filler application responds to these requests, using the Schedule Query Response (SQR) message to either return the requested information, or to signal that an interfacing error of some kind has occurred. ","chapters":["CH_10"]},{"id":"SQR_S25","type":"Message","label":"SQR_S25 - Schedule query message and response","description":"Original Mode record-oriented query transactions are initiated from the querying application using the Schedule Query (SQM) to request information about a filler application’s schedule(s).  The filler application responds to these requests, using the Schedule Query Response (SQR) message to either return the requested information, or to signal that an interfacing error of some kind has occurred. ","chapters":["CH_10"]},{"id":"SRM_S01","type":"Message","label":"SRM_S01 - Schedule request - New appointment booking","description":"A placer application sends a transaction with this trigger event to a filler application to request that a new appointment be booked.  If it is successful, the filler application returns an application acknowledgment (if requested under the enhanced acknowledgment mode, or if the original acknowledgment mode is in use). The acknowledgment may optionally contain an SCH segment and related detail segments describing the actual appointment that was booked.","chapters":["CH_10"]},{"id":"SRM_S02","type":"Message","label":"SRM_S02 - Schedule request - Appointment rescheduling","description":"A placer application uses this trigger event to request that an existing appointment be rescheduled.  The new Requested Start Date and Time, Appointment Duration, Repeating Interval, Repeating Interval Duration, and/or Priority are provided in the ARQ segment, along with the existing placer and filler identification numbers.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the new information for the rescheduled appointment.","chapters":["CH_10"]},{"id":"SRM_S03","type":"Message","label":"SRM_S03 - Schedule request - Appointment modification","description":"This message transmits a request for modification of an existing appointment to a filler application.  This trigger event is used to request the modification of information on an existing appointment, outside of the need to reschedule, cancel, discontinue or delete the appointment, or to add, modify, cancel, discontinue, or delete services and/or resources on the appointment.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed. If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the new information for the modified appointment.","chapters":["CH_10"]},{"id":"SRM_S04","type":"Message","label":"SRM_S04 - Schedule request - Appointment cancellation","description":"The request appointment cancellation trigger event is sent by the placer application to the filler application to request that an existing appointment be canceled.  A cancel event is used to stop a valid appointment from occurring.  For example, if a patient scheduled for an exam cancels his/her appointment, then a request to cancel the appointment is sent.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the canceled appointment.","chapters":["CH_10"]},{"id":"SRM_S05","type":"Message","label":"SRM_S05 - Schedule request - Appointment discontinuation","description":"The request appointment discontinuation is sent by the placer application to the filler application to request that an appointment in progress be stopped, or that the remaining occurrences of a parent appointment not occur as scheduled.  If none of the child appointments of a parent appointment have occurred, then a cancel trigger event should be sent instead.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the discontinued appointment.","chapters":["CH_10"]},{"id":"SRM_S06","type":"Message","label":"SRM_S06 - Schedule request - Appointment deletion","description":"A request appointment deletion is sent by the placer application to the filler application to request that an appointment that had been entered in error be removed from the system.  A delete trigger event should only be used when an appointment has been erroneously requested, and must be removed from the schedule so that it does not affect any statistical processing.  A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from occurring.  This trigger event should not be used for any appointment that has already begun, or has already been completed.  Likewise, it should not be used on any parent appointment if any child appointments have either begun or been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the deleted appointment.","chapters":["CH_10"]},{"id":"SRM_S07","type":"Message","label":"SRM_S07 - Schedule request - Addition of service/resource on appointment","description":"The request addition of service/resource is triggered by the placer application to request that a new service or resource be added to an existing appointment.  Services and resources are represented by the AIS, AIG, AIL, and AIP segments on an HL7 scheduling interface transaction.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment.","chapters":["CH_10"]},{"id":"SRM_S08","type":"Message","label":"SRM_S08 - Schedule request - Modification of service/resource on appointment","description":"The request modification of service/resource is triggered on the placer application to request that information pertaining to an existing service or resource be changed for an existing appointment.  Services and resources are represented by the AIS, AIG, AIL, and AIP segments on an HL7 scheduling interface transaction.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment.","chapters":["CH_10"]},{"id":"SRM_S09","type":"Message","label":"SRM_S09 - Schedule request - Cancellation of service/resource on appointment","description":"This trigger event requests that a service or resource be removed from an existing scheduled appointment that has not yet begun.  A cancel event is used to stop a valid service or resource from participating in the appointment.  For example, if a portable X-ray machine scheduled for an exam is no longer needed, then the placer application requests that the resource be canceled on the filler application.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment","chapters":["CH_10"]},{"id":"SRM_S10","type":"Message","label":"SRM_S10 - Schedule request - Discontinuation of service/resource on appointment","description":"A request discontinuation of service/resource is sent by the placer application to the filler application when the remaining occurrences of a recurring appointment no longer require a particular service or resource.  In other words, this trigger event is sent to request that the performance of a service or resource in a recurring appointment that has already begun be stopped.  If the first appointment in a set of recurring appointments has not yet occurred, then a cancel trigger event should be sent instead.  This trigger event should only be used on appointments that have not been completed, or on parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment.","chapters":["CH_10"]},{"id":"SRM_S11","type":"Message","label":"SRM_S11 - Schedule request - Deletion of service/resource on appointment","description":"A request deletion of service/resource is sent by the placer application to the filler application to request that a scheduled appointment requiring a service or resource entered in error be removed from the system. A delete trigger event should only be used when a service or resource has been erroneously attached to an appointment, and must be removed from the schedule so that it does not affect any statistical processing.  A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from occurring.  This trigger event should only be used on appointments that have not been completed, or on parent appointments whose children have not been completed. If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment.","chapters":["CH_10"]},{"id":"SRR_S01","type":"Message","label":"SRR_S01 - Scheduled request response - New appointment booking","description":"A placer application sends a transaction with this trigger event to a filler application to request that a new appointment be booked.  If it is successful, the filler application returns an application acknowledgment (if requested under the enhanced acknowledgment mode, or if the original acknowledgment mode is in use). The acknowledgment may optionally contain an SCH segment and related detail segments describing the actual appointment that was booked.","chapters":["CH_10"]},{"id":"SRR_S02","type":"Message","label":"SRR_S02 - Scheduled request response - Appointment rescheduling","description":"A placer application sends a transaction with this trigger event to a filler application to request that a new appointment be booked.  If it is successful, the filler application returns an application acknowledgment (if requested under the enhanced acknowledgment mode, or if the original acknowledgment mode is in use). The acknowledgment may optionally contain an SCH segment and related detail segments describing the actual appointment that was booked.","chapters":["CH_10"]},{"id":"SRR_S03","type":"Message","label":"SRR_S03 - Scheduled request response - Appointment modification","description":"This message transmits a request for modification of an existing appointment to a filler application.  This trigger event is used to request the modification of information on an existing appointment, outside of the need to reschedule, cancel, discontinue or delete the appointment, or to add, modify, cancel, discontinue, or delete services and/or resources on the appointment.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed. If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the new information for the modified appointment.","chapters":["CH_10"]},{"id":"SRR_S04","type":"Message","label":"SRR_S04 - Scheduled request response - Appointment cancellation","description":"The request appointment cancellation trigger event is sent by the placer application to the filler application to request that an existing appointment be canceled.  A cancel event is used to stop a valid appointment from occurring.  For example, if a patient scheduled for an exam cancels his/her appointment, then a request to cancel the appointment is sent.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the canceled appointment.","chapters":["CH_10"]},{"id":"SRR_S05","type":"Message","label":"SRR_S05 - Scheduled request response - Appointment discontinuation","description":"The request appointment discontinuation is sent by the placer application to the filler application to request that an appointment in progress be stopped, or that the remaining occurrences of a parent appointment not occur as scheduled.  If none of the child appointments of a parent appointment have occurred, then a cancel trigger event should be sent instead.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the discontinued appointment.","chapters":["CH_10"]},{"id":"SRR_S06","type":"Message","label":"SRR_S06 - Scheduled request response - Appointment deletion","description":"A request appointment deletion is sent by the placer application to the filler application to request that an appointment that had been entered in error be removed from the system.  A delete trigger event should only be used when an appointment has been erroneously requested, and must be removed from the schedule so that it does not affect any statistical processing.  A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from occurring.  This trigger event should not be used for any appointment that has already begun, or has already been completed.  Likewise, it should not be used on any parent appointment if any child appointments have either begun or been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the deleted appointment.","chapters":["CH_10"]},{"id":"SRR_S07","type":"Message","label":"SRR_S07 - Scheduled request response - Addition of service/resource on appointment","description":"The request addition of service/resource is triggered by the placer application to request that a new service or resource be added to an existing appointment.  Services and resources are represented by the AIS, AIG, AIL, and AIP segments on an HL7 scheduling interface transaction.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment.","chapters":["CH_10"]},{"id":"SRR_S08","type":"Message","label":"SRR_S08 - Scheduled request response - Modification of service/resource on appointment","description":"The request modification of service/resource is triggered on the placer application to request that information pertaining to an existing service or resource be changed for an existing appointment.  Services and resources are represented by the AIS, AIG, AIL, and AIP segments on an HL7 scheduling interface transaction.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment.","chapters":["CH_10"]},{"id":"SRR_S09","type":"Message","label":"SRR_S09 - Scheduled request response - Cancellation of service/resource on appointment","description":"This trigger event requests that a service or resource be removed from an existing scheduled appointment that has not yet begun.  A cancel event is used to stop a valid service or resource from participating in the appointment.  For example, if a portable X-ray machine scheduled for an exam is no longer needed, then the placer application requests that the resource be canceled on the filler application.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment","chapters":["CH_10"]},{"id":"SRR_S10","type":"Message","label":"SRR_S10 - Scheduled request response - Discontinuation of service/resource on appointment","description":"A request discontinuation of service/resource is sent by the placer application to the filler application when the remaining occurrences of a recurring appointment no longer require a particular service or resource.  In other words, this trigger event is sent to request that the performance of a service or resource in a recurring appointment that has already begun be stopped.  If the first appointment in a set of recurring appointments has not yet occurred, then a cancel trigger event should be sent instead.  This trigger event should only be used on appointments that have not been completed, or on parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment.","chapters":["CH_10"]},{"id":"SRR_S11","type":"Message","label":"SRR_S11 - Scheduled request response - Deletion of service/resource on appointment","description":"A request deletion of service/resource is sent by the placer application to the filler application to request that a scheduled appointment requiring a service or resource entered in error be removed from the system. A delete trigger event should only be used when a service or resource has been erroneously attached to an appointment, and must be removed from the schedule so that it does not affect any statistical processing.  A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from occurring.  This trigger event should only be used on appointments that have not been completed, or on parent appointments whose children have not been completed. If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment.","chapters":["CH_10"]},{"id":"SSR_U04","type":"Message","label":"SSR_U04 - Specimen status request","description":"This message is used to request information concerning the location and status of specimens from one application to another (e.g., Laboratory Automation System to automated equipment). The request can be addressed for a specific container, a specific carrier, a specific tray or a specific location, depending on the arguments set in the SAC segment. The equipment specified in the EQU segment should respond with the “Specimen Status Update.”","chapters":["CH_13"]},{"id":"SSU_U03","type":"Message","label":"SSU_U03 - Specimen status update","description":"This message is used to send information concerning the location and status of specimens from one application to another (e.g., automated equipment to a Laboratory Automation System).","chapters":["CH_13"]},{"id":"SUR_P09","type":"Message","label":"SUR_P09 - Summary product experience report","description":"Sending summary reports related to products constitutes a P09 event","chapters":["CH_07"]},{"id":"TBR_R08","type":"Message","label":"TBR_R08 - Tabular data response","description":null,"chapters":["CH_05"]},{"id":"TCR_U11","type":"Message","label":"TCR_U11 - Automated equipment test code settings request","description":"This message is used to request information concerning test codes from one application to another (e.g., Laboratory Automation System to automated equipment).","chapters":["CH_13"]},{"id":"TCU_U10","type":"Message","label":"TCU_U10 - Automated equipment test code settings update","description":"This message is used to send information concerning test codes and parameters from one application to another (e.g., automated equipment to a Laboratory Automation System). This message transfers the current snapshot of the test parameters of the sending system. The sent parameter sets are supposed to replace the parameter sets existing at the receiver of this message before the trigger (there is no selective “Add” or “Delete”).","chapters":["CH_13"]},{"id":"UDM_Q05","type":"Message","label":"UDM_Q05 - Unsolicited display update message","description":"There is a simple HL7 message that allows for unsolicited display update messages to be sent in HL7 format from one system to another.","chapters":["CH_05"]},{"id":"VQQ_Q07","type":"Message","label":"VQQ_Q07 - Virtual table query","description":"The VTQ provides a way to query for data to be expressed as tables without having to specify SQL or a stored procedure. The reader is advised to consider using the new recommended queries described in section 5.3.3.4.\r\n\r\nThe VQQ supports queries against server database table (virtual or actual) based on specific selection criteria delineated in the VTQ segment.","chapters":["CH_05"]},{"id":"VXQ_V01","type":"Message","label":"VXQ_V01 - Query for vaccination record","description":" When an immunization registry does not already have the complete patient vaccination record, it will send a query (with a V01 event) for the definitive (last updated) record.  Within the definitions for QRD and QRF, certain components are defined according to position in the field, as detailed in Section 4.17.2, “Queries for immunization records (QRF Segments).”  The three-letter code in the leftmost column indicates the segment that is included; the column on the right specifies the chapter in which that segment is fully defined.","chapters":["CH_04"]},{"id":"VXR_V03","type":"Message","label":"VXR_V03 - Vaccination record response","description":" When the patient has been uniquely identified (there is only one “match” to the query), the response to the query (with a V03 event) will follow this format.  Within the definitions for QRD and QRF, certain components are defined according to position in the field, as detailed in Section 4.17.2, “Queries for immunization records (QRF Segments).”  The three-letter code in the leftmost column indicates the segment that is included; the column on the right specifies the chapter in which that segment is fully defined.","chapters":["CH_04"]},{"id":"VXU_V04","type":"Message","label":"VXU_V04 - Unsolicited vaccination record update","description":"When a provider wishes to update the patient’s vaccination record being held in a registry, he will transmit an unsolicited update of the record (a V04 trigger event).","chapters":["CH_04"]},{"id":"VXX_V02","type":"Message","label":"VXX_V02 - Response to vaccination query returning multiple PID matches ","description":"In response to a query for the definitive patient vaccination record, the registry holding the record will return it to the registry originating the query.\r\n\r\nIf the query results in multiple “matches,” i.e., more than one patient record matches the identifiers in the query so that there is no unique identification, the response to the query (with a V02 event) will follow this format.  Within the definitions for QRD and QRF, certain components are defined according to position in the field, as detailed in Section 4.17.2, “Queries for immunization records (QRF Segments).”  The threeletter code in the leftmost column indicates the segment that is included; the column on the right specifies the chapter in which that segment is fully defined.","chapters":["CH_04"]}]