{"id":"ADT_A02","msgStructId":"ADT_A02","eventDesc":"Transfer a patient","description":"An A02 event is issued as a result of the patient changing his or her assigned physical location.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition. If the transfer function of your Patient Administration system allows demographics to change at the same time as the transfer (for example an address change), we recommend (but do not require) sending two messages (an A02 followed by an A08). This A02 event can be used with admitted and non-admitted patients.\r\n\r\nThe new patient location should appear in PV1-3 - Assigned Patient Location while the old patient location should appear in PV1-6 - Prior Patient Location. For example, an A02 event can be used to notify: laboratory, radiology, pathology that the patient has changed location and test results should be redirected; pharmacy that drugs should be redirected for the patient; dietary that the meals should be delivered to a different location; the clinical repository that a transfer has taken place for the Electronic Medical Record.\r\n\r\nIf the patient is going to a temporary location (such as the O/R, X-RAY, LIMBO, the HALLWAY) it is recommended that the A09 (patient departing-tracking) and A10 (patient arriving-tracking) events be used instead of A02. It is recommended that A02 be used only for a real change in the census bed in the Patient Administration system.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin- and end-date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL segment, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","sample":null,"chapters":["CH_03"],"segments":[{"id":"MSH","name":"MSH","longName":"Message Header","sequence":"1","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"SFT","name":"SFT","longName":"Software Segment","sequence":"2","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"UAC","name":"UAC","longName":"User Authentication Credential Segment","sequence":"3","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"EVN","name":"EVN","longName":"Event Type","sequence":"4","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PID","name":"PID","longName":"Patient Identification","sequence":"5","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PD1","name":"PD1","longName":"Patient Additional Demographic","sequence":"6","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"ARV","name":"ARV","longName":"Access Restriction","sequence":"7","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"ROL","name":"ROL","longName":"Role","sequence":"8","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"PV1","name":"PV1","longName":"Patient Visit","sequence":"9","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PV2","name":"PV2","longName":"Patient Visit - Additional Information","sequence":"10","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"ARV","name":"ARV","longName":"Access Restriction","sequence":"11","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"ROL","name":"ROL","longName":"Role","sequence":"12","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"DB1","name":"DB1","longName":"Disability","sequence":"13","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"OBX","name":"OBX","longName":"Observation/result","sequence":"14","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"PDA","name":"PDA","longName":"Patient Death And Autopsy","sequence":"15","usage":"O","rpt":"1","isGroup":false,"segments":null}]}