{"id":"EHC_E13","msgStructId":"EHC_E13","eventDesc":"Additional Information Response","description":"This message is used by a Provider to immediately respond to an EHC^E12 Request for Additional Information, in other words an automated response.  The EHC^E13 message cannot be sent unsolicited.\r\n\r\nThe EHC^E13 message supports three types of response modalities:\r\n - Free-form ASCII text.  This is generally brief, descriptive text that is formulated to be read by a human recipient.\r\n - Attachments.  The primary content is a multimedia attachment containing the information that has been requested.  Depending upon agreements between the Provider and Payer this attachment may contain human-readable information, codified data that can be manipulated by an application, or some combination of the two.  \r\n - Pre-defined responses.  The Payer has posed both a question and a range of possible answers that the responder chooses from when formulating the reply.  The question and answers are codified so that they can be manipulated by an application.\r\n\r\nThe structure of the EHC^E13 message closely follows that of the EHC^E12 request, which in turn is patterned on the Invoice or (Pre) Authorization which preceded the request for additional information.  The hierarchical structural of the message indicates the context of the request for additional information and the data being supplied in the response.  More specifically, the EHC^E12 request is formulated against a particular Product/Service Group (from the earlier Invoice or (Pre) Authorization Request) and may be further circumscribed by reference to a particular patient and/or Product/Service Line Item from within that Product/Service Group.  The parameters set by the EHC^E12 request are re-iterated in the EHC^E13 response message so that the receiving system can interpret the return data in the appropriate context without necessarily having to refer to the original Invoice or (Pre) Authorization request.\r\n\r\nParties to the Request for Additional Information and the Response:  \r\n - The individual or organization that initiates the request for additional information is described as the \"Placer\".  (Normally, this would be the individual in the Payer organization that has placed the Invoice or (Pre) Authorization Request in suspense pending the return of the additional information that is being requested.)\r\n - The individual or organization that is responsible for the information being sent in reply is described as the \"Filler\".  (Normally, the Primary Care Provider would be responsible for supplying the requested information however, in some cases the Payer and/or Provider may stipulate some other party as the Filler.)\r\n -  The individual or organization that the response is to be directed to is described as the \"Payer Contact\".\r\n\r\nThe EHC^E13 message uses the LOINC classification standard to describe the information being sent.  Local codes are also supported.  The message allows the use of free-form text to supplement the coding schemes if greater specificity is required.\r\n\r\nThe EHC^E13 message supports the use of attachments.  All attachments must follow the HL7 Claim Attachments implementation guide for additional information to support a healthcare claim or encounter standard that is described in Health Level Seven (HL7) Version 2.4 Standard; Implementation Guide: \"Additional information message implementation guide, HL7 version 2.4 Standard, Release 1.0, NPRM Draft, December 11, 2001\". \r\n\r\nThe EHC^E13 message supports the inclusion of multiple attachments, i.e., multiple instances of the ESDA, through repetition of the OBX segment.  However, this use is NOT recommended.  The ESDA specification permits multiple objects (documents, images etc.) to be imbedded in the attachment, so, when responding to a single OBR, a single OBX (with attached multi-part ESDA) should be the preferred method of returning the additional information.","sample":null,"chapters":["CH_16"],"segments":[{"id":"MSH","name":"MSH","longName":"Message Header","sequence":"1","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"SFT","name":"SFT","longName":"Software Segment","sequence":"2","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"UAC","name":"UAC","longName":"User Authentication Credential Segment","sequence":"3","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"MSA","name":"MSA","longName":"Message Acknowledgment","sequence":"4","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"ERR","name":"ERR","longName":"Error","sequence":"5","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"RFI","name":"RFI","longName":"Request For Information","sequence":"6","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"CTD","name":"CTD","longName":"Contact Data","sequence":"7","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"IVC","name":"IVC","longName":"Invoice Segment","sequence":"8","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PSS","name":"PSS","longName":"Product/service Section","sequence":"9","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PSG","name":"PSG","longName":"Product/service Group","sequence":"10","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PID","name":"PID","longName":"Patient Identification","sequence":"11","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"PSL","name":"PSL","longName":"Product/service Line Item","sequence":"12","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":null,"name":"REQUEST","longName":null,"sequence":null,"usage":"R","rpt":"*","isGroup":true,"segments":[{"id":"CTD","name":"CTD","longName":"Contact Data","sequence":"13","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"OBR","name":"OBR","longName":"Observation Request","sequence":"14","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"NTE","name":"NTE","longName":"Notes And Comments","sequence":"15","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":null,"name":"RESPONSE","longName":null,"sequence":null,"usage":"R","rpt":"*","isGroup":true,"segments":[{"id":"OBX","name":"OBX","longName":"Observation/result","sequence":"16","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"NTE","name":"NTE","longName":"Notes And Comments","sequence":"17","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"TXA","name":"TXA","longName":"Transcription Document Header","sequence":"18","usage":"O","rpt":"1","isGroup":false,"segments":null}]}]}]}