[{"id":"ACK","type":"Message","label":"ACK - General acknowledgement","description":"The simple general acknowledgement (ACK) can be used where the application does not define a special application level acknowledgement message or where there has been an error that precludes application processing.  It is also used for accept level acknowlegements.","chapters":["CH_02"]},{"id":"ADR_A19","type":"Message","label":"ADR_A19 - Patient query","description":"The following trigger event is served by QRY (a query from another system) and ADR (a response from an Patient Administration system.)\r\n\r\nAnother application determines a need for Patient Administration data about a patient and sends a query to the Patient Administration system.  The Who Filter in the QRD can identify the patient or account number upon which the query is defined and can contain a format code of “R” (record-oriented).  If the query is based on the Patient ID and there are data associated with multiple accounts, the problem of which account data should be returned becomes an implementation issue.  The ADT event-type segment, if included in the response, describes the last event for which the Patient Administration system initiated an unsolicited update","chapters":["CH_03"]},{"id":"ADT_A01","type":"Message","label":"ADT_A01 - Admit a Patient","description":"Normally entered in the primary ADT system and broadcast to the nursing units and ancillary systems.  Includes short-stay and John Doe admissions","chapters":["CH_03"]},{"id":"ADT_A02","type":"Message","label":"ADT_A02 - Transfer a patient","description":"A patient moves from one location to another","chapters":["CH_03"]},{"id":"ADT_A03","type":"Message","label":"ADT_A03 - Discharge a patient","description":"Refers to changing a patient's status from, for example, inpatient to discharged","chapters":["CH_03"]},{"id":"ADT_A04","type":"Message","label":"ADT_A04 - Register a Patient","description":"Includes emergency room patients and outpatients","chapters":["CH_03"]},{"id":"ADT_A05","type":"Message","label":"ADT_A05 - Pre-admit a Patient","description":"A patient may be pre-admitted for a variety of reasons; e.g., prior to surgery so that they will be able to receive tests administered in the lab.  The data may be entered into the surgery scheduling system and passed to the ADT system","chapters":["CH_03"]},{"id":"ADT_A06","type":"Message","label":"ADT_A06 - Transfer an Outpatient to Inpatient","description":null,"chapters":["CH_03"]},{"id":"ADT_A07","type":"Message","label":"ADT_A07 - Transfer an Inpatient to Outpatient","description":null,"chapters":["CH_03"]},{"id":"ADT_A08","type":"Message","label":"ADT_A08 - Update Patient Information","description":"This trigger event is used when any patient information has changed, but no other trigger event has occurred","chapters":["CH_03"]},{"id":"ADT_A09","type":"Message","label":"ADT_A09 - Patient Departing","description":"A patient is being moved from his assigned location to a new location.  For example, this can be used when the nursing system is not the same as the ADT system or to indicate a patient leaving an outpatient bed.  The DG1 segment remains in this message for backwards compatibility only.","chapters":["CH_03"]},{"id":"ADT_A10","type":"Message","label":"ADT_A10 - Patient Arriving","description":"The patient arrives at his new assigned location","chapters":["CH_03"]},{"id":"ADT_A11","type":"Message","label":"ADT_A11 - Cancel Admit","description":null,"chapters":["CH_03"]},{"id":"ADT_A12","type":"Message","label":"ADT_A12 - Cancel Transfer","description":"New location must show the location of the patient prior to the transfer","chapters":["CH_03"]},{"id":"ADT_A13","type":"Message","label":"ADT_A13 - Cancel Discharge","description":"New location must show the location of the patient prior to the discharge","chapters":["CH_03"]},{"id":"ADT_A14","type":"Message","label":"ADT_A14 - Pending Admit","description":"Reservation or when patient admission is to occur imminently.  Similar to a pre-admit","chapters":["CH_03"]},{"id":"ADT_A15","type":"Message","label":"ADT_A15 - Pending Transfer","description":null,"chapters":["CH_03"]},{"id":"ADT_A16","type":"Message","label":"ADT_A16 - Pending Discharge","description":null,"chapters":["CH_03"]},{"id":"ADT_A17","type":"Message","label":"ADT_A17 - Swap Patients","description":"Used when it is decided that two patients will exchange beds.  The patient ID and visit data are repeated for the two patients being swapped.  See Section 3.5.1 for a discussion of issues related to implementing this trigger event. ","chapters":["CH_03"]},{"id":"ADT_A18","type":"Message","label":"ADT_A18 - Merge Patient Information","description":"Used to merge current and previous patient identification numbers:  patient ID - internal, patient ID - external, alternate patient ID and patient account number.  This is required, for example, when a patient has previously been registered under a new patient identification number because of an error or because there was insufficient time to determine the actual patient identification number.  The merge event occurs when the decision is made to combine the information under either the new or old identifier(s).  It is recommended that events A34, A35 and A36 be utilized in place of the A18 event whenever possible.  [Event A18 is being kept for backwards compatibility.]\r\n\r\nThe PID segment contains the surviving patient ID information.  The MRG segment contains the non-surviving information. ","chapters":["CH_03"]},{"id":"ADT_A20","type":"Message","label":"ADT_A20 - Bed Status Update","description":"Certain nursing/census applications need to be able to update the ADT system's bed status.  The following is the associated record layout","chapters":["CH_03"]},{"id":"ADT_A21","type":"Message","label":"ADT_A21 - A Patient Goes On A \"Leave Of Absence\"","description":null,"chapters":["CH_03"]},{"id":"ADT_A22","type":"Message","label":"ADT_A22 - A Patient Returns From A \"Leave Of Absence\"","description":null,"chapters":["CH_03"]},{"id":"ADT_A23","type":"Message","label":"ADT_A23 - Delete a Patient Record","description":"Delete visit specific information","chapters":["CH_03"]},{"id":"ADT_A24","type":"Message","label":"ADT_A24 - Link Patient Information","description":"Where the first PID segment needs to be linked to the second PID segment.  See Section 3.5.3 for a discussion of issues related to implementing patient link messages","chapters":["CH_03"]},{"id":"ADT_A25","type":"Message","label":"ADT_A25 - Cancel Pending Discharge","description":null,"chapters":["CH_03"]},{"id":"ADT_A26","type":"Message","label":"ADT_A26 - Cancel Pending Transfer","description":null,"chapters":["CH_03"]},{"id":"ADT_A27","type":"Message","label":"ADT_A27 - Cancel Pending Admit","description":null,"chapters":["CH_03"]},{"id":"ADT_A28","type":"Message","label":"ADT_A28 - Add person information","description":"The purpose of this message and the three following messages is to allow sites with multiple systems and respective master data bases to communicate activity related to a person between systems.  Each system has an interest in the data base activity of the others in order to maintain data integrity across an institution.  While defined within the ADT message set, these messages differ in that they are not patient specific. ","chapters":["CH_03"]},{"id":"ADT_A29","type":"Message","label":"ADT_A29 - Delete person information","description":"Delete all demographic information related to this person","chapters":["CH_03"]},{"id":"ADT_A30","type":"Message","label":"ADT_A30 - Merge Patient information","description":null,"chapters":["CH_03"]},{"id":"ADT_A31","type":"Message","label":"ADT_A31 - Update person information","description":null,"chapters":["CH_03"]},{"id":"ADT_A32","type":"Message","label":"ADT_A32 - Cancel patient arriving","description":null,"chapters":["CH_03"]},{"id":"ADT_A33","type":"Message","label":"ADT_A33 - Cancel patient departing","description":null,"chapters":["CH_03"]},{"id":"ADT_A34","type":"Message","label":"ADT_A34 - patient ID only","description":"Only Patient Identification - Internal has changed as a result of the merge.  See Section 3.5.2 for a discussion of issues related to implementing merge messages","chapters":["CH_03"]},{"id":"ADT_A35","type":"Message","label":"ADT_A35 - account number only","description":"Only Patient Account Number has changed as a result of the merge.  See Section 3.5.2 for a discussion of issues related to implementing merge messages","chapters":["CH_03"]},{"id":"ADT_A36","type":"Message","label":"ADT_A36 - pat ID and account number","description":"Both Patient Identification - Internal and Patient Account Number have changed as a result of the merge.  See Section 3.5.2 for a discussion of issues related to implementing merge messages","chapters":["CH_03"]},{"id":"ADT_A37","type":"Message","label":"ADT_A37 - unlink patient information","description":"Unlinks two PID segments previously linked via an A24.","chapters":["CH_03"]},{"id":"BAR_P01","type":"Message","label":"BAR_P01 - Add and Update Patient Accounts","description":"Data is sent from some application (usually a Registration or an ADT system) to the patient accounting system to establish an account for a patient's billing/accounts receivable record.  Many of the segments associated with this event are optional.  This optionality allows those systems needing these fields to set up transactions which fulfill their requirements yet satisfy the HL7 requirements.  Sample event codes are in table 0003 - event type code. ","chapters":["CH_06"]},{"id":"BAR_P02","type":"Message","label":"BAR_P02 - Purge Patient Accounts","description":"Generally, the elimination of all billing/accounts receivable records will be an internal function controlled by the financial system.  However, on occasion, there is a need to correct an account, or series of accounts, which may require a notice of account deletion to be sent from another sub-system and processed by the financial system.  Although a series of accounts may be purged within this one event, it is recommended that only one PID segment per event be sent","chapters":["CH_06"]},{"id":"DFT_P03","type":"Message","label":"DFT_P03 - Post Detail Financial Transactions","description":"The Detail Financial Transaction is used to describe a financial transaction transmitted between systems, ie., to HIS for ancillary charges, ADT to HIS for patient deposits, etc. ","chapters":["CH_06"]},{"id":"DSR_Q01","type":"Message","label":"DSR_Q01 - Display Response Message","description":"When display data is involved, these trigger events are served by the Query (QRY) and Display Response (DSR) and General Acknowledgement (ACK) messages.  When the query is for record-oriented data, the QRY message is used, but the response message is specific to a functional area.  Record-oriented queries are described in other chapters.  Display-oriented queries are described here.","chapters":["CH_02"]},{"id":"DSR_Q03","type":"Message","label":"DSR_Q03 - Deferred Response to A Query","description":"For clarity, A is the system initiating the query and B is the system sending the responses.  Multiple queries and responses are permitted within single messages.  The responses to a given query may be broken into several separate DSR messages.  A single DSR message may contain responses to more than one QRY","chapters":["CH_02"]},{"id":"DSR_R03","type":"Message","label":"DSR_R03 - oriented results, query/unsol. update","description":null,"chapters":["CH_02"]},{"id":"MCF","type":"Message","label":"MCF - Delayed acknowledgement ","description":"This message remains in the specification only for reasons of backwards compatibility.  It is used as part of the protocol which creates a generic form of an asynchronous application level acknowledgement, the MCF message.","chapters":["CH_02"]},{"id":"MFD_M01","type":"Message","label":"MFD_M01 - Master files change not otherwise specified (for backwards comp.)","description":null,"chapters":["CH_08"]},{"id":"MFD_M02","type":"Message","label":"MFD_M02 - Staff Practitioneer","description":null,"chapters":["CH_08"]},{"id":"MFD_M03","type":"Message","label":"MFD_M03 - Test/Observation","description":null,"chapters":["CH_08"]},{"id":"MFN_M01","type":"Message","label":"MFN_M01 - Master files change not otherwise specified (for backwards comp.)","description":null,"chapters":["CH_08"]},{"id":"MFN_M02","type":"Message","label":"MFN_M02 - Staff Practitioneer","description":null,"chapters":["CH_08"]},{"id":"MFN_M03","type":"Message","label":"MFN_M03 - Test/Observation","description":null,"chapters":["CH_08"]},{"id":"MFQ_M01","type":"Message","label":"MFQ_M01 - Master files change not otherwise specified (for backwards comp.)","description":null,"chapters":["CH_08"]},{"id":"MFQ_M02","type":"Message","label":"MFQ_M02 - Staff Practitioneer","description":null,"chapters":["CH_08"]},{"id":"MFQ_M03","type":"Message","label":"MFQ_M03 - Test/Observation","description":null,"chapters":["CH_08"]},{"id":"NMD_N01","type":"Message","label":"NMD_N01 - Network Management Data","description":"One system creates an unsolicited update (UU) Network Management Data message (NMD) to transmit network management information to another system. In this case, the initiating system sends an NMD message as an unsolicited update (UU) containing network management information to a receiving system, which responds with a generic acknowledgement message (ACK).","chapters":["CH_02"]},{"id":"NMQ_N02","type":"Message","label":"NMQ_N02 - Network Management Query","description":"The NMQ (Network Management Query) message is used by one system to make system-level requests for information or action to another system. It has three segments, the NCK segment (network clock), the NST segment (network statistics), and the NSC segment (network status change). An example of the last type, NSC (network status change) would be an application or system startup/shut down request. At least one of these three segments must be present in the NMQ message. If a segment is present in the NMQ message, the corresponding segment needs to be present in the NMR message to return the requested data or status.","chapters":["CH_02"]},{"id":"NMR_N02","type":"Message","label":"NMR_N02 - Network Management Response","description":"The NMQ/NMR (Network Management Query) message is used by one system to make system-level requests for information or action to another system. It has three segments, the NCK segment (network clock), the NST segment (network statistics), and the NSC segment (network status change). An example of the last type, NSC (network status change) would be an application or system startup/shut down request. At least one of these three segments must be present in the NMQ message. If a segment is present in the NMQ message, the corresponding segment needs to be present in the NMR message to return the requested data or status.","chapters":["CH_02"]},{"id":"ORF_R04","type":"Message","label":"ORF_R04 - Response to query; transmission of requested observation","description":null,"chapters":["CH_07"]},{"id":"ORM_O01","type":"Message","label":"ORM_O01 - Order Message","description":"The function of this message is to initiate the transmission of information about an order.  This includes placing new orders, cancellation of existing orders, discontinuation, holding, etc.  ORM messages can originate also with a placer, filler, or an interested third party. ","chapters":["CH_04"]},{"id":"ORR_O02","type":"Message","label":"ORR_O02 - Response Message","description":"The function of this message is to respond to an ORM message.  An ORR message is the application acknowledgement to an ORM message.  See Chapter 2 for a description of the acknowledgement paradigm.","chapters":["CH_04"]},{"id":"ORU_R01","type":"Message","label":"ORU_R01 - Unsolicited Transmission Of Requested Information","description":"With the type (OBX) defined in this chapter, and the OBR defined in Chapter 4, one can construct almost any clinical report as a three-level hierarchy, with the PID segment defined in Chapter 3 at the upper level, an order record (OBR) at the next level and one or more observation records (OBX) at the \"bottom.\" ","chapters":["CH_07"]},{"id":"QRY_A19","type":"Message","label":"QRY_A19 - Patient Query","description":"The following triggering event is served by QRY (a query from another system) and ADR (a response from an ADT system.) \r\n \r\nAnother application determines a need for ADT data about a patient and sends a query to the ADT system.  The Who Filter in the QRD can identify the patient or account number upon which the query is defined and can contain a Format Code of R (record oriented).  If the query is based on Patient ID and there are data associated with multiple accounts, it is an implementation issue as to which account data should be returned.  The ADT Event Type Segment, if included in the response, describes the last event for which the ADT system initiated an unsolicited update","chapters":["CH_02"]},{"id":"QRY_P04","type":"Message","label":"QRY_P04 - Generate bills and A/R statements","description":"For patient accounting systems that support demand billing, the QRY/DSP transaction defined in Chapter 2 will provide the mechanism to request a copy of the bill for printing or viewing by the requesting system. ","chapters":["CH_02"]},{"id":"QRY_Q01","type":"Message","label":"QRY_Q01 - A Query is made for immediate Display Response","description":"When display data is involved, these trigger events are served by the Query (QRY) and Display Response (DSR) and General Acknowledgement (ACK) messages.  When the query is for record-oriented data, the QRY message is used, but the response message is specific to a functional area.  Record-oriented queries are described in other chapters.  Display-oriented queries are described here. ","chapters":["CH_02"]},{"id":"QRY_Q02","type":"Message","label":"QRY_Q02 - A Query is Sent for Deferred Response","description":"For clarity, A is the system initiating the query and B is the system sending the responses.  Multiple queries and responses are permitted within single messages.  The responses to a given query may be broken into several separate DSR messages.  A single DSR message may contain responses to more than one QRY","chapters":["CH_02"]},{"id":"QRY_Q26","type":"Message","label":"QRY_Q26 - Pharmacy Prescription Order Query","description":"Query (QRY_Q26) / Response (ROR_ROR)","chapters":["CH_02","CH_04"]},{"id":"QRY_Q27","type":"Message","label":"QRY_Q27 - Pharmacy Administration Information Query","description":"Query (QRY_Q27) / Response (RAR_RAR)","chapters":["CH_02","CH_04"]},{"id":"QRY_Q28","type":"Message","label":"QRY_Q28 - Pharmacy Dispense Information Query","description":"Query (QRY_Q28) / Response (RDR_RDR)","chapters":["CH_02","CH_04"]},{"id":"QRY_Q29","type":"Message","label":"QRY_Q29 - Pharmacy Encoded Order Information Query","description":"Query (QRY_Q29) / Response (RER_RER)","chapters":["CH_02","CH_04"]},{"id":"QRY_Q30","type":"Message","label":"QRY_Q30 - Pharmacy Dose Information Query","description":"Query (QRY_Q30) / Response (RGR_RGR)","chapters":["CH_02","CH_04"]},{"id":"QRY_R02","type":"Message","label":"QRY_R02 - Query for results of observation","description":null,"chapters":["CH_02"]},{"id":"RAR_RAR","type":"Message","label":"RAR_RAR - Pharmacy Administration Information Response","description":"Query (QRY_Q27) / Response (RAR_RAR)","chapters":["CH_04"]},{"id":"RAS_O02","type":"Message","label":"RAS_O02 - Pharmacy/treatment administration message","description":"The RAS message may be created by the administering application (e.g., nursing application) for each instance of administration for an existing order.  If the administering application wants to report several administrations of medication for a given order with a single RAS message, each instance is reported by a separate (repeating) RXA segment.  In addition, the administration records for a group of orders may be sent in a single message by creating repeating groups of segments at the ORC level.","chapters":["CH_04"]},{"id":"RDE_O01","type":"Message","label":"RDE_O01 - Pharmacy/treatment encoded order message","description":"This message communicates the Pharmacy application's encoding of the pharmacy order (ORM message with RXO segment, see above).  It may be sent as an unsolicited message to report on either a single order or multiple pharmacy orders for a patient.","chapters":["CH_04"]},{"id":"RDR_RDR","type":"Message","label":"RDR_RDR - Pharmacy Dispense Information Response","description":"Query (QRY_Q28) / Response (RDR_RDR)","chapters":["CH_04"]},{"id":"RDS_O01","type":"Message","label":"RDS_O01 - Pharmacy/treatment dispense information","description":"The RDS message may be created by the Pharmacy application for each instance of dispensing drugs to fill an existing order or orders.  In the most common case, the RDS messages would be routed to a Nursing application or to some clinical application, which needs the data about drugs dispensed.  As a site-specific variant, the original order segments (RXO, RXE and their associated RXR/RXCs) may be sent optionally (for comparison). ","chapters":["CH_04"]},{"id":"RER_RER","type":"Message","label":"RER_RER - Pharmacy Encoded Order Information Response","description":"Query (QRY_Q29) / Response (RER_RER)","chapters":["CH_04"]},{"id":"RGR_RGR","type":"Message","label":"RGR_RGR - Pharmacy dose information response","description":"Query (QRY_Q30) / Response (RGR_RGR)","chapters":["CH_04"]},{"id":"RGV_O01","type":"Message","label":"RGV_O01 - Pharmacy/treatment give message","description":"The RGV message uses the RXG segment to record drug administration instructions.  It may carry information about a single scheduled administration on a drug, or it may carry information about multiple administrations of a drug","chapters":["CH_04"]},{"id":"ROR_ROR","type":"Message","label":"ROR_ROR - Pharmacy Prescription Order Response","description":"Query (QRY_Q26) / Response (ROR_ROR)","chapters":["CH_04"]},{"id":"RRA_O02","type":"Message","label":"RRA_O02 - Pharmacy/treatment administration acknowledgment message","description":"Response to a RAS_O02","chapters":["CH_04"]},{"id":"RRD_O02","type":"Message","label":"RRD_O02 - Pharmacy/treatment dispense acknowledgment message","description":"The RDS message may be created by the Pharmacy application for each instance of dispensing drugs to fill an existing order or orders.  In the most common case, the RDS messages would be routed to a Nursing application or to some clinical application, which needs the data about drugs dispensed.  As a site-specific variant, the original order segments (RXO, RXE and their associated RXR/RXCs) may be sent optionally (for comparison).","chapters":["CH_04"]},{"id":"RRE_O02","type":"Message","label":"RRE_O02 - Pharmacy/treatment encoded order acknowledgment message","description":"This message communicates the Pharmacy application's encoding of the pharmacy order (ORM message with RXO segment, see above).  It may be sent as an unsolicited message to report on either a single order or multiple pharmacy orders for a patient.\r\n \r\n ","chapters":["CH_04"]},{"id":"RRG_O02","type":"Message","label":"RRG_O02 - Pharmacy/treatment give acknowledgment message","description":"The RGV message uses the RXG segment to record drug administration instructions.  It may carry information about a single scheduled administration on a drug, or it may carry information about multiple administrations of a drug. ","chapters":["CH_04"]},{"id":"UDM_Q05","type":"Message","label":"UDM_Q05 - Unsolicited Display Update Message","description":"There is a simple HL7 message that allows for unsolicited display update messages to be sent in HL7 format from one system to another. \r\n \r\nTrigger events for the unsolicited update are generally the completion of a particular action (concerning a given patient).","chapters":["CH_02"]}]