{"id":"ADT_A42","msgStructId":"ADT_A42","eventDesc":"Merge visit - visit number","description":"A merge has been done at the visit identifier level. That is, two PV1-19 - Visit Number identifiers have been merged into one.\r\n\r\nAn A42 event is used to signal a merge of records for a visit that was incorrectly filed under two different visit numbers. The \"incorrect source visit number\" identified in the MRG segment (MRG-5 - Prior Visit Number) is to be merged with the required \"correct target visit number\" identified in the PV1 segment (PV1-19 - Visit Number). The \"incorrect source visit number\" would then logically never be referenced in future transactions. It is noted that some systems may still physically keep this \"incorrect identifier\" for audit trail purposes or other reasons associated with database index implementation requirements.\r\n\r\nAn A42 (merge visit-visit number) event is intended for merging visit records without merging other identifiers. Any other identifiers that were previously associated with the \"incorrect source visit number\" are now associated with the \"correct target visit number.\"\r\n\r\nEach superior identifier associated with this visit identifier level should have the same value in the PID and MRG segments, or the MRG and PV1 segments, as appropriate.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.2, \"Merge,\" for a discussion of issues related to the implementation of merge messages.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other fields change, it is recommended that the A08 (update patient information) event be used in addition.","sample":null,"chapters":["CH_03"],"segments":[{"id":"MSH","name":"MSH","longName":"Message Header","sequence":"1","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"SFT","name":"SFT","longName":"Software Segment","sequence":"2","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"UAC","name":"UAC","longName":"User Authentication Credential Segment","sequence":"3","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"EVN","name":"EVN","longName":"Event Type","sequence":"4","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":null,"name":"PATIENT","longName":null,"sequence":null,"usage":"R","rpt":"*","isGroup":true,"segments":[{"id":"PID","name":"PID","longName":"Patient Identification","sequence":"5","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PD1","name":"PD1","longName":"Patient Additional Demographic","sequence":"6","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"MRG","name":"MRG","longName":"Merge Patient Information","sequence":"7","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PV1","name":"PV1","longName":"Patient Visit","sequence":"8","usage":"O","rpt":"1","isGroup":false,"segments":null}]}]}