{"id":"EHC_E12","msgStructId":"EHC_E12","eventDesc":"Request Additional Information","description":"A Payer or TPA uses this message to request additional information in support of an Invoice or a (Pre) Authorization Request.  Normally, this request would be sent following receipt of an E01 or E20 message.  However, it can also be sent following receipt of an E04 Re-Assess HealthCare Services Invoice Request.  In this latter case the request for additional information still has as its object the original invoice (which is now under review) rather than the Re-assessment request per se.\r\n\r\nThe E12 can only be used to initiate a request for information and cannot be used to modify, place on hold or cancel an earlier request.  This message cannot be used to convey information on the status of a claim and/or adjudication results (i.e., cannot be used in place of an E10 Edit/Adjudication Results message).\r\n\r\nThe scope of the request for additional information is defined through the inclusion of contextual data from the original Invoice or (Pre) Authorization Request.  By specifying a particular Product/Service Group, patient and/or Product/Service Line item the requested information (e.g., a discharge narrative) is deemed to apply to those particular service events and not to any others which may have been part of the original Invoice or (Pre) Authorization Request.\r\n\r\nIn terms of absolute limits the E12 request is restricted to a single Product/Service Group from the original Invoice or (Pre) Authorization Request.   Thereafter, the context can be more narrowly defined by inclusion of patient and/or Product/Service Line item information from within the same Product/Service Group. Thus, if a particular P/S Line Item is included, the message recipient must interpret this to mean that the request is related to that one line item.  If the P/S Line Item is excluded the request is related to any and all line items in the original Product/Service Group.  Similarly for patients: identification of a particular patient restricts the request to that patient alone, whereas omission of patient information means that the request applies to any and all patients identified in the original Product/Service Group.\r\n\r\nThe E12 message is restricted to zero or one patients and to zero or one Product/Service Line items.  One consequence of these limits is that a Payer requiring information about a variety of patients or products/services from an original invoice may have to generate multiple (E12) requests. \r\n\r\nThe E12 message requires the use of LOINC classification standard to describe the information being requested (as do the E13/14 response messages).  The codified request can also be supplemented by free-form text if greater specificity is required.\r\n\r\nThis message supports the use of pre-defined responses.  That is, the sender specifies both the request as well as a range of possible answers for the recipient to choose from.  This is an optional usage that is designed for real-time environments in which the Payer employs an adjudication engine to both solicit the additional information and manage the responses.","sample":null,"chapters":["CH_16"],"segments":[{"id":"MSH","name":"MSH","longName":"Message Header","sequence":"1","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"SFT","name":"SFT","longName":"Software Segment","sequence":"2","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"UAC","name":"UAC","longName":"User Authentication Credential Segment","sequence":"3","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"RFI","name":"RFI","longName":"Request For Information","sequence":"4","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"CTD","name":"CTD","longName":"Contact Data","sequence":"5","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"IVC","name":"IVC","longName":"Invoice Segment","sequence":"6","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PSS","name":"PSS","longName":"Product/service Section","sequence":"7","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PSG","name":"PSG","longName":"Product/service Group","sequence":"8","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PID","name":"PID","longName":"Patient Identification","sequence":"9","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"PSL","name":"PSL","longName":"Product/service Line Item","sequence":"10","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":null,"name":"REQUEST","longName":null,"sequence":null,"usage":"R","rpt":"*","isGroup":true,"segments":[{"id":"CTD","name":"CTD","longName":"Contact Data","sequence":"11","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"OBR","name":"OBR","longName":"Observation Request","sequence":"12","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"NTE","name":"NTE","longName":"Notes And Comments","sequence":"13","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"OBX","name":"OBX","longName":"Observation/result","sequence":"14","usage":"O","rpt":"*","isGroup":false,"segments":null}]}]}