{"id":"ADT_A47","msgStructId":"ADT_A47","eventDesc":"Change patient identifier list","description":"A change has been done at the patient identifier list level. That is, a single PID-3 - patient identifier list value has been found to be incorrect and has been changed.\r\n\r\nAn A47 event is used to signal a change of an incorrectly assigned PID-3 - Patient Identifier List value. The \"incorrect source identifier\" value is stored in the MRG segment (MRG-1 - Prior Patient Identifier List) and is to be changed to the \"correct target patient ID\" value stored in the PID segment (PID-3 - Patient Identifier List).\r\n\r\nThe identifier involved in identifying the patient may or may not have accounts, which may or may not have visits. An A47 (change patient identifier list) event is intended for changing the value of the patient identifier list without affecting other subordinate identifiers. Any other subordinate identifiers that were previously associated with the \"incorrect source identifier\" are now associated with the \"correct target identifier.\" Specification of these other subordinate identifiers is not required.\r\n\r\nThis event and the message syntax do, however, allow for the specification of \"new subordinate identifiers\" (in addition to the PID-3 - Patient Identifier List identifier). For those environments that may require changes to these other subordinate identifiers because of this A47 (change patient identifier list) event, it is required that the old and new identifiers be a \"tightly coupled\" pair.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.4, \"Change identifier,\" for a discussion of issues related to the implementation of change messages.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When demographic data in other fields change, it is recommended that the A31 (update patient information) event be used in conjunction with this message.","sample":null,"chapters":["CH_03"],"segments":[{"id":"MSH","name":"MSH","longName":"Message Header","sequence":"1","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"SFT","name":"SFT","longName":"Software Segment","sequence":"2","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"UAC","name":"UAC","longName":"User Authentication Credential Segment","sequence":"3","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"EVN","name":"EVN","longName":"Event Type","sequence":"4","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":null,"name":"PATIENT","longName":null,"sequence":null,"usage":"R","rpt":"*","isGroup":true,"segments":[{"id":"PID","name":"PID","longName":"Patient Identification","sequence":"5","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PD1","name":"PD1","longName":"Patient Additional Demographic","sequence":"6","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"ARV","name":"ARV","longName":"Access Restriction","sequence":"7","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"MRG","name":"MRG","longName":"Merge Patient Information","sequence":"8","usage":"R","rpt":"1","isGroup":false,"segments":null}]}]}