{"id":"ADT_A10","msgStructId":"ADT_A10","eventDesc":"Patient arriving - tracking","description":"The A10 event is sent when a patient arrives at a new location in the healthcare facility (inpatient or outpatient). The A09 - patient departing-tracking and A10 events are used when there is a change in a patient's physical location and when this is NOT a change in the official census bed location, as in the case of an outpatient setting. There are three varieties of these non-census location changes involving three different kinds of notification: (a) an unofficial notification of location change prior to the official notification of patient tracking, (b) the patient is in transit between locations for some time, (c) a notification of a temporary location change.\r\n\r\nPatient tracking: If the patient is now at a non-temporary location and is not in transit, then PV1-3 - Assigned Patient Location must contain the new patient location and PV1-6 - Prior Patient Location can contain the old patient location.\r\n\r\nIn transit: This is used when there is some period of time between when the patient leaves his/her old location and when he/she arrives at the new assigned location. If the patient was in transit during the time between the A09 (patient departing-tracking) event and the A10 (patient arriving-tracking) event, then PV1-3 - Assigned Patient Location is used for the new location and PV1-6 - Prior Patient Location should be used for the old location. PV1-11 - Temporary Location and PV1-43 - Prior Temporary Location are not used.\r\n\r\nTemporary location: An A10 event can also be used when the patient is being transferred from a temporary location (X-RAY, O/R, LIMBO, or HALLWAY) to the new assigned location. If the patient is arriving at a temporary location (such as the O/R, X-RAY, LIMBO, or HALLWAY), then PV1-11 - Temporary Location would be used to indicate the new temporary location. If the patient is moving from one temporary location to another, then PV1-43 - Prior Temporary Location may also be used. If the patient is arriving at a permanent location from a temporary location, PV1-3 - Assigned Patient Location should be used for the new location, and PV1-43 - Prior Temporary Location should be used for the old location.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nAttention: The DG1 segment was retained for backward compatibility only as of v2.4 and was withdrawn and removed from this message structure as of v2.7.","sample":null,"chapters":["CH_03"],"segments":[{"id":"MSH","name":"MSH","longName":"Message Header","sequence":"1","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"SFT","name":"SFT","longName":"Software Segment","sequence":"2","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"UAC","name":"UAC","longName":"User Authentication Credential Segment","sequence":"3","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"EVN","name":"EVN","longName":"Event Type","sequence":"4","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PID","name":"PID","longName":"Patient Identification","sequence":"5","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PD1","name":"PD1","longName":"Patient Additional Demographic","sequence":"6","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"PV1","name":"PV1","longName":"Patient Visit","sequence":"7","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PV2","name":"PV2","longName":"Patient Visit - Additional Information","sequence":"8","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"DB1","name":"DB1","longName":"Disability","sequence":"9","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"OBX","name":"OBX","longName":"Observation/result","sequence":"10","usage":"O","rpt":"*","isGroup":false,"segments":null}]}