{"id":"ADT_A44","msgStructId":"ADT_A44","eventDesc":"Move account information - patient account number","description":"A move has been done at the account identifier level. That is, a PID-18 - Patient Account Number associated with one PID-3 - Patient Identifier List has been moved to another patient identifier list.\r\n\r\nAn A44 event is used to signal a move of records identified by the MRG-3 - Prior Patient Account Number from the \"incorrect source patient identifier list\" identified in the MRG segment (MRG-1 - Prior Patient Identifier List) to the \"correct target patient identifier list\" identified in the PID segment (PID-3 - Patient Identifier List).\r\n\r\nThe account number involved in identifying the account to be moved (MRG-3 - Prior Patient Account Number) may or may not have visits. In any case, all subordinate data sets associated with the account number in MRG-3 - Prior Patient Account Number are moved along with the account number, from the \"incorrect source\" ID (MRG-1 - Prior Patient Identifier List) to the \"correct target\" ID (PID-3 - Patient Identifier List).\r\n\r\nNo identifiers subordinate to the account number (visit number, alternate visit ID) are valued in this message.\r\n\r\nThis event and the message syntax do, however, allow for the specification of a \"new identifier\" (PID-18 - Patient Account Number), which may be application and/or implementation-specific and therefore require site negotiation.\r\n\r\nAll of the identifiers superior to the account number should be valued in both the MRG segment and the PID segment. In this message, the PID-3 - Patient Identifier List is superior to the account number.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.3, \"Move,\" for a discussion of issues related to the implementation of move messages.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When demographic data in other fields change, it is recommended that the A08 (update patient information) event be used in conjunction with this message. However, all PID data associated with the \"account number\" are treated as updated information.","sample":null,"chapters":["CH_03"],"segments":[{"id":"MSH","name":"MSH","longName":"Message Header","sequence":"1","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"SFT","name":"SFT","longName":"Software Segment","sequence":"2","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"UAC","name":"UAC","longName":"User Authentication Credential Segment","sequence":"3","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"EVN","name":"EVN","longName":"Event Type","sequence":"4","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":null,"name":"PATIENT","longName":null,"sequence":null,"usage":"R","rpt":"*","isGroup":true,"segments":[{"id":"PID","name":"PID","longName":"Patient Identification","sequence":"5","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"PD1","name":"PD1","longName":"Patient Additional Demographic","sequence":"6","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"ARV","name":"ARV","longName":"Access Restriction","sequence":"7","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"MRG","name":"MRG","longName":"Merge Patient Information","sequence":"8","usage":"R","rpt":"1","isGroup":false,"segments":null}]}]}