[{"id":"ACK","type":"Message","label":"ACK - ","description":null,"chapters":["CH_02"]},{"id":"ADT_A01","type":"Message","label":"ADT_A01 - Admit/visit notification","description":"An A01 event is intended to be used for \"Admitted\" patients only. An A01 event is sent as a result of a patient undergoing the admission process which assigns the patient to a bed. It signals the beginning of a patient's stay in a healthcare facility. Normally, this information is entered in the primary Patient Administration system and broadcast to the nursing units and ancillary systems. It includes short stay and \"Adam Everyman\" (e.g., patient name is unknown) admissions. For example, an A01 event can be used to notify: the pharmacy system that a patient has been admitted and may be legitimately prescribed drugs; thenursing system that the patient has been admitted and needs a care plan prepared; the finance system of the start of the billing period; the dietary system that a new patient has been installed and requires dietary services; the laboratory, pathology, and radiology systems that a patient has been admitted and is entitled to receive services; the clinical repository that an admission has taken place for the EMR (electronic medical record).\r\n\r\nWhen an account's start and end dates span a period greater than any particular visit, the P01 (add patient account) event should be used to transmit the opening of an account. The A01 event can notify systems of the creation of an account as well as notify them of a patient's arrival in the healthcare facility. In order to create a new account without notifying of patient's arrival, use the P01 event.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin and end date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL segment, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","chapters":["CH_03"]},{"id":"ADT_A02","type":"Message","label":"ADT_A02 - Transfer a patient","description":"An A02 event is issued as a result of the patient changing his or her assigned physical location.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition. If the transfer function of your Patient Administration system allows demographics to change at the same time as the transfer (for example an address change), we recommend (but do not require) sending two messages (an A02 followed by an A08). This A02 event can be used with admitted and non-admitted patients.\r\n\r\nThe new patient location should appear in PV1-3 - Assigned Patient Location while the old patient location should appear in PV1-6 - Prior Patient Location. For example, an A02 event can be used to notify: laboratory, radiology, pathology that the patient has changed location and test results should be redirected; pharmacy that drugs should be redirected for the patient; dietary that the meals should be delivered to a different location; the clinical repository that a transfer has taken place for the Electronic Medical Record.\r\n\r\nIf the patient is going to a temporary location (such as the O/R, X-RAY, LIMBO, the HALLWAY) it is recommended that the A09 (patient departing-tracking) and A10 (patient arriving-tracking) events be used instead of A02. It is recommended that A02 be used only for a real change in the census bed in the Patient Administration system.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin- and end-date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL segment, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","chapters":["CH_03"]},{"id":"ADT_A03","type":"Message","label":"ADT_A03 - Discharge/end visit","description":"An A03 event signals the end of a patient's stay in a healthcare facility. It signals that the patient's status has changed to \"discharged\" and that a discharge date has been recorded. The patient is no longer in the facility. The patient's location prior to discharge should be entered in PV1-3 - Assigned Patient Location.\r\n\r\nAn A03 event can be sent to notify: the pharmacy that the patient's stay has ended and that entitlement to drugs has changed accordingly; the nursing system that the patient has been discharged and that the care plan can be completed; the extended care or home health system that the patient has been discharged and that the new extended care or home health admission assessment can be scheduled; the finance system that the patient billing period has ended; and/or the clinical repository that discharge has taken place for the EMR.\r\n\r\nFor non-admitted patients, an A03 event signals the end of a patient's visit to a healthcare facility. It could be used to signal the end of a visit for a one-time or recurring outpatient who is not assigned to a bed. It could also be used to signal the end of a visit to the Emergency Room. PV1-45 - Discharge Date/Time can be used for the visit end date/time.\r\n\r\nWhen an account's start and end dates span a period greater than any particular visit, the P06 (end account) event should be used to transmit information about the closing of an account. To indicate that a patient has expired, use an A03 event with the PID-29 - Patient Death Date and Time and PID-30 - Patient Death Indicator filled in.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. The optional allergy, next-of-kin, insurance and guarantor fields should be sent when required to support advanced notification for pending extended care or home health admission requirements (such as scheduling of a nursing assessment in preparation for completion of the extended care plan). When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin date and end date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL segment, with the applicable ROL-3 - Role Code.","chapters":["CH_03"]},{"id":"ADT_A04","type":"Message","label":"ADT_A04 - Register a patient","description":"An A04 event signals that the patient has arrived or checked in as a one-time, or recurring outpatient, and is not assigned to a bed. One example might be its use to signal the beginning of a visit to the Emergency Room (= Casualty, etc.). Note that some systems refer to these events as outpatient registrations or emergency admissions. PV1-44 - Admit Date/Time is used for the visit start date/time.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin- and end-date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL segment, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","chapters":["CH_03"]},{"id":"ADT_A05","type":"Message","label":"ADT_A05 - Pre-admit a patient","description":"An A05 event is sent when a patient undergoes the pre-admission process. During this process, episode-related data is collected in preparation for a patient's visit or stay in a healthcare facility. For example, a pre-admit may be performed prior to inpatient or outpatient surgery so that lab tests can be performed prior to the surgery. This event can also be used to pre-register a non-admitted patient.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Visit level providers (corresponding to the PV1 data) are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin- and end-date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL segment, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","chapters":["CH_03"]},{"id":"ADT_A06","type":"Message","label":"ADT_A06 - Change an outpatient to an inpatient","description":"An A06 event is sent when a patient who was present for a non-admitted visit is being admitted after an evaluation of the seriousness of the patient's condition. This event changes a patient's status from non-admitted to admitted. The new patient location should appear in PV1-3 - Assigned Patient Location, while the old patient location (if different) should appear in PV1-6 - Prior Patient Location. The new patient class should appear in PV1-2 - Patient Class.\r\n\r\nIt will be left to implementation negotiation to determine whether disparate systems merely change the patient class, or close and open a new account. The current active account number should appear in field PID-18 - Patient Account Number; the prior account number can be included optionally in MRG-3 - Prior Patient Account Number. This arrangement is not intended to be a type of merge. The MRG segment isused here only for MRG-3 - Prior Patient Account Number. PV1-19 - Visit Number may also be changed during this event.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Visit level providers (corresponding to the PV1 data) are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin- and end-date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL segment, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","chapters":["CH_03"]},{"id":"ADT_A07","type":"Message","label":"ADT_A07 - Change an inpatient to an outpatient","description":"An A07 event is sent when a patient who was admitted changes his/her status to \"no longer admitted\" but is still being seen for this episode of care. This event changes a patient from an \"admitted\" to a \"non-admitted\" status. The new patient location should appear in PV1-3 - Assigned Patient Location, while the old patient location (if different) should appear in PV1-6 - Prior Patient Location.\r\n\r\nIt will be left to implementation negotiation to determine whether disparate systems merely change the patient class, or close and open a new account. The current active account number should appear in field PID-18 - Patient Account Number; the prior account number can be included optionally in MRG-3 - Prior Patient Account Number. This arrangement is not intended to be a type of merge. The MRG segment is used here only for MRG-3 - Prior Patient Account Number. PV1-19 - Visit Number may also be changed during this event.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin and end date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL segment, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","chapters":["CH_03"]},{"id":"ADT_A08","type":"Message","label":"ADT_A08 - Update patient information","description":"This trigger event is used when any patient information has changed but when no other trigger event has occurred. For example, an A08 event can be used to notify the receiving systems of a change of address or a name change. We strongly recommend that the A08 transaction be used to update fields that are not updated by any of the other trigger events. If there are specific trigger events for this update, these trigger events should be used. For example, if a patient's address and location are to be changed, then an A08 is used to change the patient address and the appropriate patient location trigger event is used to change the patient location. The A08 event can include information specific to an episode of care, but it can also be used for demographic information only.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin- and end-date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","chapters":["CH_03"]},{"id":"ADT_A09","type":"Message","label":"ADT_A09 - Patient departing - tracking","description":"The A09 and A10 - patient arriving-tracking events are used when there is a change in a patient's physical location (inpatient or outpatient) and when this is NOT a change in the official census bed location, as in the case of an outpatient setting. There are three situations that qualify as non-census location changes: (a) patient tracking, (b) the patient is in transit between locations for some time, (c) a notification of temporary location change.\r\n\r\nPatient tracking: This can be used when the nursing application sends a \"transfer\" before the Patient Administration (or official census) system issues an A02 (transfer a patient) event. If the patient has left for a non-temporary location and is not in transit, then the PV1-3 - Assigned Patient Location must contain the new patient location, while PV1-6 - Prior Patient Location must contain the old patient location.\r\n\r\nIn transit: The patient's location during the time between an A09 and an A10 (patient arriving - tracking) is defined as \"in transit.\" The A09 event is sent when a patient departs from one area of the healthcare facility for the purpose of arriving at another area, but without leaving the healthcare institution. This event is used when there is a time span during which the patient is neither at his/her old location nor at his/her new location. This process can take some time if a patient is being sent to another area in a multi-campus or multi-facility environment. The combination of an A09 and an A10 would serve the same purpose as an A02 (transfer a patient) event, except that it accounts for a gap in time required for transport between facilities. If the patient will be in transit during the time between the A09 (patient departing - tracking) event and the A10 (patient arriving - tracking) event, then PV1-42 - Pending Location is used for the new location, and PV1-11 - Temporary Location and PV1-43 - Prior Temporary Location would not be used. PV1-6 - Prior Patient Location should be used for the old location.\r\n\r\nTemporary location: An A09 can also be used when the patient is being sent to a temporary location (such as the O/R, X-RAY, LIMBO, or HALLWAY). The patient may or may not return to the same assignedlocation after occupying the temporary location. If the patient is going to a temporary location (such as the O/R, X-RAY, LIMBO, or HALLWAY), then PV1-11 - Temporary Location is used to indicate the new temporary location. If the patient is moving from one temporary location to another, then PV1-43 - Prior Temporary Location may also be used. PV1-6 - Prior Patient Location and PV1-11 - Temporary Location should be used when the patient is moving from a permanent location to a temporary location.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nAttention: The DG1 segment was retained for backward compatibility only as of v2.4 and was withdrawn and removed from this message structure as of v2.7.","chapters":["CH_03"]},{"id":"ADT_A10","type":"Message","label":"ADT_A10 - Patient arriving - tracking","description":"The A10 event is sent when a patient arrives at a new location in the healthcare facility (inpatient or outpatient). The A09 - patient departing-tracking and A10 events are used when there is a change in a patient's physical location and when this is NOT a change in the official census bed location, as in the case of an outpatient setting. There are three varieties of these non-census location changes involving three different kinds of notification: (a) an unofficial notification of location change prior to the official notification of patient tracking, (b) the patient is in transit between locations for some time, (c) a notification of a temporary location change.\r\n\r\nPatient tracking: If the patient is now at a non-temporary location and is not in transit, then PV1-3 - Assigned Patient Location must contain the new patient location and PV1-6 - Prior Patient Location can contain the old patient location.\r\n\r\nIn transit: This is used when there is some period of time between when the patient leaves his/her old location and when he/she arrives at the new assigned location. If the patient was in transit during the time between the A09 (patient departing-tracking) event and the A10 (patient arriving-tracking) event, then PV1-3 - Assigned Patient Location is used for the new location and PV1-6 - Prior Patient Location should be used for the old location. PV1-11 - Temporary Location and PV1-43 - Prior Temporary Location are not used.\r\n\r\nTemporary location: An A10 event can also be used when the patient is being transferred from a temporary location (X-RAY, O/R, LIMBO, or HALLWAY) to the new assigned location. If the patient is arriving at a temporary location (such as the O/R, X-RAY, LIMBO, or HALLWAY), then PV1-11 - Temporary Location would be used to indicate the new temporary location. If the patient is moving from one temporary location to another, then PV1-43 - Prior Temporary Location may also be used. If the patient is arriving at a permanent location from a temporary location, PV1-3 - Assigned Patient Location should be used for the new location, and PV1-43 - Prior Temporary Location should be used for the old location.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nAttention: The DG1 segment was retained for backward compatibility only as of v2.4 and was withdrawn and removed from this message structure as of v2.7.","chapters":["CH_03"]},{"id":"ADT_A11","type":"Message","label":"ADT_A11 - Cancel admit/visit notification","description":"For \"admitted\" patients, the A11 event is sent when an A01 (admit/visit notification) event is cancelled, either because of an erroneous entry of the A01 event, or because of a decision not to admit the patient after all.\r\n\r\nFor \"non-admitted\" patients, the A11 event is sent when an A04 (register a patient) event is cancelled, either because of an erroneous entry of the A04 event, or because of a decision not to check the patient in for the visit after all. To cancel an A05 (pre-admit a patient) event, use the A38 (cancel pre-admit), which was new for Version 2.3 of this Standard.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nAttention: The DG1 segment was retained for backward compatibility only as of v2.4 and was withdrawn and removed from this message structure as of v2.7.","chapters":["CH_03"]},{"id":"ADT_A12","type":"Message","label":"ADT_A12 - Cancel transfer","description":"The A12 event is sent when an A02 (transfer a patient) event is cancelled, either because of erroneous entry of the A02 event or because of a decision not to transfer the patient after all. PV1-3 - Assigned Patient Location must show the location of the patient prior to the original transfer.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) even be used in addition.\r\n\r\nAttention: The DG1 segment was retained for backward compatibility only as of v2.4 and was withdrawn and removed from this message structure as of v2.7.","chapters":["CH_03"]},{"id":"ADT_A13","type":"Message","label":"ADT_A13 - Cancel discharge/end visit","description":"The A13 event is sent when an A03 (discharge/end visit) event is cancelled, either because of erroneous entry of the A03 event or because of a decision not to discharge or end the visit of the patient after all. PV1-3 - Assigned Patient Location should reflect the location of the patient after the cancellation has been processed. Note that this location may be different from the patient's location prior to the erroneous discharge. Prior Location could be used to show the location of the patient prior to the erroneous discharge.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin- and end-date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","chapters":["CH_03"]},{"id":"ADT_A14","type":"Message","label":"ADT_A14 - Pending admit","description":"An A14 event notifies other systems of a planned admission, when there is a reservation or when patient admission is to occur imminently. The A14 event is similar to a pre-admit, but without the implication that an account should be opened for the purposes of tests prior to admission. It is used when advanced notification of an admit is required in order to prepare for the patient's arrival.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin- and end-date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","chapters":["CH_03"]},{"id":"ADT_A15","type":"Message","label":"ADT_A15 - Pending transfer","description":"An A15 event notifies other systems of a plan to transfer a patient to a new location when the patient has not yet left the old location. It is used when advanced notification of a transfer is required in order to prepare for the patient's location change. For example, this transaction could be sent so that staff will be on hand to move the patient or so that dietary services can route the next meal to the new location.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin- and end-date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL segment, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.\r\n\r\nAttention: The DG1 segment was retained in this message for backward compatibility only as of v2.4 and was withdrawn and removed from this message structure as of v2.7.","chapters":["CH_03"]},{"id":"ADT_A16","type":"Message","label":"ADT_A16 - Pending discharge","description":"An A16 event notifies other systems of a plan to discharge a patient when the patient has not yet left the healthcare facility. It is used when advanced notification of a discharge is required in order to prepare for the patient's change in location. For example, it is used to notify the pharmacy of the possible need for discharge drugs or to notify psychotherapy of the possible need for post-discharge appointments or to notify the extended care or home health system that the patient will be discharged and that the new extended care and home health admission assessment can be scheduled.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin- and end-date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","chapters":["CH_03"]},{"id":"ADT_A17","type":"Message","label":"ADT_A17 - Swap patients","description":"The A17 is used when it is decided that two patients will exchange beds. The patient ID and visit data are repeated for the two patients changing places. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.","chapters":["CH_03"]},{"id":"ADT_A20","type":"Message","label":"ADT_A20 - Bed status update","description":"Certain nursing/census applications need to be able to update the Patient Administration system's bed status.","chapters":["CH_03"]},{"id":"ADT_A21","type":"Message","label":"ADT_A21 - Patient goes on a \"leave of absence\"","description":"An A21 event is sent to notify systems that an admitted patient has left the healthcare institution temporarily. It is used for systems in which a bed is still assigned to the patient, and it puts the current admitted patient activities on hold. For example, it is used to notify dietary services and laboratory systems when the patient goes home for the weekend.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nAs there is no specific field for the LOA start date/time, it is recommended field EVN-6 - Event Occurred contain the date/time the patient actually left. PV2-47 - Expected LOA Return Date/Time is used to communicate the date/time the patient is expected to return from LOA.","chapters":["CH_03"]},{"id":"ADT_A22","type":"Message","label":"ADT_A22 - Patient returns from a \"leave of absence\"","description":"An A22 event is sent to notify systems that an admitted patient has returned to the healthcare institution after a temporary \"leave of absence.\" It is used for systems in which a bed is still assigned to the patient, and it takes their current admitted patient activities off of \"hold\" status. For example, it is used to notify dietary services and laboratory systems when the patient returns from a weekend trip to his/her home.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nAs there is no specific field for the LOA start date/time, it is recommended that field EVN-6 - Event Occurred contain the date/time the patient actually returned from LOA. PV2-47 - Expected LOA Return Date/Time is used to communicate the date/time the patient was expected to return from LOA.","chapters":["CH_03"]},{"id":"ADT_A23","type":"Message","label":"ADT_A23 - Delete a patient record","description":"The A23 event is used to delete visit or episode-specific information from the patient record. For example, it is used to remove old data from a database that cannot hold all historical patient visit data. When an event was entered erroneously, use one of the cancel transactions. This event can be used to purge account-level data while retaining the person in the database.","chapters":["CH_03"]},{"id":"ADT_A24","type":"Message","label":"ADT_A24 - Link patient information","description":"The A24 event is used when the first PID segment needs to be linked to the second PID segment and when both patient identifiers identify the same patient. Linking two or more patients does not require the actual merging of patient information; following a link event, the affected patient data records should remain distinct. For example, this event could be used in a hospital network environment in which there are multiple campuses and in which records need to be linked. For example, hospital A, hospital B, and hospital C would each keep their own records on a patient, but an A24 link event would be sent to a corporate-wide MPI to enable the coupling of ID information with the corporate ID number. It is used for corporate data repositories, etc. This event is not meant to link mothers and babies since a field exists (PID-21 - Mother's Identifier) for that purpose. See section 3.6.3, \"Patient record links,\" for a discussion of issues related to implementing patient link messages and MPI issues.\r\n\r\nThis event can also be used to link two patient identifiers when a patient changes from inpatient to outpatient, or vice versa. This event can also be used to link two visits of the same patient.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.","chapters":["CH_03"]},{"id":"ADT_A25","type":"Message","label":"ADT_A25 - Cancel pending discharge","description":"The A25 event is sent when an A16 (pending discharge) event is cancelled, either because of erroneous entry of the A16 event or because of a decision not to discharge the patient after all.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.","chapters":["CH_03"]},{"id":"ADT_A26","type":"Message","label":"ADT_A26 - Cancel pending transfer","description":"The A26 event is sent when an A15 (pending transfer) event is cancelled, either because of erroneous entry of the A15 event or because of a decision not to transfer the patient after all.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.","chapters":["CH_03"]},{"id":"ADT_A27","type":"Message","label":"ADT_A27 - Cancel pending admit","description":"The A27 event is sent when an A14 (pending admit) event is cancelled, either because of erroneous entry of the A14 event or because of a decision not to admit the patient after all.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.","chapters":["CH_03"]},{"id":"ADT_A28","type":"Message","label":"ADT_A28 - Add person information","description":"The purpose of this and the three following messages was to allow sites with multiple systems and respective master patient databases to communicate activity related to a person regardless of whether that person is currently a patient on each system. Each system has an interest in the database activity of the others in order to maintain data integrity across an institution. Though they are defined within the ADT message set, these messages differ in that they are not patient-specific. To a certain registry, the person may be a person of interest, a potential future patient, or a potential guarantor. For example, these events can be used to maintain an MPI (master patient index), a cancer registry, members of a managed care plan, an HIV database, etc.\r\n\r\nThese events should not replace the use of the A01 (admit/visit notification), A03 (discharge/end visit), A04 (register a patient), A08 (update patient information), etc., events. They are not intended to be used for notification of real-time Patient Administration events. These events are primarily for demographic data, but optional historical non-demographic data may be sent as well.\r\n\r\nThe person whose data is being sent should be identified in the PID segment using the PID-3 - Patient Identifier List, even when the person is not a patient and may be a potential guarantor. An A28 establishes person identifiers, e.g., social security number, guarantor identifier, or other unique identifiers, and contains a person identifier in the PID-3 - Patient Identifier List. The person involved may or may not have active or inactive cases associated with them. When field names and descriptions say \"patient,\" we must translate that to \"person\" for these transactions. In this manner, \"person information\" about a guarantor can be sent independently of the guarantor's relation to any patient.\r\n\r\nFor example, a site with separate inpatient, outpatient and medical records systems may require that each system maintain concurrent person information. Prior to an admit, the new person is added to the master database of the inpatient system, resulting in the broadcast of a message. The outpatient system receives the message and adds the person to its database with the possibility that the person may someday become apatient in its system. The medical records system receives the message and adds the person to its database with the possibility that it will track inpatient, outpatient, or clinical data for that person. The clinical repository database or MPI receives the message to keep all potential patients and guarantors in its database.\r\n\r\nThe A28 event can be used to send everything that is known about a person. For example, it can be sent to an ICU unit (in addition to the A02 (transfer a patient) event) when a patient is transferred to the ICU unit in order to backload all demographic information for the patient into the ICU system. An A28 (add person information) or A31 (update person information) can also be used for backloading MPI information for the person, or for backloading person and historical information.\r\nIn addition to adding a person to a database, the delete, update, and merge messages work in a similar manner to maintain concurrent person information. It is left up to site-specific negotiations to decide how much data must be transmitted or re-transmitted when a person becomes a patient.\r\nTo maintain backward compatibility with previous releases, the PV1 segment is required. However, a \"pseudo-optional\" PV1 can be achieved by valuing PV1-2 - Patient Class to N - not applicable.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin and end date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL,","chapters":["CH_03"]},{"id":"ADT_A29","type":"Message","label":"ADT_A29 - Delete person information","description":"An A29 event can be used to delete all demographic information related to a given person. This event \"undoes\" an A28 (add person information) event. The information from the A28 event is deleted. This event is used, for example, when adding the information was performed in error, or when another record already exists for the person, or when one wants to purge the person from the database. When this event occurs, all visit and account level data for this person is also purged.\r\n\r\nTo maintain backward compatibility with previous releases, the PV1 segment is required. However, a \"pseudo-optional\" PV1 can be achieved by valuing PV1-2 - Patient Class to N - not applicable.","chapters":["CH_03"]},{"id":"ADT_A31","type":"Message","label":"ADT_A31 - Update person information","description":"An A31 event can be used to update person information on an MPI. It is similar to an A08 (update patient information) event, but an A08 (update patient information) event should be used to update patient information for a current episode. An A28 (add person information) or A31 can also be used for backloading MPI information for the person, or for backloading person and historical information.\r\n\r\nTo maintain backward compatibility with previous releases, the PV1 segment is required. However, a \"pseudo-optional\" PV1 can be achieved by valuing PV1-2 - Patient Class to N - not applicable.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin and end date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL segment, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","chapters":["CH_03"]},{"id":"ADT_A32","type":"Message","label":"ADT_A32 - Cancel patient arriving - tracking","description":"The A32 event is sent when an A10 (patient arriving-tracking) event is cancelled, either because of erroneous entry of the A10 event or because of a decision not to receive the patient after all.\r\n\r\nIf the patient was in a non-temporary location, then the PV1-3 - Assigned Patient Location may contain (if known) the original patient location prior to the erroneous A10 (patient arriving-tracking) event. If the patient was in a temporary location, then PV1-11 - Temporary Location may contain (if known) the original patient location prior to the erroneous A10 (patient arriving-tracking) event.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.","chapters":["CH_03"]},{"id":"ADT_A33","type":"Message","label":"ADT_A33 - Cancel patient departing - tracking","description":"The A33 event is sent when an A09 (patient departing-tracking) event is cancelled, either because of erroneous entry of the A09 event or because of a decision not to send the patient after all.\r\n\r\nIf the patient was in a non-temporary location, then PV1-3 - Assigned Patient location must contain the original patient location prior to the erroneous A09 (patient departing-tracking) event. If the patient was in a temporary location, then PV1-11 - Temporary Location must contain the original patient location prior to the erroneous A09 (patient departing-tracking) event.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.","chapters":["CH_03"]},{"id":"ADT_A37","type":"Message","label":"ADT_A37 - Unlink patient information","description":"The A37 event unlinks two patient identifiers.","chapters":["CH_03"]},{"id":"ADT_A38","type":"Message","label":"ADT_A38 - Cancel pre-admit","description":"The A38 event is sent when an A05 (pre-admit a patient) event is cancelled, either because of erroneous entry of the A05 event or because of a decision not to pre-admit the patient after all.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other fields change, it is recommended that the A08 (update patient information) event be used in addition.","chapters":["CH_03"]},{"id":"ADT_A40","type":"Message","label":"ADT_A40 - Merge patient - patient identifier list","description":"A merge has been done at the patient identifier list level. That is, two PID-3 - Patient Identifier List identifiers have been merged into one.\r\n\r\nAn A40 event is used to signal a merge of records for a patient that was incorrectly filed under two different identifiers. The \"incorrect source identifier\" identified in the MRG segment (MRG-1 - Prior Patient Identifier List) is to be merged with the required \"correct target identifier\" of the same \"identifier type code\" component identified in the PID segment (PID-3 - Patient Identifier List). The \"incorrect source identifier\" would then logically never be referenced in future transactions. It is noted that some systems may still physically keep this \"incorrect identifier\" for audit trail purposes or other reasons associated with database index implementation requirements.\r\n\r\nThe identifiers involved in identifying the patients may or may not have accounts, which may or may not have visits. An A40 (merge patient-patient identifier list) event is intended for merging patient records without merging other subordinate identifiers. Any other subordinate identifiers that were previously associated with the \"incorrect source identifier\" are now associated with the \"correct target identifier.\" Specification of these other subordinate identifiers is not required.\r\n\r\nThis event and the message syntax do, however, allow for the specification of any other \"new subordinate identifiers\" (in addition to the PID-3 - Patient Identifier List identifier). For those environments that may require changes to these other subordinate identifiers because of the A40 (merge patient-patient identifier list) event, it is required that the old and new identifiers be a \"tightly coupled\" pair.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.2, \"Merge,\" for a discussion of issues related to the implementation of merge messages.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other fields change, it is recommended that the A31 (update person information) event be used for person level updates and A08 (update patient information) event for patient level updates.","chapters":["CH_03"]},{"id":"ADT_A41","type":"Message","label":"ADT_A41 - Merge account - patient account number","description":"A merge has been done at the account identifier level. That is, two PID-18 - Patient Account Number identifiers have been merged into one.\r\n\r\nAn A41 event is used to signal a merge of records for an account that was incorrectly filed under two different account numbers. The \"incorrect source patient account number\" identified in the MRG segment (MRG-3 - Prior Patient Account Number) is to be merged with the \"correct target patient account number\" identified in the PID segment (PID-18 - Patient Account Number). The \"incorrect source patient account number\" would then logically never be referenced in future transactions. It is noted that some systems may still physically keep this \"incorrect identifier\" for audit trail purposes or other reasons associated with database index implementation requirements.\r\n\r\nThe patient account numbers involved may or may not have visits. An A41 (merge account-patient account number) is intended for merging account records without merging other subordinate identifiers. Any other subordinate identifiers that were previously associated with the \"incorrect source account number\" are now associated with the required \"correct target account number.\" Specification of these other subordinate identifiers is not required.\r\n\r\nThis event and the message syntax do, however, allow for the specification of any other \"new subordinate identifiers\" (in addition to the PID-18 - Patient Account Number identifier). For those environments that may require changes to these other subordinate identifiers because of this A41 (merge account-patient account number) event, it is required that the old and new identifiers be a \"tightly coupled\" pair.\r\n\r\nEach superior identifier associated with this account identifier level should have the same value in both the PID and MRG segments.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.2, \"Merge,\" for a discussion of issues related to the implementation of merge messages.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other fields change, it is recommended that the A08 (update patient information) event be used in addition","chapters":["CH_03"]},{"id":"ADT_A42","type":"Message","label":"ADT_A42 - Merge visit - visit number","description":"A merge has been done at the visit identifier level. That is, two PV1-19 - Visit Number identifiers have been merged into one.\r\n\r\nAn A42 event is used to signal a merge of records for a visit that was incorrectly filed under two different visit numbers. The \"incorrect source visit number\" identified in the MRG segment (MRG-5 - Prior Visit Number) is to be merged with the required \"correct target visit number\" identified in the PV1 segment (PV1-19 - Visit Number). The \"incorrect source visit number\" would then logically never be referenced in future transactions. It is noted that some systems may still physically keep this \"incorrect identifier\" for audit trail purposes or other reasons associated with database index implementation requirements.\r\n\r\nAn A42 (merge visit-visit number) event is intended for merging visit records without merging other identifiers. Any other identifiers that were previously associated with the \"incorrect source visit number\" are now associated with the \"correct target visit number.\"\r\n\r\nEach superior identifier associated with this visit identifier level should have the same value in the PID and MRG segments, or the MRG and PV1 segments, as appropriate.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.2, \"Merge,\" for a discussion of issues related to the implementation of merge messages.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other fields change, it is recommended that the A08 (update patient information) event be used in addition.","chapters":["CH_03"]},{"id":"ADT_A43","type":"Message","label":"ADT_A43 - Move patient information - patient identifier list","description":"A move has been done at the patient identifier list level. Identifier to be moved in the PID-3 - Patient Identifier List and MRG-1 - Prior Patient Identifier List will have the same value. The \"from\" (incorrect source patient ID) and \"to\" (correct target patient ID) identifiers have different values. See A43 examples in section 5. The identifiers involved in identifying the patient to be moved (MRG-1 - Prior Patient Identifier List) may or may not have accounts, which may or may not have visits. In any case, all subordinate data sets associated with the identifier in MRG-1 - Prior Patient Identifier List are moved along with the identifier, from the \"incorrect source patient ID\" to the \"correct target patient ID.\"\r\n\r\nNo identifiers subordinate to the identifier (account number, visit number, alternate visit ID) are valued in this message. Specification of these other subordinate identifiers is not required.\r\n\r\nThis event and the message syntax do, however, allow for the specification of a \"new identifier\" (PID-3 - Patient Identifier List), which may be application and/or implementation specific and therefore require site negotiation.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.3, \"Move,\" for a discussion of issues related to the implementation of move messages.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When demographic data in other fields change, it is recommended that the A08 (update patient information) event be used in conjunction with this message. However, all PID data associated with the \"correct target identifier\" (PID-3 - Patient Identifier List) are treated as updated information.","chapters":["CH_03"]},{"id":"ADT_A44","type":"Message","label":"ADT_A44 - Move account information - patient account number","description":"A move has been done at the account identifier level. That is, a PID-18 - Patient Account Number associated with one PID-3 - Patient Identifier List has been moved to another patient identifier list.\r\n\r\nAn A44 event is used to signal a move of records identified by the MRG-3 - Prior Patient Account Number from the \"incorrect source patient identifier list\" identified in the MRG segment (MRG-1 - Prior Patient Identifier List) to the \"correct target patient identifier list\" identified in the PID segment (PID-3 - Patient Identifier List).\r\n\r\nThe account number involved in identifying the account to be moved (MRG-3 - Prior Patient Account Number) may or may not have visits. In any case, all subordinate data sets associated with the account number in MRG-3 - Prior Patient Account Number are moved along with the account number, from the \"incorrect source\" ID (MRG-1 - Prior Patient Identifier List) to the \"correct target\" ID (PID-3 - Patient Identifier List).\r\n\r\nNo identifiers subordinate to the account number (visit number, alternate visit ID) are valued in this message.\r\n\r\nThis event and the message syntax do, however, allow for the specification of a \"new identifier\" (PID-18 - Patient Account Number), which may be application and/or implementation-specific and therefore require site negotiation.\r\n\r\nAll of the identifiers superior to the account number should be valued in both the MRG segment and the PID segment. In this message, the PID-3 - Patient Identifier List is superior to the account number.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.3, \"Move,\" for a discussion of issues related to the implementation of move messages.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When demographic data in other fields change, it is recommended that the A08 (update patient information) event be used in conjunction with this message. However, all PID data associated with the \"account number\" are treated as updated information.","chapters":["CH_03"]},{"id":"ADT_A45","type":"Message","label":"ADT_A45 - Move visit information - visit number","description":"A move has been done at the visit identifier level. That is, a PV1-19 - Visit Number or PV1-50 - Alternate Visit ID associated with one account identifier (PID-18 - Patient Account Number) has been moved to another account identifier.\r\n\r\nAn A45 event is used to signal a move of records identified by the MRG-5 - Prior Visit Number or the MRG-6 - Prior Alternate Visit ID from the \"incorrect source account identifier\" identified in the MRG segment (MRG-3 - Prior Patient Account Number) to the \"correct target account identifier\" identified in the PID segment (PID-18 - Patient Account Number).\r\n\r\nThis event and the message syntax do allow for the specification of \"new identifiers\" (PV1-19 - Visit Number, or PV1-50 - Alternate Visit ID), which may be application and/or implementation-specific and therefore require site negotiation.\r\n\r\nAll of the identifiers superior to the visit number or alternate visit ID should be valued in both the MRG segment and the PID segments. In this message, the account number and PID-3 - Patient Identifier List are superior to the visit number and alternate visit ID.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.3, \"Move,\" for a discussion of issues related to the implementation of move messages. The fields included when this message is sent should be the fields pertinent to communicate this event. When demographic data in other fields change, it is recommended that the A08 (update patient information) event be used in conjunction with this message. However, all PID data associated with the \"correct target visit ID\" are treated as updated information.","chapters":["CH_03"]},{"id":"ADT_A47","type":"Message","label":"ADT_A47 - Change patient identifier list","description":"A change has been done at the patient identifier list level. That is, a single PID-3 - patient identifier list value has been found to be incorrect and has been changed.\r\n\r\nAn A47 event is used to signal a change of an incorrectly assigned PID-3 - Patient Identifier List value. The \"incorrect source identifier\" value is stored in the MRG segment (MRG-1 - Prior Patient Identifier List) and is to be changed to the \"correct target patient ID\" value stored in the PID segment (PID-3 - Patient Identifier List).\r\n\r\nThe identifier involved in identifying the patient may or may not have accounts, which may or may not have visits. An A47 (change patient identifier list) event is intended for changing the value of the patient identifier list without affecting other subordinate identifiers. Any other subordinate identifiers that were previously associated with the \"incorrect source identifier\" are now associated with the \"correct target identifier.\" Specification of these other subordinate identifiers is not required.\r\n\r\nThis event and the message syntax do, however, allow for the specification of \"new subordinate identifiers\" (in addition to the PID-3 - Patient Identifier List identifier). For those environments that may require changes to these other subordinate identifiers because of this A47 (change patient identifier list) event, it is required that the old and new identifiers be a \"tightly coupled\" pair.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.4, \"Change identifier,\" for a discussion of issues related to the implementation of change messages.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When demographic data in other fields change, it is recommended that the A31 (update patient information) event be used in conjunction with this message.","chapters":["CH_03"]},{"id":"ADT_A49","type":"Message","label":"ADT_A49 - Change patient account number","description":"A change has been done at the account identifier level. That is, a PID-18 - patient account number has been found to be incorrect and has been changed.\r\n\r\nAn A49 event is used to signal a change of an incorrectly assigned account number value. The \"incorrect source account number\" value is stored in the MRG segment (MRG-3 - Prior Patient Account Number) and is to be changed to the \"correct target account number\" value stored in the PID segment (PID-18 - Patient Account Number).\r\n\r\nThe patient account identifier involved in identifying the account may or may not have visits. An A49 (change patient account number) event is intended for changing the value of the account identifier without affecting other subordinate identifiers. Any other subordinate identifiers that were previously associated with the \"incorrect source account number\" are now associated with the \"correct target account number\". Specification of these other subordinate identifiers is not required.\r\n\r\nThis event and the message syntax do, however, allow for the specification of \"new subordinate identifiers\" (in addition to the PID-18 - Patient Account Number Identifier). For those environments that may require changes to these other subordinate identifiers because of this A49 (change patient account number) event, it is required that the old and new identifiers be a \"tightly coupled\" pair.\r\n\r\nEach superior identifier associated with this account identifier level, i.e. the PID-3/MRG-1 should have the same value in both the PID and MRG segments.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.4, \"Change identifier,\" for a discussion of issues related to the implementation of change messages.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When demographic data in other fields change, it is recommended that the A08 (update patient information) event be used in conjunction with this message.","chapters":["CH_03"]},{"id":"ADT_A50","type":"Message","label":"ADT_A50 - Change visit number","description":"A change has been done at the visit identifier level. That is, a PV1-19 - Visit Number has been found to be incorrect and has been changed.\r\n\r\nAn A50 event is used to signal a change of an incorrectly assigned visit number value. The \"incorrect source visit number\" value is stored in the MRG segment (MRG-5 - Prior Visit Number) and is to be changed to the \"correct target visit number\" value stored in the PV1 segment (PV1-19 - Visit Number).\r\n\r\nEach superior identifier associated with this visit number identifier level, i.e. PID-3/MRG-1 and PID-18/MRG-3 should have the same value in both the PID and MRG segments.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.4, \"Change identifier,\" for a discussion of issues related to the implementation of change messages.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When demographic data in other fields change, it is recommended that the A08 (update patient information) event be used in conjunction with this message.","chapters":["CH_03"]},{"id":"ADT_A51","type":"Message","label":"ADT_A51 - Change alternate visit ID","description":"A change has been done at the alternate visit identifier level. That is, a PV1-50 - Alternate Visit ID has been found to be incorrect and has been changed.\r\n\r\nAn A51 event is used to signal a change of an incorrectly assigned alternate visit ID value. The \"incorrect source alternate visit ID\" value is stored in the MRG segment (MRG-6 - Prior Alternate Visit ID) and is to be changed to the \"correct target alternate visit ID\" value stored in the PV1 segment (PV1-50 - Alternate Visit ID).\r\n\r\nEach superior identifier associated with this alternate visit identifier level, i.e. PID-3/MRG-1 and PID-18/MRG-3 should have the same value in both the PID and MRG segments.\r\n\r\nSee sections 3.6.2, \"Merging patient/person information,\" and 3.6.2.1.4, \"Change identifier,\" for a discussion of issues related to the implementation of change messages.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When demographic data in other fields change, it is recommended that the A08 (update patient information) event be used in conjunction with this message.","chapters":["CH_03"]},{"id":"ADT_A52","type":"Message","label":"ADT_A52 - Cancel leave of absence for a patient","description":"The A52 event is sent when an A21 (patient goes on \"leave of absence\") event is cancelled, either because of erroneous entry of the A21 event or because of a decision not to put the patient on \"leave of absence\" after all.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nAs there is no specific field for the cancel LOA date/time, it is recommended field EVN-6 - Event Occurred contain the date/time the LOA was actually cancelled (but not necessarily recorded).","chapters":["CH_03"]},{"id":"ADT_A53","type":"Message","label":"ADT_A53 - Cancel patient returns from a leave of absence","description":"The A53 event is sent when an A22 (patient returns from \"leave of absence\") event is cancelled, either because of erroneous entry of the A22 event or because of a decision not to return the patient from \"leave of absence\" after all.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nAs there is no specific field for the cancel LOA date/time, it is recommended that field EVN-6 - Event Occurred contain the date/time the return from LOA was actually cancelled (but not necessarily recorded).\r\n\r\nPV2-47 - Expected LOA Return Date/Time is used to communicate the date/time the patient is expected to return from LOA.","chapters":["CH_03"]},{"id":"ADT_A54","type":"Message","label":"ADT_A54 - Change attending doctor","description":"An A54 event is issued as a result of a change in the attending doctor responsible for the treatment of a patient.\r\n\r\nWhen other important fields change, it is recommended that the A08 (update patient information) event be used in addition.\r\n\r\nThe new attending doctor of the patient should appear in the PV1-7 - Attending Doctor. For example, an A54 event can be used to notify the billing system that doctors' fees should be billed to the new doctor starting from the timestamp in the message.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments.\r\n\r\nTo communicate the begin and end date of the attending, referring, or admitting doctor, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/time in the ROL segment, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment. Use \"UP\" in ROL-2 - Action Code.","chapters":["CH_03"]},{"id":"ADT_A55","type":"Message","label":"ADT_A55 - Cancel change attending doctor","description":"The A55 event is sent when an A54 (change attending doctor) event is cancelled, either because of erroneous entry of the A54 event or because of a decision not to change the attending doctor after all. PV1-7 - Attending Doctor must contain the patient's doctor prior to the change of attending doctor.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event. When other important fields change, it is recommended that the A08 (update patient information) event be used in addition.","chapters":["CH_03"]},{"id":"ADT_A60","type":"Message","label":"ADT_A60 - Update allergy information","description":"This trigger event is used when person/patient allergy information has changed. It is used in conjunction with a new allergy segment, the IAM - Patient Allergy Information Segment-Unique Identifier, which supports Action code/unique identifier mode update for repeating segments as defined in 2.10.4, \"Protocol for interpreting repeating segments or segment groups in an update Message.\"","chapters":["CH_03"]},{"id":"ADT_A61","type":"Message","label":"ADT_A61 - Change consulting doctor","description":"An A61 event is used as a result of a change in the consulting physician(s) for the treatment of a patient.\r\n\r\nWhen other important fields change, it is recommended that the A08 (update patient information) event be used in addition. If the Patient Administration system allows demographics to change at the same time (for example an address change), two messages (an A61 followed by an A08) should be sent.\r\n\r\nThe new consulting doctor(s) of the patient should appear in the PV1-9 - Consulting Doctor and may appear in a role segment per new consulting physician.\r\n\r\nIf a consulting doctor stops being consulting doctor for this patient-visit, the end date/time can be sent in the ROL-6 - Role End Date/Time.\r\n\r\nFor example, an A61 event can be used to notify the billing system that doctors' fees for being a consulting doctor, should be billed to the new doctor(s) starting from the timestamp in the message.\r\n\r\nIt is recommended that field EVN-6 - Event Occurred contains the date/time the event actually occurred to the patient.\r\n\r\nThe ROL - Role Segment is used in this message to communicate providers not specified elsewhere. Person level providers with an ongoing relationship are reported in the ROL segment following the PID/PD1 segments. Providers corresponding to the PV1 data are reported in the ROL segment following the PV1/PV2 segments. Providers related to a specific procedure are reported in the ROL segment following the PR1 segment. Providers related to a specific insurance are reported in the ROL segment following the IN1/IN2/IN3 segments. To communicate the begin- and end-date of the provider, use the ROL-5 - Role Begin Date/Time and the ROL-6 - Role End Date/Time in the ROL segment, with the applicable ROL-3 - Role Code. Refer to Chapter 15 for the definition of the ROL segment.","chapters":["CH_03"]},{"id":"ADT_A62","type":"Message","label":"ADT_A62 - Cancel change consulting doctor","description":"The A62 event is sent when an A61 (change consulting doctor) event is cancelled, either because of erroneous entry of the A61 event or because of a decision not to change the consulting physician(s) after all.  PV1-9 - Consulting Doctor must show the patient's doctor prior to the change being cancelled.\r\n\r\nThe fields included when this message is sent should be the fields pertinent to communicate this event.  When other important fields change, it is recommended that the A08 (update patient information) event is used.","chapters":["CH_03"]},{"id":"BAR_P01","type":"Message","label":"BAR_P01 - Add patient accounts","description":"Data are sent from some application (usually a Registration or an ADT system, for example) to the patient accounting or financial system to establish an account for a patients billing/accounts receivable record. Many of the segments associated with this event are optional. This optionality allows those systems needing these fields to set up transactions that fulfill their requirements and yet satisfy the HL7 requirements.\r\n\r\nWhen an accounts start and end dates span a period greater than any particular visit, the P01 (add account) event should be used to transmit the opening of an account. The A01 (admit/visit notification) event can notify systems of the creation of an account as well as notify them of a patients arrival in the healthcare facility. In order to create a new account without notifying systems of a patients arrival, use the P01 trigger event.\r\n\r\nFrom Standard Version 2.3 onward, the P01 event should only be used to add a new account that did not exist before, not to update an existing account. The new P05 (update account) event should be used to update an existing account. The new P06 (end account) event should be used to close an account. With the P01 event, EVN-2 - Recorded Date/Time should contain the account start date.","chapters":["CH_06"]},{"id":"BAR_P02","type":"Message","label":"BAR_P02 - Purge patient accounts","description":"Generally, the elimination of all billing/accounts receivable records will be an internal function controlled, for example, by the patient accounting or financial system. However, on occasion, there will be a need to correct an account, or a series of accounts, that may require that a notice of account deletion be sent from another sub-system and processed, for example, by the patient accounting or financial system. Although a series of accounts may be purged within this one event, we recommend that only one PID segment be sent per event.","chapters":["CH_06"]},{"id":"BAR_P05","type":"Message","label":"BAR_P05 - Update account","description":"The P05 event is sent when an existing account is being updated. From version 2.3 onward, the P01 (add account) event should no longer be used for updating an existing account, but only for creating a new account. With the addition of P10 (transmit ambulatory payment classification [APC] groups) in version 2.4, it is expected that the P05 (update account) will be used to send inpatient coding information and the P10 (transmit ambulatory payment classification [APC] groups) will be used to send outpatient coding information.","chapters":["CH_06"]},{"id":"BAR_P06","type":"Message","label":"BAR_P06 - End account","description":"The P06 event is a notification that the account is no longer open, that is, no new charges can accrue to this account. This notification is not related to whether or not the account is paid in full. EVN-2 - Recorded Date/Time must contain the account end date.","chapters":["CH_06"]},{"id":"BAR_P10","type":"Message","label":"BAR_P10 - Transmit Ambulatory Payment  Classification(APC)","description":"The P10 event is used to communicate Ambulatory Payment Classification (APC) grouping. The grouping can be estimated or actual, based on the APC status indictor in GP1-1. This information is mandated in the USA by the Centers for Medicare and Medicaid Services (CMS) for reimbursement of outpatient services. The PID and PV1 segments are included for identification purposes onl","chapters":["CH_06"]},{"id":"BAR_P12","type":"Message","label":"BAR_P12 - Update Diagnosis/Procedure","description":"The P12 event is used to communicate diagnosis and/or procedures in update mode.  The newly created fields in DG1 and PR1, i.e., identifiers and action codes, must be populated to indicate which change should be applied.  When other patient or visit related fields change, use the A08 (update patient information) event.","chapters":["CH_06"]},{"id":"BPS_O29","type":"Message","label":"BPS_O29 - Blood product dispense status","description":"In the pre-transfusion processing of blood products, it is necessary for the transfusion service and the placer system to communicate information that is not included in the current HL7 order/observation model. Examples of pre-transfusion processing include performing a crossmatch test to ensure compatibility with the patient, or irradiation of the blood product due to a special transfusion requirement for the patient. The blood product dispense status messages need to contain additional information regarding the blood products requested, such as the Donation ID, product code, blood type, expiration date/time and current status of the blood product.\r\n\r\nIn the processing of commercial blood products, such as Rh Immune Globulin, Factor Concentrate, or Albumin Products, the status messages need to contain additional information, such as the lot number and manufacturer, expiration date and status of the commercial product.\r\n\r\nBlood product dispense status messages use the BPS and BRP messages as described below.","chapters":["CH_04"]},{"id":"BRP_O30","type":"Message","label":"BRP_O30 - Blood product dispense status acknowledgment","description":null,"chapters":["CH_04"]},{"id":"BRT_O32","type":"Message","label":"BRT_O32 - Blood product transfusion/disposition acknowledgment","description":null,"chapters":["CH_04"]},{"id":"BTS_O31","type":"Message","label":"BTS_O31 - Blood product transfusion/disposition","description":"Blood product transfusion/disposition messages use the BTS and BRT messages as described below.","chapters":["CH_04"]},{"id":"CCF_I22","type":"Message","label":"CCF_I22 - Collaborative Care Fetch / Collaborative Care Information","description":"This event triggers a query message to be sent from one healthcare provider to another healthcare provider, clinical repository or regulatory body regarding a specific patient. The Collaborative Care Fetch message must contain sufficient information for the healthcare provider, clinical repository or regulatory body to be able to identify the specific patient. The response to a Collaborative Care Fetch is a CCI - Collaborative Care Information message. The meaning of the Collaborative Care Query Information message is identical to the meaning of the Collaborative Care Message message.","chapters":["CH_11"]},{"id":"CCI_I22","type":"Message","label":"CCI_I22 - Collaborative Care Information","description":null,"chapters":["CH_11"]},{"id":"CCM_I21","type":"Message","label":"CCM_I21 - Collaborative Care Message","description":"This event triggers a message to be sent from one healthcare provider to another healthcare provider, clinical repository or regulatory body regarding a specific patient.  The collaborative care message may contain patient demographic information, a full history of appointments, specific medical procedures that have been performed, a full clinical history, an administrative history of patient visits, a full medication history, all relevant problems, pathways and goals. This message fulfills the role of a notification of a single patients health status and history.  It is usable for discharge summaries, disease notifications or just moving a patients electronic medical record from one the place to another.  This message uses the REL segment to express the relationships between clinical histories.","chapters":["CH_11"]},{"id":"CCQ_I19","type":"Message","label":"CCQ_I19 - Collaborative Care Query/Collaborative Care Query Update","description":"This event triggers a query message to be sent from a referring healthcare provider to a referred to healthcare provider, regarding a specific, previously sent collaborative care referral. The Collaborative Care Query message must contain sufficient data for the referred to provider to be able to identify the specific referral being queried. The response to a Collaborative Care Query message is a CQU - Collaborative Care Query Update message. The meaning of the Collaborative Care Query Update message is identical to the meaning of the Asynchronous Collaborative Care Update message.","chapters":["CH_11"]},{"id":"CCR_I16","type":"Message","label":"CCR_I16 - Collaborative Care Referral","description":"This event triggers a message to be sent from one healthcare provider to another regarding a specific patient or group of patients.  The intent is to create a collaborative relationship between the referring provider, the referred to provider or providers and the patient or patients, for the shared care of the patient or patients. Whilst the acknowledgment is a simple ACK message, the expectation is that the referred to provider(s) will send back a CCU  Asynchronous Collaborative Care Update at a later time to indicate acceptance or rejection of the referral.","chapters":["CH_11"]},{"id":"CCR_I17","type":"Message","label":"CCR_I17 - Modify Collaborative Care Referral","description":"This event triggers a message to be sent from one healthcare provider to another regarding changes to an existing Collaborative Care Referral. Changes may include additional instructions from the referring provider, additional clinical orders, additional clinical history, additional patient visits, additional medication history, or modifications to the problems, goals and/or pathways. Whilst the acknowledgment is a simple ACK message, the expectation is that the referred to provider(s) will send back a CCU  Asynchronous Collaborative Care Update at a later time to indicate acceptance or rejection of the modifications.","chapters":["CH_11"]},{"id":"CCR_I18","type":"Message","label":"CCR_I18 - Cancel Collaborative Care Referral","description":"This event triggers a message to be sent from one healthcare provider to another canceling an existing Collaborative Care Referral.  A previous Collaborative Care Referral may have been made in error, or perhaps the cancellation has come from the patient. Whilst the acknowledgment is a simple ACK message, the expectation is that the referred to provider(s) will send back a CCU  Asynchronous Collaborative Care Update at a later time to indicate cancellation of the Collaborative Care Referral.","chapters":["CH_11"]},{"id":"CCU_I20","type":"Message","label":"CCU_I20 - Asynchronous Collaborative Care Update","description":"This event triggers a message to be sent from a referred to healthcare provider to the referring health care provider, regarding a specific, previously received collaborative care referral. The collaborative care update may contain patient demographic information, additional appointments, additional clinical history, additional patient visits and additional medication history. It may also contain updates of patient problems, pathways and goal. The information is similar to that which may have been provided in the original Collaborate Care Referral message, but significantly different, as it is information from the perspective of the referred to provider. Patient visits will be those visits by the patient, to the referred to provider, relating to the referral. Appointments will be appointments made for the patient, by the referred to provider, during those visits. Clinical history will be observations made during those visits and medication history will be medications prescribed, observed or recommended during those visits. This message is used to update the referring provider as to the current status of the referral. The referrer would also use this message to update of the status of a referral, such as accepted, rejected, patient put on waiting list, treatment completed etc.","chapters":["CH_11"]},{"id":"CQU_I19","type":"Message","label":"CQU_I19 - Collaborative Care Referral","description":null,"chapters":["CH_11"]},{"id":"CRM_C01","type":"Message","label":"CRM_C01 - Register a patient on a clinical trial","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems. They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place.\r\n\r\nThe general acknowledgement message as defined in Chapter 2 should be used for any acknowledgements.","chapters":["CH_07"]},{"id":"CRM_C02","type":"Message","label":"CRM_C02 - Cancel a patient registration on clinical trial (for clerical mistakes onl","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems. They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place.\r\n\r\nThe general acknowledgement message as defined in Chapter 2 should be used for any acknowledgements.","chapters":["CH_07"]},{"id":"CRM_C03","type":"Message","label":"CRM_C03 - Correct/update registration information","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems. They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place.\r\n\r\nThe general acknowledgement message as defined in Chapter 2 should be used for any acknowledgements.","chapters":["CH_07"]},{"id":"CRM_C04","type":"Message","label":"CRM_C04 - Patient has gone off a clinical trial","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems. They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place.\r\n\r\nThe general acknowledgement message as defined in Chapter 2 should be used for any acknowledgements.","chapters":["CH_07"]},{"id":"CRM_C05","type":"Message","label":"CRM_C05 - Patient enters phase of clinical trial","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems. They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place.\r\n\r\nThe general acknowledgement message as defined in Chapter 2 should be used for any acknowledgements.","chapters":["CH_07"]},{"id":"CRM_C06","type":"Message","label":"CRM_C06 - Cancel patient entering a phase (clerical mistake)","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems. They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place.\r\n\r\nThe general acknowledgement message as defined in Chapter 2 should be used for any acknowledgements.","chapters":["CH_07"]},{"id":"CRM_C07","type":"Message","label":"CRM_C07 - Correct/update phase information","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems. They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place.\r\n\r\nThe general acknowledgement message as defined in Chapter 2 should be used for any acknowledgements.","chapters":["CH_07"]},{"id":"CRM_C08","type":"Message","label":"CRM_C08 - Patient has gone off phase of clinical trial","description":"The data are entered in a clinical trials or other patient data system and broadcast to other facility systems such as order entry, pharmacy, accounting, and nursing systems. They can be transmitted in batch mode or broadcast to outside-facility computer systems, including diagnostic and patient management systems. It is assumed that proper routing and security mechanisms are in place.\r\n\r\nThe general acknowledgement message as defined in Chapter 2 should be used for any acknowledgements.","chapters":["CH_07"]},{"id":"CSU_C09","type":"Message","label":"CSU_C09 - Automated time intervals for reporting, like monthly","description":"Data are entered in the clinical trials system or may reside in laboratory, pathology, radiology, pharmacy and/or other clinical applications. Most clinical trials data - clinical observations and study variables - will be communicated in OBR and OBX segments. The CSR, CSP, and CSS segments will identify the specific association these OBR and OBX have to the clinical trial. Data can be broadcast or transmitted in batch mode to study sponsors or the data management center for collaborative studies.\r\nThe general acknowledgement message as defined in Chapter 2 should be used for any acknowledgements.","chapters":["CH_07"]},{"id":"CSU_C10","type":"Message","label":"CSU_C10 - Patient completes the clinical trial","description":"Data are entered in the clinical trials system or may reside in laboratory, pathology, radiology, pharmacy and/or other clinical applications. Most clinical trials data - clinical observations and study variables - will be communicated in OBR and OBX segments. The CSR, CSP, and CSS segments will identify the specific association these OBR and OBX have to the clinical trial. Data can be broadcast or transmitted in batch mode to study sponsors or the data management center for collaborative studies.\r\n\r\nThe general acknowledgement message as defined in Chapter 2 should be used for any acknowledgements.","chapters":["CH_07"]},{"id":"CSU_C11","type":"Message","label":"CSU_C11 - Patient completes a phase of the clinical trial","description":"Data are entered in the clinical trials system or may reside in laboratory, pathology, radiology, pharmacy and/or other clinical applications. Most clinical trials data - clinical observations and study variables - will be communicated in OBR and OBX segments. The CSR, CSP, and CSS segments will identify the specific association these OBR and OBX have to the clinical trial. Data can be broadcast or transmitted in batch mode to study sponsors or the data management center for collaborative studies.\r\n\r\nThe general acknowledgement message as defined in Chapter 2 should be used for any acknowledgements.","chapters":["CH_07"]},{"id":"CSU_C12","type":"Message","label":"CSU_C12 - Update/correction of patient order/result information","description":"Data are entered in the clinical trials system or may reside in laboratory, pathology, radiology, pharmacy and/or other clinical applications. Most clinical trials data - clinical observations and study variables - will be communicated in OBR and OBX segments. The CSR, CSP, and CSS segments will identify the specific association these OBR and OBX have to the clinical trial. Data can be broadcast or transmitted in batch mode to study sponsors or the data management center for collaborative studies.\r\n\r\nThe general acknowledgement message as defined in Chapter 2 should be used for any acknowledgements.","chapters":["CH_07"]},{"id":"DFT_P03","type":"Message","label":"DFT_P03 - Post detail financial transaction","description":"The Detail Financial Transaction (DFT) message is used to describe a financial transaction transmitted between systems, that is, to the billing system for ancillary charges, ADT to billing system for patient deposits, etc.\r\n\r\nUse case for Post Detail Financial Transaction with related Order:\r\n\r\nThis information can originate in many ways. For instance, a detailed financial transaction for an ancillary charge is sent to a billing system that also tracks the transaction(s) in relation to their order via placer order number or wishes to post these transactions with the additional order information. Therefore a service reaches a state where a detailed financial transaction is created and interfaced to other systems along with optional associated order information. If the message contains multiple transactions for the same order, such as a test service and venipuncture charge on the same order, the ordering information is entered in the Order segment construct that precedes the FT1 segments. If a message contains multiple transactions for disparate orders for the same account each FT1 segment construct may contain the order related information specific to that transaction within the message.\r\n\r\nIf the common order information is sent, the Order Control Code should reflect the current state of the common order and is not intended to initiate any order related triggers on the receiving application. For example if observations are included along with common order information the order control code would indicate RE as observations to follow.\r\n\r\nIf common order information is sent related to the entire message or a specific financial transaction, the required Order Control Code should reflect the current state of the common order and is not intended to initiate any order related triggers on the receiving application. For example if observations are included along with common order information the order control code would indicate RE as observations to follow.\r\n\r\nIf order detail information is sent related to the entire message or a specific financial transaction, the required fields for that detail segment must accompany that information.\r\n\r\nNote: The ROL segment is optionally included after the PD1 to transmit information for patient level primary care providers, after the PV2 for additional information on the physicians whose information is sent there (i.e., Attending Doctor, Referring Doctor, Consulting Doctor), and within the insurance construct to transmit information for insurance level primary care providers.\r\n\r\nNote: There is an information overlap between the FT1, DG1 and PR1 segments. If diagnosis information is sent in an FT1 segment, it should be consistent with the information contained in any DG1 segments present within its hierarchy. Since the procedure code field within the FT1 does not repeat, if procedure information is sent on an FT1 it is recommended that the single occurrence of the code in FT1 equates to the primary procedure (PR1-14 - Procedure Priority code value 1).\r\n\r\nNote: The extra set of DG1/DRG/GT1/IN1/IN2/IN3/ROL segments added in V2.4 have been withdrawn as a technical correction","chapters":["CH_06"]},{"id":"DFT_P11","type":"Message","label":"DFT_P11 - Post Detail Financial Transactions - New","description":"The Detail Financial Transaction (DFT) - Expanded message is used to describe a financial transaction transmitted between systems, that is, to the billing system for ancillary charges, ADT to billing system for patient deposits, etc. It serves the same function as the Post Detail Financial Transactions (event P03) message, but also supports the use cases described below.\r\n\r\nUse case for adding the INx and GT1 segments inside the FT1 repetition:\r\n\r\nIf the insurance and/or the guarantor information is specific to a certain financial transaction of a patient and differs from the patient's regular insurance and/or guarantor, you may use the INx and GT1 segments related to the FT1 segment. If being used, the information supersedes the information on the patient level.\r\n\r\nExample: Before being employed by a company, a pre-employment physical is required. The cost of the examinations is paid by the company, and not by the persons private health insurance. One of the physicians examining the person is an eye doctor. For efficiency reasons, the person made an appointment for these examinations on the same day as he already had an appointment with his eye doctor in the same hospital. The costs for this eye doctor appointment are being paid by the patient's private health insurance. Both financial transactions for the same patient/person could be sent in the same message. To bill the examination for the future-employer to that organization, you need to use the GT1 segment that is related to the FT1.\r\n\r\nNote: The ROL segment is optionally included after the PD1 to transmit information for patient level primary care providers, after the PV2 for additional information on the physicians whose information is sent there (i.e., Attending Doctor, Referring Doctor, Consulting Doctor), and within the insurance construct to transmit information for insurance level primary care providers.\r\n\r\nNote: There is an information overlap between the FT1, DG1 and PR1 segments. If diagnosis information is sent in an FT1 segment, it should be consistent with the information contained in any DG1 segments present within its hierarchy. Since the procedure code field within the FT1 does not repeat, if procedure information is sent on an FT1 it is recommended that the single occurrence of the code in FT1 equates to the primary procedure (PR1-14 - Procedure Priority code value 1).","chapters":["CH_06"]},{"id":"EAC_U07","type":"Message","label":"EAC_U07 - Automated equipment command","description":"This message is used to send equipment commands from one application to another (e.g., a Laboratory Automation System to automated Equipment).","chapters":["CH_13"]},{"id":"EAN_U09","type":"Message","label":"EAN_U09 - Automated equipment notification","description":"This message is used to send equipment notifications from one application to another (e.g., alerts sent by automated equipment to a Laboratory Automation System).","chapters":["CH_13"]},{"id":"EAR_U08","type":"Message","label":"EAR_U08 - Automated equipment response","description":"This message is used to send equipment responses to previously issued commands from one application to another (e.g., automated Equipment to a Laboratory Automation System).","chapters":["CH_13"]},{"id":"EHC_E01","type":"Message","label":"EHC_E01 - Submit HealthCare Services Invoice","description":"This message is used to submit a HealthCare Services Invoice to a TPA/Payer for processing and payment. A HealthCare Services Invoice may have 1 or more Product/Service Line Items (detail lines), grouped as a Product/Service Group. Each Product/Service Line Item represents a specific fee item. Refer to the beginning of this section for more information on the structure of a HealthCare Services Invoice.\r\n\r\nThis message can be used to submit a HealthCare Services Invoice or to resubmit a previously submitted HealthCare Services Invoice (in case it was not properly acknowledged the first time that it was submitted). This message cannot be used to update an Invoice (e.g., add or cancel Product/Service Line Items) or cancel a HealthCare Services Invoice. To cancel a HealthCare Services Invoice, use the EHC^E02  Cancel HealthCare Services Invoice message. To update a HealthCare Services Invoice it must first be cancelled (see EHC^E02  Cancel HealthCare Services Invoice) and then resubmitted using this message with new Invoice numbers.\r\n\r\nThis message can also be used as a Pre-Determination message. This allows a Provider Application to submit a HealthCare Services Invoice to a Payer Application and run it through the Payer's edit and adjudication engine. The only difference between a Pre-Determination Invoice and a regular Invoice is the Payer will not pay the Pre-Determination Invoice. Setting the Invoice Control on IVC to \"PD\" identifies a Pre-Determination Invoice.\r\n\r\nNote that an EHC^E12  Request Additional Information (pending) is a valid response for an EHC^E01  Submit HealthCare Services Invoice.  In this case, the interactions would be EHC^E01 -> EHC^E12 (pending).","chapters":["CH_16"]},{"id":"EHC_E02","type":"Message","label":"EHC_E02 - Cancel HealthCare Services Invoice","description":"This message is used to cancel one HealthCare Services Invoices or one Product/Service Group in an Invoice or one Product/Service Line Item in an Invoice that have previously been submitted to a TPA/Payer for processing and payment.  Invoice Control codes are used to indicate the specific action being requested of the Payer (CN for Cancel Invoice, CG for Cancel Product/Service Group and CI for Cancel Product/Service Line Item). An Invoice that is cancelled must be marked as cancel only and not purged from the Payer Application's database. \r\n\r\nThe Payer may/may not be able to cancel the Invoice/Product/Service Line Item, and will indicate processing results in the response message. In some situations, the Payer has already paid the Product/Service Line Item, and therefore will hold a debit amount for the Payee until subsequent billing from the Payee utilizes the debit amount.\r\n\r\nThis message cannot be used to cancel or remove ancillary information for an Invoice and/or Product/Service Line Item such as Authorization or Contact information or any referenced health documents.","chapters":["CH_16"]},{"id":"EHC_E04","type":"Message","label":"EHC_E04 - Re-Assess HealthCare Services Invoice Request","description":"This message is used to submit a single Re-Assess HealthCare Services Invoice Request to a TPA/Payer for processing. The Re-Assess HealthCare Services Invoice Request is used by a Provider, to request review of a previously adjudicated HealthCare Services Invoice, with optional specification of a Product/Service Line Item within that Invoice. Note that the HealthCare Services Invoice need not necessarily be sent to a TPA/Payer using the EHC^E01  Submit HealthCare Services Invoice: it may be manually submitted.\r\n\r\nAdjudication for a HealthCare Services Invoice may be re-assessed either because background information, such as a Provider's billing rate may have changed or if some of the adjudication rules have changed since original adjudication of the Invoice.\r\n\r\nThis message cannot be used to change or delete information from the HealthCare Services Invoice. The only information allowed in this message are Provider Invoice Number and Payer Invoice Number, and optional notes to assist in the re-assessment by the TPA/Payer.","chapters":["CH_16"]},{"id":"EHC_E10","type":"Message","label":"EHC_E10 - Edit/Adjudication Results","description":"This message is used to send edit and/or adjudication results for a HealthCare Services Invoice. Edit/Adjudication results are sent to the same Network Application ID that originated the Invoice, which was specified as the Sending Application on MSH on the original HealthCare Services Invoice.\r\n\r\nThis message is returned to a Provider Application each time an EHC^E01  Submit HealthCare Services Invoice message is successfully processed by a Payer Application. As a minimum, the EHC^E10  Edit/Adjudication Results message will contain the Payer Applications' Invoice number (Payer Invoice Number on IVC), status codes for each Product/Service Line Item in the Invoice and optionally, a tracking number for the Payer Application (Payer Tracking Number on PSL).\r\n\r\nNote that an EHC^E12  Request Additional Information (pending) is a valid response for an EHC^E01  Submit HealthCare Services Invoice.  In this case, the interactions would be EHC^E01 -> EHC^E12 (pending).  If the Payer Application is able to process the Invoice on-line, the EHC^E10  Edit/Adjudication Results message will contain the Invoice Processing Results portion completely filled out, indicating the results of the adjudication (e.g., paid as submitted, paid partial, etc.).","chapters":["CH_16"]},{"id":"EHC_E12","type":"Message","label":"EHC_E12 - Request Additional Information","description":"A Payer or TPA uses this message to request additional information in support of an Invoice or a (Pre) Authorization Request.  Normally, this request would be sent following receipt of an E01 or E20 message.  However, it can also be sent following receipt of an E04 Re-Assess HealthCare Services Invoice Request.  In this latter case the request for additional information still has as its object the original invoice (which is now under review) rather than the Re-assessment request per se.\r\n\r\nThe E12 can only be used to initiate a request for information and cannot be used to modify, place on hold or cancel an earlier request.  This message cannot be used to convey information on the status of a claim and/or adjudication results (i.e., cannot be used in place of an E10 Edit/Adjudication Results message).\r\n\r\nThe scope of the request for additional information is defined through the inclusion of contextual data from the original Invoice or (Pre) Authorization Request.  By specifying a particular Product/Service Group, patient and/or Product/Service Line item the requested information (e.g., a discharge narrative) is deemed to apply to those particular service events and not to any others which may have been part of the original Invoice or (Pre) Authorization Request.\r\n\r\nIn terms of absolute limits the E12 request is restricted to a single Product/Service Group from the original Invoice or (Pre) Authorization Request.   Thereafter, the context can be more narrowly defined by inclusion of patient and/or Product/Service Line item information from within the same Product/Service Group. Thus, if a particular P/S Line Item is included, the message recipient must interpret this to mean that the request is related to that one line item.  If the P/S Line Item is excluded the request is related to any and all line items in the original Product/Service Group.  Similarly for patients: identification of a particular patient restricts the request to that patient alone, whereas omission of patient information means that the request applies to any and all patients identified in the original Product/Service Group.\r\n\r\nThe E12 message is restricted to zero or one patients and to zero or one Product/Service Line items.  One consequence of these limits is that a Payer requiring information about a variety of patients or products/services from an original invoice may have to generate multiple (E12) requests. \r\n\r\nThe E12 message requires the use of LOINC classification standard to describe the information being requested (as do the E13/14 response messages).  The codified request can also be supplemented by free-form text if greater specificity is required.\r\n\r\nThis message supports the use of pre-defined responses.  That is, the sender specifies both the request as well as a range of possible answers for the recipient to choose from.  This is an optional usage that is designed for real-time environments in which the Payer employs an adjudication engine to both solicit the additional information and manage the responses.","chapters":["CH_16"]},{"id":"EHC_E13","type":"Message","label":"EHC_E13 - Additional Information Response","description":"This message is used by a Provider to immediately respond to an EHC_E12 Request for Additional Information, in other words an automated response.  The EHC_E13 message cannot be sent unsolicited.","chapters":["CH_16"]},{"id":"EHC_E15","type":"Message","label":"EHC_E15 - Payment/Remittance Advice","description":"This message is used to send a payment/ remittance advice to a Payee for the payment of HealthCare Services Invoices and/or other adjustments.   The Payment/Remittance Advice can be sent to the originating Provider Application (Network Application ID) or alternately to the Payee's Network Application ID, depending on how the Payee has been configured by the Payer. If a Payment/Remittance Advice is paid by check, it typically has a 1 to 1 correspondence with a check number. However, there are occasions when one check number covers multiple Payment/Remittance Advices. This message does not enforce a 1 to 1 relationship between check number and Payment/Remittance Advice. That is, the same check number (Check Number on PMT) can be used on multiple Payment/Remittance Advices.\r\n\r\nA Payment/Remittance Advice may not be generated if a Payee is a Person and not an organization (Payee Type on PYE = \"PERS\" or \"PPER\").\r\n\r\nOnce an EHC^E15 message is prepared (which may be on a regular basis such as monthly or bi-weekly), it is either sent to the Provider Application (if the Provider Application is able to receive unsolicited results) or stored on a queue for the Provider Application. If left on a queue for the Provider Application, then the QBP^E99 message must be used by the Provider Application to poll the Payer Application for the EHC^E15.","chapters":["CH_16"]},{"id":"EHC_E20","type":"Message","label":"EHC_E20 - Submit Authorization Request","description":"This message is used to submit a single Authorization Request to a TPA/Payer for authorization (for payment). An Authorization Request is made for one or more patients and may include 1 or more Product/Service Line Items (detail lines), each of which represents a specific, billable item or Payer allowed Treatment Plan. \r\n\r\nIf the Authorization is approved, then the Payer Application will return either an Authorization Number (Authorization Identifier on AUT) or individual who has authorized the Authorization Request (Name of Authorizer on AUT). The Authorization Number is not the same number as the Authorization Request Number; the latter indicates the number used to identify the request for authorization. The presence of the AUT segment in the EHC^E24  Authorization Request Response message implies authorization. However, the Authorization may be restricted, which is described as Payer Adjustments.\r\n\r\nThis message can be used to submit an Authorization Request or to resubmit an Authorization Request (in case it was not properly acknowledged the first time that it was submitted). This message cannot be used to update an Authorization Request (e.g., add or cancel Product/Service Line Items) or cancel an Authorization Request. To cancel an Authorization Request, use the EHC^E21  Cancel Authorization Request message. To update an Authorization it must first be cancelled (see EHC^E21  Cancel Authorization Request) and then resubmitted using this message with new Provider control numbers. ","chapters":["CH_16"]},{"id":"EHC_E21","type":"Message","label":"EHC_E21 - Cancel Authorization Request","description":"This message is used to cancel an Authorization Request, as a result of a previously submitted EHC^E20  Submit Authorization Request message.\r\n\r\nThis message can be used to cancel the entire Authorization Request, or an individual Product/Service Line Item within an Authorization Request.\r\n\r\nThis message cannot be used to update ancillary information in an Authorization that has been submitted to a Payer. The original request must be cancelled, and a new Authorization Request submitted to the Payer.","chapters":["CH_16"]},{"id":"EHC_E24","type":"Message","label":"EHC_E24 - Authorization Response","description":"This message is used to send results of an Authorization Request to a Provider Application. Authorization results are sent to the same Network Application ID that originated the Authorization Request, which was specified as the Sending Application on MSH on the original Authorization Request.","chapters":["CH_16"]},{"id":"ESR_U02","type":"Message","label":"ESR_U02 - Automated equipment status request","description":"This message is used to request information about a device's or piece of equipment's status from one application to another (e.g., Laboratory Automation System to automated equipment). The equipment identified in the EQU segment should respond with its status using the \"Automated Equipment Status Update.\"","chapters":["CH_13"]},{"id":"ESU_U01","type":"Message","label":"ESU_U01 - Automated equipment status update","description":"This message is used to send information about the status of a device or equipment from one application to another (e.g., automated device to a Laboratory Automation System). The status update can be sent unsolicited or as a response to the trigger \"Automated Equipment Status Request.\"","chapters":["CH_13"]},{"id":"INR_U06","type":"Message","label":"INR_U06 - Automated equipment inventory request","description":"This message is used to request information about inventory items from one application to another (e.g., Laboratory Automation System to automated equipment). The equipment specified in the EQU segment should respond with the information about inventory item requested in the INV segment (or all items).","chapters":["CH_13"]},{"id":"INU_U05","type":"Message","label":"INU_U05 - Automated equipment inventory update","description":"This message is used to send information about inventory items from one application to another (e.g., automated Equipment to a Laboratory Automation System).","chapters":["CH_13"]},{"id":"LSR_U13","type":"Message","label":"LSR_U13 - Automated equipment log/service request","description":"This message is used to request log and/or service events from one application to another (e.g., Laboratory Automation System to automated equipment).","chapters":["CH_13"]},{"id":"LSU_U12","type":"Message","label":"LSU_U12 - Automated equipment log/service update","description":"This message is used to send log and/or service events from one application to another (e.g., automated equipment to Laboratory Automation System).","chapters":["CH_13"]},{"id":"MDM_T01","type":"Message","label":"MDM_T01 - Original document notification","description":"This is a notification of the creation of a document without the accompanying content.  There are multiple approaches by which systems become aware of documents:\r\n\r\nScenario A: A document is dictated and chart tracking system is notified that it has been dictated and is awaiting transcription. \r\n\r\nScenario B: Dictation is transcribed and chart tracking system is notified that the document exists and requires authentication. \r\n\r\nScenario C: A provider orders a series of three X-rays.  The radiologist dictates a single document which covers all three orders.  Multiple placer numbers are used to identify each of these orders.","chapters":["CH_09"]},{"id":"MDM_T02","type":"Message","label":"MDM_T02 - Original document notification and content","description":"This is a notification of the creation of a document with the accompanying content.\r\n\r\nScenario A: Dictation is transcribed and the chart tracking system is notified that the document exists and requires authentication.  The content of the document is transmitted along with the notification.  \r\n\r\nScenario B: A provider orders a series of three X-rays.  The radiologists dictation is transcribed in a single document, which covers all three orders.  Multiple placer numbers are used to identify each of the orders within the single document message.  The notification and document content are transmitted.","chapters":["CH_09"]},{"id":"MDM_T03","type":"Message","label":"MDM_T03 - Document status change notification","description":"This is a notification of a change in a status of a document without the accompanying content. \r\n\r\nScenario: A document is authenticated.  Notification is sent to the chart tracking system and is used to update the document status from pre-authenticated to authenticated or legally authenticated.\r\n\r\nA change in any of the following independent status characteristics would cause a message to be sent:\r\n- Completion Status \r\n- Confidentiality Status\r\n- Availability Status (the Availability Status of cancelled is supported in T11 (document cancel notification) or T03)\r\n- Storage Status","chapters":["CH_09"]},{"id":"MDM_T04","type":"Message","label":"MDM_T04 - Document status change notification and content","description":"This is a notification of a change in a status of a document with the accompanying content. \r\n\r\nScenario: A document is authenticated.  Notification is sent to the chart tracking system and is used to update the document status from pre-authenticated to authenticated or legally authenticated.  The document content is also transmitted.","chapters":["CH_09"]},{"id":"MDM_T05","type":"Message","label":"MDM_T05 - Document addendum notification","description":"This is a notification of an addendum to a document without the accompanying content. \r\n\r\nScenario:  Author dictates additional information as an addendum to a previously transcribed document.  A new document is transcribed.  This addendum has its own new unique document ID that is linked to the original document via the parent ID.  Addendum document notification is transmitted.  This creates a composite document.","chapters":["CH_09"]},{"id":"MDM_T06","type":"Message","label":"MDM_T06 - Document addendum notification and content","description":"This is a notification of an addendum to a document with the accompanying content. \r\n\r\nScenario:  Author dictates additional information as an addendum to a previously transcribed document.  A new document is transcribed.  This addendum has its own new unique document ID that is linked to the original document via the parent ID.  Addendum document notification is transmitted, along with the document content.  This creates a composite document.","chapters":["CH_09"]},{"id":"MDM_T07","type":"Message","label":"MDM_T07 - Document edit notification","description":"Note:  The only valid use of this trigger event is for documents whose availability status is Unavailable, i.e., the document has not been made available for patient care.\r\n\r\nThis is a notification of an edit to a document without the accompanying content. \r\n\r\nScenario:  Errors, which need to be corrected, are discovered in a document.  The original document is edited, and an edit notification is sent.","chapters":["CH_09"]},{"id":"MDM_T08","type":"Message","label":"MDM_T08 - Document edit notification and content","description":"Note:  The only valid use of this trigger event is for documents whose availability status is \"Unavailable,\" i.e., the document has not been made available for patient care.\r\n\r\nThis is a notification of an edit to a document with the accompanying content. \r\n\r\nScenario:   Errors, which need to be corrected, are discovered in a document.  The original document is edited, and an edit notification and document content are sent.","chapters":["CH_09"]},{"id":"MDM_T09","type":"Message","label":"MDM_T09 - Document replacement notification","description":"Note:  This trigger event is generally used when the original document availability status is Available.\r\n\r\nThis is a notification of replacement to a document without the accompanying content. \r\n\r\nScenario:  Errors discovered in a document are corrected.  The original document is replaced with the revised document.  The replacement document has its own new unique document ID that is linked to the original document via the parent ID.  The availability status of the original document is changed to Obsolete but the original document should be retained in the system for historical reference.  Document replacement notification is sent.","chapters":["CH_09"]},{"id":"MDM_T10","type":"Message","label":"MDM_T10 - Document replacement notification and content","description":"Scenario:   Errors discovered in a document are corrected.  The original document is replaced with the revised document.  The replacement document has its own new unique document ID that is linked to the original document via the parent ID.  The availability status of the original document is changed to Obsolete but the original document should be retained in the system for historical reference.  Document replacement notification and document content are sent.","chapters":["CH_09"]},{"id":"MDM_T11","type":"Message","label":"MDM_T11 - Document cancel notification","description":"This is a notification of a cancellation of a document.   This trigger event should be used only for an original document with an availability status of Unavailable.  When a document has been made available for patient care, the process should be to replace the original document, which then becomes obsolete.  The replacement document describes why the erroneous information exists.\r\n\r\nScenario:  When the author dictated a document, the wrong patient identification was given, and the document was transcribed and sent to the wrong patients record.  When the error is discovered, a cancellation notice is sent to remove the document from general access in the wrong patients record. In these cases, a reason should be supplied in the cancellation message.  To protect patient privacy, the correct patients identifying information should not be placed on the erroneous document that is retained in the wrong patients record for historical reference.  A new document notification and content will be created using a T02 (original document notification and content) event and sent for association with the correct patients record.","chapters":["CH_09"]},{"id":"MFK_M02","type":"Message","label":"MFK_M02 - Staff/Practitioner Master File Application Acknowledgment","description":"The staff identification (STF), practitioner detail (PRA), practitioner organization unit segment (ORG), professional affiliation (AFF), language detail (LAN), educational detail (EDU), and certificate detail (CER) segments can be used to transmit master files information between systems. The STF segment provides general information about personnel; the PRA, ORG, AFF, LAN, EDU, CER and NTE segments provide detailed information for a staff member.  ","chapters":["CH_08"]},{"id":"MFK_M04","type":"Message","label":"MFK_M04 - Charge Description Master File Application Acknowledgment","description":"The charge description (CDM) master file segment should be used in conjunction with the general master file segments.  Interfacing systems often need not only to communicate data about a patient's detailed charges, but also to communicate the charge identification entries by which an application knows how to handle a particular charge code.  The charge description master is a master file.  The CDM segment below is a specially designed master file segment for interfacing charge description masters.  In the following message, the MFI-master file identifier should equal \"CDM.\"  When the CDM segment is used in an MFN message, the abstract definition is as follows.","chapters":["CH_08"]},{"id":"MFK_M05","type":"Message","label":"MFK_M05 - Patient Location Master File Application Acknowledgment","description":"This section is specifically concerned with describing a master file message that should be used to transmit information which identifies the inventory of healthcare patient locations, such as nursing units, rooms, beds, clinics, exam rooms, etc.  In a network environment, this segment can be used to define patient locations to other applications.  The segment also includes the readiness states and support locations for the patient locations.","chapters":["CH_08"]},{"id":"MFK_M06","type":"Message","label":"MFK_M06 - Clinical Study with Phases and Schedules Master File Application Acknowledgment","description":"MFK message for Clinical Study with phases and schedules","chapters":["CH_08"]},{"id":"MFK_M07","type":"Message","label":"MFK_M07 - Clinical Study without Phases but with Schedules Master File Application Acknowledgment","description":"MFK message for Clinical Study without phases but with schedules","chapters":["CH_08"]},{"id":"MFK_M08","type":"Message","label":"MFK_M08 - Test/Observation (Numeric) Master File Application Acknowledgment","description":null,"chapters":["CH_08"]},{"id":"MFK_M09","type":"Message","label":"MFK_M09 - Test/Observation (Categorical) Master File Application Acknowledgment","description":null,"chapters":["CH_08"]},{"id":"MFK_M10","type":"Message","label":"MFK_M10 - Test/Observation Batteries Master File Application Acknowledgment","description":null,"chapters":["CH_08"]},{"id":"MFK_M11","type":"Message","label":"MFK_M11 - Test/Calculated Observations Master File Application Acknowledgment","description":null,"chapters":["CH_08"]},{"id":"MFK_M12","type":"Message","label":"MFK_M12 - Additional Basic Observation/Service Attributes Master File Application Acknowledgment","description":null,"chapters":["CH_08"]},{"id":"MFK_M13","type":"Message","label":"MFK_M13 - General Master File Application Acknowledgment","description":"The MFN General master file notification transaction is used where the master file is a simple one that contains only a key and the text value of that key.  Both values are carried in MFE-4 - Primary Key Value - MFE.  The specific master file being updated is identified by MFI-1 - Master File Identifier and MFI-2 - Master Files Application Identifier.\r\n\r\nThe MFA segment carries acknowledgment information for the corresponding MFE segment (identified by MFA-5 - Primary Key Value - MFA).  Fields MFE-4 - Primary Key Value - MFE and MFA-5 - Primary Key Value - MFA provide the link between the corresponding segments.","chapters":["CH_08"]},{"id":"MFK_M14","type":"Message","label":"MFK_M14 - Site Defined Master File Application Acknowledgment","description":"The MFN Site defined master file notification transaction is used where the master file is not a simple one (as defined for MFN^M13) and is not a transaction type currently defined by HL7, but rather requires one or more HL7 and/or 'Z' segments to carry the master file information.\r\n\r\nThe master file record identified by the MFE segment is contained in Z-segments immediately following the MFE segment, and is denoted by \"...\" in the MFN abstract message definition given above.  This record may be either a flat record contained in a single segment, or a complex record needing more than a single segment to carry its data and (usually hierarchical) structure.\r\n\r\nThe definition of this transaction and the associated abstract message structure code (as defined in MSH-9 - Message Type, denoted by MFN_Znn above) are subject to site negotiation.  Refer to Chapter 2, section 2.17, \"Local Extension\" for additional information on 'Z' abstract message structure code definition.","chapters":["CH_08"]},{"id":"MFK_M15","type":"Message","label":"MFK_M15 - Inventory Item Master File Application Acknowledgment","description":"This section is concerned with describing a master file message that should be used to communicate information that relates to the inventory of items that can be used to perform an ordered service.  While an order specifies a service that is represented in an Other Observation/Service Item master file, this message is concerned with communicating attributes of those orderable items (for example lot number and expiration date) that are represented in the Other Observation/Service Item master file.  These attributes are more granular than can be represented in the Other Observation/Service Item master file as there may be multiple items in inventory that meet the characteristics of the Service Item but have different specific characteristics, e.g., multiple lots of a vaccine.","chapters":["CH_08"]},{"id":"MFK_M16","type":"Message","label":"MFK_M16 - Enhanced Inventory Item Master File Application Acknowledgment","description":"This section describes a master file message designed to communicate information that relates to the sharing of material item master catalog and material item-inventory information between materials management systems and other systems such as surgical and immunization systems.  The synchronization of the \"item master\" between systems and across the enterprise enables the success of the subsequent interfacing of transactions such as: material item requisitions (pre and post case), accounts payable invoices for the payment of material items, journal entries generated from the issue of items to departments or other inventory locations, and patient charges that allow a customer to improve patient care through the better management of materials.  To face budget challenges, healthcare organizations need materials management systems that integrate with finance to automate logistics, eliminate paperwork and analyze data to improve efficiency and reduce overall costs.  This process is a major contributor to improving the customers' bottom line by helping to eliminate materials waste, streamline ordering, ensure accurate payment of materials purchased, ensure accurate billing for materials used, and an accurate presentation of the financial statements of a healthcare facility.","chapters":["CH_08"]},{"id":"MFK_M17","type":"Message","label":"MFK_M17 - DRG Master File Application Acknowledgment","description":"This section is specifically concerned with describing a master file message that should be used to transmit information which identifies the DRG basic information, such as relative weight, lower and upper trim points, etc.","chapters":["CH_08"]},{"id":"MFN_M02","type":"Message","label":"MFN_M02 - Master file - staff practitioner","description":"The staff identification (STF), practitioner detail (PRA), practitioner organization unit segment (ORG), professional affiliation (AFF), language detail (LAN), educational detail (EDU), and certificate detail (CER) segments can be used to transmit master files information between systems. The STF segment provides general information about personnel; the PRA, ORG, AFF, LAN, EDU, CER and NTE segments provide detailed information for a staff member","chapters":["CH_08"]},{"id":"MFN_M04","type":"Message","label":"MFN_M04 - Master files charge description","description":"The charge description (CDM) master file segment should be used in conjunction with the general master file segments in Section 8.5, \"GENERAL MASTER FILE SEGMENTS.\" Interfacing systems often need not only to communicate data about a patient's detailed charges, but also to communicate the charge identification entries by which an application knows how to handle a particular charge code. The charge description master is a master file. The CDM segment below is a specially designed master file segment for interfacing charge description masters. In the following message, the MFI-master file identifier should equal \"CDM.\"","chapters":["CH_08"]},{"id":"MFN_M05","type":"Message","label":"MFN_M05 - Patient location master file","description":"This section is specifically concerned with describing a master file message that should be used to transmit information which identifies the inventory of healthcare patient locations, such as nursing units, rooms, beds, clinics, exam rooms, etc. In a network environment, this segment can be used to define patient locations to other applications. The segment also includes the readiness states and support locations for the patient locations.\r\nThe LOC, LCH, LRL, LDP, and LCC segments must be preceded by the MFI and MFE segments, as described in Section 8.5, \"GENERAL MASTER FILE SEGMENTS.\"","chapters":["CH_08"]},{"id":"MFN_M06","type":"Message","label":"MFN_M06 - Clinical study with phases and schedules master file","description":"The CM0 (Clinical Study Master), CM1 (Clinical Study Phase), and CM2 (Clinical Study Schedule) segments can be used to transmit master files information between systems. The CM0 segment contains the information about the study itself; the CM1 contains the information about one phase of the study identified in the preceding CM0; and the CM2 contains the information about the scheduled time points for the preceding study or phase-related treatment or evaluation events. When these segments are used in an MFN message, the abstract definition is described below.\r\nCase 1: MFN message for Clinical Study with phases and schedules","chapters":["CH_08"]},{"id":"MFN_M07","type":"Message","label":"MFN_M07 - Clinical study without phases but with schedules master file","description":"The CM0 (Clinical Study Master), CM1 (Clinical Study Phase), and CM2 (Clinical Study Schedule) segments can be used to transmit master files information between systems. The CM0 segment contains the information about the study itself; the CM1 contains the information about one phase of the study identified in the preceding CM0; and the CM2 contains the information about the scheduled time points for the preceding study or phase-related treatment or evaluation events. When these segments are used in an MFN message, the abstract definition is described below.\r\nCase 2: MFN message for Clinical Study without phases but with schedules","chapters":["CH_08"]},{"id":"MFN_M08","type":"Message","label":"MFN_M08 - Test/observation (numeric) master file","description":"Note: The MFK message is used for an application acknowledgment in either the original or enhanced acknowledgment modes.\r\nNote: MFI-1 - Master File Identifier = OMA for numeric observations.\r\nNote: A service/test/observation definition may have both an OM2 (numeric) and OM3 (categorical) segment included in case the value may be either numeric and/or categorical.","chapters":["CH_08"]},{"id":"MFN_M09","type":"Message","label":"MFN_M09 - Test/observation (categorical) master file","description":"Note: The MFK message is used for an application acknowledgment in either the original or enhanced acknowledgment modes.\r\nNote: MFI-1 - Master File Identifier = OMB for categorical observations.","chapters":["CH_08"]},{"id":"MFN_M10","type":"Message","label":"MFN_M10 - Test /observation batteries master file","description":"Note: The MFK message is used for an application acknowledgment in either the original or enhanced acknowledgment modes.\r\nNote: MFI-1 - Master File Identifier = OMC for observation batteries.","chapters":["CH_08"]},{"id":"MFN_M11","type":"Message","label":"MFN_M11 - Test/calculated observations master file","description":"Note: The MFK message is used for an application acknowledgment in either the original or enhanced acknowledgment modes.\r\nNote: MFI-1 - Master File Identifier = OMD for calculated observations.","chapters":["CH_08"]},{"id":"MFN_M12","type":"Message","label":"MFN_M12 - Master file notification message","description":"Note: The MFK message is used for an application acknowledgment in either the original or enhanced acknowledgment modes.\r\nNote: MFI-1 - Master File Identifier = OME for additional basic observation/service attributes.","chapters":["CH_08"]},{"id":"MFN_M13","type":"Message","label":"MFN_M13 - Master file notification - general","description":"The MFN General master file notification transaction is used where the master file is a simple one that contains only a key and the text value of that key. Both values are carried in MFE-4 - Primary Key Value - MFE. The specific master file being updated is identified by MFI-1 - Master File Identifier and MFI-2 - Master Files Application Identifier.","chapters":["CH_08"]},{"id":"MFN_M14","type":"Message","label":"MFN_M14 - Master file notification - site defined","description":"The MFN Site defined master file notification transaction is used where the master file is not a simple one (as defined for MFN^M13) and is not a transaction type currently defined by HL7, but rather requires one or more HL7 and/or 'Z' segments to carry the master file information","chapters":["CH_08"]},{"id":"MFN_M15","type":"Message","label":"MFN_M15 - Inventory item master file notification","description":"This section is concerned with describing a master file message that should be used to communicate information that relates to the inventory of items that can be used to perform an ordered service. While an order specifies a service that is represented in an Other Observation/Service Item master file, this message is concerned with communicating attributes of those orderable items (for example lot number and expiration date) that are represented in the Other Observation/Service Item master file. These attributes are more granular than can be represented in the Other Observation/Service Item master file as there may be multiple items in inventory that meet the characteristics of the Service Item but have different specific characteristics, e.g., multiple lots of a vaccine.\r\nEach MFE/IIM structure describes a specific set of lot, expiration date, location, etc. for a Service Item. Multiple instances of MFE/IIM could be used to describe the same Service Item lot at multiple locations, or a location with multiple lots of the same Service Item.\r\nThis message is not intended to act as a complete inventory management system. Various inventory management concepts, e.g., PAR levels, invoice and purchase order tracking, are intentionally not supported. The message is intended to synchronize limited orderable item attributes, e.g., quantity on hand, lot number, expiration date, between communicating systems. Such systems may include a Pharmacy Application and a Nurse-based dispensing system. While the Pharmacy application may define the service items (communicated in [MFN^M12^MFN_12] Other Observation/Service Item master file Messages), the dispensing system would communicate the lot numbers, expiration date and quantity on hand for service items in inventory using the Inventory Item Master file message","chapters":["CH_08"]},{"id":"MFN_M16","type":"Message","label":"MFN_M16 - Master File Notification Inventory Item Enhanced","description":"This section describes a master file message designed to communicate information that relates to the sharing of material item master catalog and material item-inventory information between materials management systems and other systems such as surgical and immunization systems. The synchronization of the \"item master\" between systems and across the enterprise enables the success of the subsequent interfacing of transactions such as: material item requisitions (pre and post case), accounts payable invoices for the payment of material items, journal entries generated from the issue of items to departments or other inventory locations, and patient charges that allow a customer to improve patient care through the better management of materials. To face budget challenges, healthcare organizations need materials management systems that integrate with finance to automate logistics, eliminate paperwork and analyze data to improve efficiency and reduce overall costs. This process is a major contributor to improving the customers' bottom line by helping to eliminate materials waste, streamline ordering, ensure accurate payment of materials purchased, ensure accurate billing for materials used, and an accurate presentation of the financial statements of a healthcare facility.\r\nMaterial items defined in this message include consumable supplies, devices, surgical sets, and implants.","chapters":["CH_08"]},{"id":"MFN_M17","type":"Message","label":"MFN_M17 - DRG Master File Message","description":"This section is specifically concerned with describing a master file message that should be used to transmit information which identifies the DRG basic information, such as relative weight, lower and upper trim points, etc.\r\nThe DMI segment must be preceded by the MFI and MFE segments, as described in Section 8.5, GENERAL MASTER FILE SEGMENTS. In the following message, the MFI-1 - Master File Identifier field should equal \"DMI\".","chapters":["CH_08"]},{"id":"NMD_N02","type":"Message","label":"NMD_N02 - Application management data message (unsolicited)","description":"The N02 event signifies when an unsolicited update (UU) Application Management Data message (NMD) is created by on application to transmit application management information to other applications.  In this case, the initiating application sends an NMD message as an unsolicited update (UU) containing application management information to a receiving application, which responds with a generic acknowledgement message (ACK).\r\n\r\nFor example, an application going down for backups (or starting up again after backups) might issue such a message to one or more other applications.  An application switching to another CPU or file-server may also need to use this transaction to notify other systems.","chapters":["CH_14"]},{"id":"OMB_O27","type":"Message","label":"OMB_O27 - Blood product order","description":"Blood product order messages present the need for additional information that is not included in standard HL7 order messages. Order messages must contain accompanying details regarding the blood product component, such as special processing requirements (e.g., irradiation and leukoreduction), and the amount of the blood product to be administered. Additionally, specific relevant clinical information can be included to allow the prospective review of the appropriateness of the blood product order.\r\n\r\nBlood product orders use the OMB message with the BPO segment for the detail segment and the acknowledgment message, ORB as described below.\r\n\r\nThe NTE segment(s) can be included in the OMB message in four places; in each place the NTE refers to the segment that it follows. In particular, the NTEs following the MSH refer only to the message header; the NTEs following the blood product order segment apply to the service defined by that ORC and blood product order segment.\r\n\r\nThe PID segment is required if and only if new orders are being entered and they are related to a particular patient. For non-patient-related orders the PID segment is never included.\r\n\r\nThe optional PV1 segment is present mainly to permit transmission of patient visit information such as current location with an order.","chapters":["CH_04"]},{"id":"OMD_O03","type":"Message","label":"OMD_O03 - Diet order","description":null,"chapters":["CH_04"]},{"id":"OMG_O19","type":"Message","label":"OMG_O19 - General clinical order","description":"The function of this message is to initiate the transmission of information about a general clinical order that uses the OBR segment. OMG messages can originate also with a placer, filler, or an interested third party.\r\nThe trigger event for this message is any change to a general clinical order. Such changes include submission of new orders, cancellations, updates, patient and non-patient-specific orders, etc.\r\n\r\nThis trigger includes segments identified as being for 'previous results.' These segments allow the sending system to include demographic and/or result information from previous result reports when they are related to the current order.\r\n\r\nFor example:\r\n- Diagnostic laboratories referring tests to another lab for either confirmation of results (HIV, etc.) or due to not being equipped to do the tests (genetic testing, etc.).\r\n- Diagnostic laboratories sending test results to Knowledge Bases for the automated generation of diagnostic comments for inclusion into the lab report.\r\n\r\nThe CTD segment in this trigger is used to transmit temporary patient contact details specific to this order.","chapters":["CH_04"]},{"id":"OMI_O23","type":"Message","label":"OMI_O23 - Imaging order","description":"This message is used in communication between the information systems involved in the fulfillment of the request directed to the imaging department, such as a Radiology Information System (RIS) and a Picture Archiving and Communication System (PACS). For the purpose of the following discussion these systems will be identified as Imaging Department Information Systems (IDIS). Information contained in the Imaging Procedure Control (IPC) segment allows multiple IDIS to share the context of Imaging Studies (collections of images acquired, processed, stored, and interpreted) in Image Management tasks.\r\n\r\nThe order for the imaging service is communicated between the Order Placer (such as an Order Entry system) and the Order Filler (such as an RIS). In the imaging department environment, the Order Filler also identifies the set of procedures (studies) and sub-procedures (procedure steps) that have to be performed in the process of fulfilling the order. Each sub-procedure is performed using a single device (station). The Order Filler identifies the type of device and either a specific device or group of devices (for example, by geographic location) one of which is to be used in performing the procedure step. Thus, the system performs an aspect of workflow management in the department.\r\n\r\nAnother information system in the department may be managing storage and distribution of the images within the department as well as providing them to the enterprise. This system will have to operate within the same context as the system managing the workflow. This context includes identifiers, content of the order, and details of procedures and procedure steps that have to be performed to fulfill that particular order.\r\n\r\nIt is expected that the OMI message will typically be used in communication between IDIS as depicted in figure 4-1.","chapters":["CH_04"]},{"id":"OML_O21","type":"Message","label":"OML_O21 - Laboratory order","description":"The following message structure may be used for the communication of laboratory and other order messages and must be used for lab automation messages where it is required that the Specimen/Container information is within the ORC/OBR segment group.\r\n\r\nThe trigger event for this message is any change to a laboratory order. Such changes include submission of new orders, cancellations, updates, etc. OML messages can originate also with a placer, filler, or an interested third party.\r\n\r\nNote: The additional patient information, which is sent after the OBR with the current order (the segments PID, PD1, PV1, PV2, etc, indicated below with words \"previous result\"), could have been transferred with the previous result because the patient demographics related to the previous result can differ from the demographics related to the current order. The current intent is to only allow references to the same patient as in the header PID.\r\n\r\nThe SAC segments included in the message allow the transfer of, e.g., a laboratory order with multiple containers and multiple test orders related to each container, or laboratory orders with test order requiring multiple containers.\r\n\r\nRefer to Chapter 13, \"Laboratory Automation\" for examples of usage, particularly to clarify the use of two references to SAC segments in this one message.\r\n\r\nThe CTD segment in this trigger is used to transmit temporary patient contact details specific to this order.\r\n\r\nIn relationship to triggers O21, O33, O35, and Oxx this message/trigger (O21) should be used where an order with multiple samples and optionally multiple containers per order item are to be communicated, but not against a complete specimen shipment (O39)","chapters":["CH_04"]},{"id":"OML_O33","type":"Message","label":"OML_O33 - Laboratory order for multiple orders related to a single specimen","description":"The trigger event for this message is any change to a laboratory order. Such changes include submission of new orders, cancellations, updates, etc., where multiple orders are associated with a single sample which may be carried in multiple containers. OML messages can originate also with a placer, filler, or an interested third party.\r\n\r\nThis allows for a Specimen-centric message with multiple orders per specimen grouped by the specimen.\r\n\r\nThe following message structure may be used for the communication of laboratory and other order messages and must be used for lab automation messages where the message requires Specimen/container information to group a number of orders.\r\n\r\nIn relationship to triggers O21, O33, and O35, this message/trigger (O33) should be used where a specimen, with optional multiple containers, may have multiple orders to be communicated.","chapters":["CH_04"]},{"id":"OML_O35","type":"Message","label":"OML_O35 - Laboratory order for multiple orders related to a single container of a sp","description":"The trigger event for this message is any change to a laboratory order. Such changes include submission of new orders, cancellations, updates, etc., where multiple orders are associated with a single sample which may be carried in multiple containers. OML messages can originate also with a placer, filler, or an interested third party.\r\n\r\nThis allows for a Specimen-centric message with multiple orders per specimen grouped by the specimen.\r\n\r\nThe following message structure may be used for the communication of laboratory and other order messages and must be used for lab automation messages where the message requires Specimen/container information to group a number of orders.\r\n\r\nIn relationship to triggers O21, O33, and O35, this message/trigger (O35) should be used for laboratory orders where there is 1 or more Specimens with 1 to many containers and each container may have 1 to many orders with previous result(s) per container.","chapters":["CH_04"]},{"id":"OML_O39","type":"Message","label":"OML_O39 - Specimen shipment centric laboratory order","description":"The function of this message is to apply an order to all specimens in a shipment or a package within a shipment.","chapters":["CH_04"]},{"id":"OMN_O07","type":"Message","label":"OMN_O07 - Non-stock requisition order","description":"Non-stock requisitions can use the ORM message with the RQD and RQ1 segments as the detail segment, or use the OMN and ORN messages described below:","chapters":["CH_04"]},{"id":"OMP_O09","type":"Message","label":"OMP_O09 - Pharmacy/treatment order","description":null,"chapters":["CH_04"]},{"id":"OMS_O05","type":"Message","label":"OMS_O05 - Stock requisition order","description":"Stock requisition orders use the ORM where RQD is the detail segment for backward compatibility or can use the OMS and ORS messages described below.","chapters":["CH_04"]},{"id":"OPL_O37","type":"Message","label":"OPL_O37 - Population/Location-Based Laboratory Order Message","description":"This message supports the use-case for submission of field level specimen and order data to diagnostic laboratories","chapters":["CH_04"]},{"id":"OPR_O38","type":"Message","label":"OPR_O38 - Population/Location-Based Laboratory Order Acknowledgment Message","description":"The function of this message is to respond to an OPL message. An OPR message is the application acknowledgment to an OPL message. See Chapter 2 for a description of the acknowledgment paradigm.\r\n\r\nNote: Based upon general message/acknowledgment patterns, it would be expected that this message type would be ORP. However, when this message type was introduced, ORP was already in use as Pharmacy/Treatment Order Acknowledgment.","chapters":["CH_04"]},{"id":"OPU_R25","type":"Message","label":"OPU_R25 - Unsolicited Population/Location-Based Laboratory Observation Message","description":"This message supports unsolicited population or location-based surveillance reporting to a central repository where the accession / visit may contain references to multiple patients, multiple specimens, non-patient specimens, and multiple orders per specimen.\r\n\r\nThis message structure represents the way most submissions to veterinary laboratories occur. There is a multi-tier hierarchy in which a single individual (for example, a veterinarian or an owner of a production facility) submits one or more specimen samples from one or more animals or non-living entity, such as environmental specimens or feed. This grouped submission of specimens from multiple animal 'patients' is usually referred to as an 'accession' which can be considered analogous to a 'visit' in the veterinary laboratory context. This is what accounts for the unusual structure where the PV1 segment precedes a repeatable ACCESSION_DETAIL group.\r\n\r\nSince specimens can originate from non-patients the PATIENT group is optional. This allows for specimens that are both associated with patients as well as those associated with non-patients to be included under the same accession (visit). Each specimen may have one or more orders assigned, each of which may have one or more individual results.\r\n\r\nThe OBX segment at the visit level provides the reason for submission. The repeatable PRT segment at the visit level represents the person(s) or organization submitting the request and other interested parties and locations who (that) play a role in the disposition of the accession/visit.\r\n\r\nThe NK1 segment contains owner and/or responsible party information for the patient and/or specimen.","chapters":["CH_07"]},{"id":"ORA_R33","type":"Message","label":"ORA_R33 - Observation Report Acknowledgement","description":"This message enables a response to the ORU^R30 message to provide an application level acknowledgement that may include a placer order number.","chapters":["CH_07"]},{"id":"ORB_O28","type":"Message","label":"ORB_O28 - Blood product order acknowledgment","description":null,"chapters":["CH_04"]},{"id":"ORD_O04","type":"Message","label":"ORD_O04 - Diet order acknowledgment","description":null,"chapters":["CH_04"]},{"id":"ORG_O20","type":"Message","label":"ORG_O20 - General clinical order response","description":"The function of this message is to respond to an OMG message. An ORG message is the application acknowledgment to an OMG message. See Chapter 2 for a description of the acknowledgment paradigm.\r\n\r\nIn ORG the PID and ORC segments are optional, particularly in case of an error response. However, ORC segments are always required in ORG when the OBR is present. For example, a response ORG might include only the MSH and MSA.\r\n\r\nThe function (e.g., cancel, new order) of both OMG and ORG messages is determined by the value in ORC-1-order control. (See the table of order control values for a complete list.)","chapters":["CH_04"]},{"id":"ORI_O24","type":"Message","label":"ORI_O24 - Imaging order response message to any OMI","description":"The function of this message is to respond to an OMI message. An ORI message is the application acknowledgment to an OMI message. See Chapter 2 for a description of the acknowledgment paradigm.","chapters":["CH_04"]},{"id":"ORL_O22","type":"Message","label":"ORL_O22 - General laboratory order response message to any OML","description":"The function of this message is to respond to an OML message. An ORL message is the application acknowledgment to an OML message. See Chapter 2 for a description of the acknowledgment paradigm.","chapters":["CH_04"]},{"id":"ORL_O34","type":"Message","label":"ORL_O34 - Laboratory order response message to a multiple order related to single sp","description":"The function of this message is to respond to an OML message where the original trigger event produced an OML with the Specimen Group segment above the ORC. An ORL message is the application acknowledgment to an OML message. See Chapter 2 for a description of the acknowledgment paradigm.","chapters":["CH_04"]},{"id":"ORL_O36","type":"Message","label":"ORL_O36 - Laboratory order response message to a single container of a specimen OML","description":"The function of this message is to respond to an OML message where the original trigger event produced an OML with the Specimen Group segment above the ORC. An ORL message is the application acknowledgment to an OML message. See Chapter 2 for a description of the acknowledgment paradigm.","chapters":["CH_04"]},{"id":"ORL_O40","type":"Message","label":"ORL_O40 - Specimen Shipment Centric Laboratory Order Acknowledgment Message","description":"The function of this message is to respond to an OML message. An ORL message is the application acknowledgment to an OML message. See Chapter 2 for a description of the acknowledgment paradigm.","chapters":["CH_04"]},{"id":"ORN_O08","type":"Message","label":"ORN_O08 - Non-stock requisition acknowledgment","description":null,"chapters":["CH_04"]},{"id":"ORP_O10","type":"Message","label":"ORP_O10 - Pharmacy/treatment order acknowledgment","description":null,"chapters":["CH_04"]},{"id":"ORS_O06","type":"Message","label":"ORS_O06 - Stock requisition acknowledgment","description":null,"chapters":["CH_04"]},{"id":"ORU_R01","type":"Message","label":"ORU_R01 - Unsolicited transmission of an observation message","description":"The ORU message is for transmitting laboratory results to other systems. The OUL message is designed to accommodate the laboratory processes of laboratory automation systems.\r\n\r\nWith the segment (OBX) defined in this chapter, and the OBR defined in Chapter 4, one can construct almost any clinical report as a multi-level hierarchy, with the PID segment defined in Chapter 3 at the upper level, an order record (OBR) at the next level with one or more observation records (OBX), followed by the specimen information (SPM) and one or more observations (OBX) directly associated with the specimen.\r\n\r\nOne result segment (OBX) is transmitted for each component of a diagnostic report, such as an EKG or obstetrical ultrasound or electrolyte battery.\r\n\r\nThe CTD segment in this trigger is used to transmit temporary patient contact details specific to this order.\r\n\r\nNote: The ORC is permitted but not required in this message. Any information that could be included in either the ORC or the OBR must be included in the OBR on reporting. Notice also that the ORU (and the QRY) messages accommodate reports about many patients.\r\n\r\nMany report headers (OBR) may be sent beneath each patient segment, with many separate observation segments (OBX) related to the order / observation request beneath each OBR. OBX segments that are related to specimens immediately follow the SPM segments. Note segments (NTE) may be inserted at different locations in the message. The note segment applies to the entity that immediately precedes it, i.e., the patient if it follows the PID segment, the observation request if it follows the OBR segment, and the individual result if it follows the OBX segment.","chapters":["CH_07"]},{"id":"ORU_R30","type":"Message","label":"ORU_R30 - Unsolicited Point-Of-Care Observation Message Without Existing Order - Pla","description":"This event trigger instructs the receiving system to create a new order for the observation(s) contained in the message.\r\n\r\nOne example of this triggers use case occurs when a Doctor verbally instructs a nurse to perform a test. Looking at this use case from an information management perspective, one might expect that, the nurse would enter an order into laboratory information or ordering system before performing the test. However, there usually isn't time for order entry in these use cases. In fact, it is highly desirable for the POC measurement process to become automated so that the only action a user needs to take is to make a measurement on the POC Device, with all other processes for generating an order and tying it in to the observation handled by the \"machines.\"\r\n\r\nIn order to allow for the passing of specific information relating to the Patient, responsible Doctor, placing doctor, patient location, etc., there is a requirement for the inclusion of a PV1 and PD1 segment in the ORU message type. One example of this triggers use case occurs when a Doctor at a remote site without a shared Patient index instructs a nurse to perform a test. The testing is carried out without prior entry of a request into the LIS. Once performed, the results, along with the patient information are transmitted to the LIS. In some circumstances, the LIS may add clinical interpretation to this and report it back to the placing system and/or another system. In order to allow for this to take place, the requester, location, etc., information is required.\r\n\r\nTo allow the sending system to correlate every result with its associated order, the receiving system will return the placer order number in the ORC segment of the ORA^R33 message. If the receiving system cannot place an order it must returning an application level error description in the Application Acknowledgement Message MSA Text Message field.\r\n\r\nThe sending system must return a commit-level acknowledgement in response to the ORA^R33 message.","chapters":["CH_07"]},{"id":"ORU_R31","type":"Message","label":"ORU_R31 - Unsolicited New Point-Of-Care Observation Message - Search For An Order","description":"This event trigger instructs the receiving system to search for an existing order for the observation(s) contained in the message.\r\n\r\nIn this case, the sending system does not know if an order has been placed. This transaction instructs the receiving system to search for an existing order for the associated results. If the receiver finds an existing order, it should return the Placer ID to the sender in the ORC segment of an OML^O21 message. This information allows the Observation Reviewer to correlate every result with its associated order.\r\n\r\nThe institutions business rules will determine what the receiving system does if it cant find a matching order. Possibilities include automatically placing an order (as in trigger event R30), or returning an application level error description in the Application Acknowledgement MSA Text Message field..\r\n\r\nIf it is necessary to pass specific information related to the Patient, responsible Doctor, placing doctor, patient location etc, there is a requirement for the inclusion of a PV1 and PD1 segment in the ORU message type (see also ORU^R30 for description).","chapters":["CH_07"]},{"id":"ORU_R32","type":"Message","label":"ORU_R32 - Unsolicited Pre-Ordered Point-Of-Care Observation","description":"This event trigger instructs the receiver to place the result with the order information included in the message.\r\n\r\nFrom a traditional clinical laboratory perspective, this event triggers use case is probably the predominant (if not exclusive) one. However, in the POC environment, it is actually uncommon to have an order already generated when a test is performed. It does happen sometimes, though. If it is necessary to pass specific information related to the Patient, responsible Doctor, placing doctor, patient location, etc., there is a requirement for the inclusion of a PV1 and PD1 segment in the ORU message type (see also ORU^R30 for description).\r\n\r\nIf the receiving system accepts both the order and the result, it will return an ORA^R33 Application Acknowledgement message with the acknowledgement code of AA. A comment may be included in the Acknowledgement Message MSA Text Message field.\r\n\r\nIf the receiving system is unable to accept both the order and the result, no order or result should be placed and an ACK^33 Application Acknowledgement message must be returned to the sender with the error identified in the MSA Text Message field.\r\n\r\nThe sending system must return a commit-level acknowledgement in response to the ORA^R33 message.","chapters":["CH_07"]},{"id":"OSM_R26","type":"Message","label":"OSM_R26 - Unsolicited Specimen Shipment Manifest Message","description":"The OSM^R26 Unsolicited Specimen Shipment Manifest message is used to communicate the contents of a specimen shipment to a specimen receiver (typically a laboratory). The message documents details regard the following:\r\n- Shipment information including sender, receiver, shipper, shipping container, etc.;\r\n- Specimens in the shipment;\r\n- Specimen containers; and,\r\n- Identification of persons/places/things associated with the specimens.","chapters":["CH_07"]},{"id":"OUL_R22","type":"Message","label":"OUL_R22 - Unsolicited Specimen Oriented Observation Message","description":"This message was designed to accommodate specimen oriented testing. It should be applicable to container-less testing (e.g., elephant on a table) and laboratory automation systems requiring container.\r\n\r\nGenerally this construct allows transfer of multiple results related to a specimen from a patient, where this specimen has been in none, one, or multiple containers.\r\n\r\nIn addition to the patient results themselves it permits the communication of the following kinds of information:\r\n- Analysis results of a non patient related sample (e.g., environmental)  patient related segments (e.g., PID, PD1, PV1, PV2) are optional.\r\n- Analysis results to a particular container with QC sample and the lot and manufacturer information about this sample (SAC-INV segments)  however for this purpose the \"Unsolicited Specimen Container Oriented Observation Message\" (OUL^R23) is recommended due to explicit relation between the observation and the container.\r\n- Basic identification data (lot, manufacturer, etc.) of the reagents and other substances involved in the generation of analysis results (TCD-SID segments).\r\n\r\nRefer to Chapter 13 Laboratory Automation for additional examples of usage of SAC.","chapters":["CH_07"]},{"id":"OUL_R23","type":"Message","label":"OUL_R23 - Unsolicited Specimen Container Oriented Observation Message","description":"This message was designed to accommodate specimen oriented testing. It should be applicable to, for example, laboratory automation systems requiring container.\r\n\r\nGenerally this construct allows transfer of multiple results related to one or more specific containers with one or more specimens from a patient.\r\n\r\nIn addition to the patient results themselves it permits the communication of the following kinds of information:\r\n- Analysis results of a non patient related sample (e.g., environmental)  patient related segments (e.g., PID, PD1, PV1, PV2) are optional.\r\n- Analysis results to a particular container with QC sample and the lot and manufacturer information about this sample (SAC-INV segments).\r\n- Basic identification data (lot, manufacturer, etc.) of the reagents and other substances involved in the generation of analysis results (TCD-SID segments).\r\n\r\nRefer to Chapter 13 Laboratory Automation for additional examples of usage of SAC.","chapters":["CH_07"]},{"id":"OUL_R24","type":"Message","label":"OUL_R24 - Unsolicited Order Oriented Observation Message","description":"This message was designed to accommodate multi-specimen oriented testing. It should be applicable to, e.g., laboratory automation systems requiring container.\r\n\r\nGenerally this construct allows transfer of multiple results, each one related to none, one or more specific containers with one or more specimens from a patient. (Example: Creatinine Clearance result with detailed information about the urine and serum specimens and their containers.)\r\n\r\nIn addition to the patient results themselves it permits the communication of the following kinds of information:\r\n- Analysis results of a non patient related sample (e.g., environmental)  patient related segments (e.g., PID, PD1, PV1, PV2) are optional.\r\n- Analysis results to a particular container with QC sample and the lot and manufacturer information about this sample (SAC-INV segments).\r\n- Basic identification data (lot, manufacturer, etc.) of the reagents and other substances involved in the generation of analysis results (TCD-SID segments).\r\n\r\nRefer to Chapter 13 Laboratory Automation for additional examples of usage of SAC.","chapters":["CH_07"]},{"id":"PEX_P07","type":"Message","label":"PEX_P07 - Unsolicited initial individual product experience report","description":"The primary application of this message is to transfer information related to an adverse event occurring while a patient was exposed to a product.\r\n\r\nThe PID segment provides the patient identification information including institutional identification numbers, date of birth and in the case of patients who die, information about their death. Patients are frequently identified only by their initials which can be represented in the PID segment, e.g., the initials JMO would appear as J^M^O in the name field of the PID segment. The EVN segment identifies the type of transaction that is being sent -- primarily it specifies who the sender is and implies which information is expected to be included in the message. A message sent from a healthcare provider, for example, might contain minimal information, while a message from a pharmaceutical manufacturer might contain nearly complete information.\r\n\r\nThe PES or Product Experience Sender segment provides information about the message sender and its knowledge of the event. The heart of the product experience message is the product experience observation (PEO) segment and the PCR segments clustered under it. The PEO segment identifies a clinical event and the PCR segments identify products which are potentially causally related to the event. There may be more than one product which is potentially related to the event so multiple PCR segments can be included. RXE and RXR segments can be repeated and provide information about the products the patient was exposed to at the time of the event (typically excluding those used to treat the event). Details about the administration of the products identified in the PCR segments should be described with RXE and RXR segments. Repeated PRB segments provide information about diagnoses which represent comorbid conditions. The repeated OBX segments are used to send patient observations such as height, weight, last menstrual period, and laboratory results. Analytical commentary can be included in the NTE segment. This commentary will typically be the senders analysis of the event and the potentially causally related products. Finally, the CSR and CSP segments can optionally be included if the event occurred during a formal clinical trial in order to describe the trial.\r\n\r\nWhen a product experience relates to an exposure which occurred indirectly (transmammary or transplacentally for example), the individual experiencing the adverse effect  the fetus or child  would be described in the PID segment and the individual via which they are exposed in the NK1 segment. The first set of RXE segments would typically indicate the drugs which to which the fetus or child was exposed. Additional codes for the route are defined in this Appendix to allow the suspected routes of exposure to be represented. The second set of RXE/RXR segment - those clustered under the NK1 segment - would represent the route by which the mother or father was exposed to the drug. Early spontaneous abortion would normally be treated as an adverse effect on the mother rather than on the fetus, and the PID would refer to the mother. The second set of PRB/OBX segments reflects the problems/observations associated with the individual via which they were exposed.\r\n\r\nEach message contains information about a single case including one patient (PID), at least one sender (PES), one or more events (PEO) and one or more suspected products (PCR and RXE/RXA) for a minimal message. The structure of the message allows actual administration information to be sent in the RXA if known; if administration information is unavailable, or the adverse reaction cannot be related to a single administration event, the RXE segment can be used to send prescription level information. Additional information may be included based on availability and regulatory requirements.\r\n\r\nThe MSH segment specifies the character set (MSH-18) and the language (MSH-19) used in the PEX message.\r\nThe PEX message is designed to accommodate required reporting of adverse product events to the responsible regulatory agencies. In the United States, the paper version of this report is Medwatch.","chapters":["CH_07"]},{"id":"PEX_P08","type":"Message","label":"PEX_P08 - Unsolicited update individual product experience report","description":"The primary application of this message is to transfer information related to an adverse event occurring while a patient was exposed to a product.\r\n\r\nThe PID segment provides the patient identification information including institutional identification numbers, date of birth and in the case of patients who die, information about their death. Patients are frequently identified only by their initials which can be represented in the PID segment, e.g., the initials JMO would appear as J^M^O in the name field of the PID segment. The EVN segment identifies the type of transaction that is being sent -- primarily it specifies who the sender is and implies which information is expected to be included in the message. A message sent from a healthcare provider, for example, might contain minimal information, while a message from a pharmaceutical manufacturer might contain nearly complete information.\r\n\r\nThe PES or Product Experience Sender segment provides information about the message sender and its knowledge of the event. The heart of the product experience message is the product experience observation (PEO) segment and the PCR segments clustered under it. The PEO segment identifies a clinical event and the PCR segments identify products which are potentially causally related to the event. There may be more than one product which is potentially related to the event so multiple PCR segments can be included. RXE and RXR segments can be repeated and provide information about the products the patient was exposed to at the time of the event (typically excluding those used to treat the event). Details about the administration of the products identified in the PCR segments should be described with RXE and RXR segments. Repeated PRB segments provide information about diagnoses which represent comorbid conditions. The repeated OBX segments are used to send patient observations such as height, weight, last menstrual period, and laboratory results. Analytical commentary can be included in the NTE segment. This commentary will typically be the senders analysis of the event and the potentially causally related products. Finally, the CSR and CSP segments can optionally be included if the event occurred during a formal clinical trial in order to describe the trial.\r\n\r\nWhen a product experience relates to an exposure which occurred indirectly (transmammary or transplacentally for example), the individual experiencing the adverse effect  the fetus or child  would be described in the PID segment and the individual via which they are exposed in the NK1 segment. The first set of RXE segments would typically indicate the drugs which to which the fetus or child was exposed. Additional codes for the route are defined in this Appendix to allow the suspected routes of exposure to be represented. The second set of RXE/RXR segment - those clustered under the NK1 segment - would represent the route by which the mother or father was exposed to the drug. Early spontaneous abortion would normally be treated as an adverse effect on the mother rather than on the fetus, and the PID would refer to the mother. The second set of PRB/OBX segments reflects the problems/observations associated with the individual via which they were exposed.\r\n\r\nEach message contains information about a single case including one patient (PID), at least one sender (PES), one or more events (PEO) and one or more suspected products (PCR and RXE/RXA) for a minimal message. The structure of the message allows actual administration information to be sent in the RXA if known; if administration information is unavailable, or the adverse reaction cannot be related to a single administration event, the RXE segment can be used to send prescription level information. Additional information may be included based on availability and regulatory requirements.\r\n\r\nThe MSH segment specifies the character set (MSH-18) and the language (MSH-19) used in the PEX message.\r\nThe PEX message is designed to accommodate required reporting of adverse product events to the responsible regulatory agencies. In the United States, the paper version of this report is Medwatch.","chapters":["CH_07"]},{"id":"PGL_PC6","type":"Message","label":"PGL_PC6 - PC/ goal add","description":"This message is used to send goals from one application to another (e.g., a point of care system to a clinical repository).  Many of the segments associated with this event are optional.  This optionality allows systems in need of this information to set up transactions that fulfill their requirements.","chapters":["CH_12"]},{"id":"PGL_PC7","type":"Message","label":"PGL_PC7 - PC/ goal update","description":"This message is used to update goals from one application to another (e.g., a point of care system to a clinical repository).  Many of the segments associated with this event are optional.  This optionality allows systems in need of this information to set up transactions that fulfill their requirements.","chapters":["CH_12"]},{"id":"PGL_PC8","type":"Message","label":"PGL_PC8 - PC/ goal delete","description":"This message is used to delete goals from one application to another (e.g., a point of care system to a clinical repository).  Many of the segments associated with this event are optional.  This optionality allows systems in need of this information to set up transactions that fulfill their requirements.","chapters":["CH_12"]},{"id":"PIN_I07","type":"Message","label":"PIN_I07 - Unsolicited insurance information","description":"This trigger event is used by an entity or organization to transmit to a healthcare provider the insurance information on a specific patient.  Typically, the healthcare provider will be a primary care provider.","chapters":["CH_11"]},{"id":"PMU_B01","type":"Message","label":"PMU_B01 - Add personnel record","description":"An event B01 signals to add a new record for healthcare administration information about an individual healthcare practitioner establishing a relationship between that practitioner and the institution.\r\nThe EVN segment is used to indicate the effective or planned date.","chapters":["CH_15"]},{"id":"PMU_B02","type":"Message","label":"PMU_B02 - Update personnel record","description":"An event B02 signals to update the record with the healthcare administration information about an individual healthcare practitioner.  This event should not be used to grant/revoke a certificate.\r\nThe EVN segment is used to indicate the effective or planned date.","chapters":["CH_15"]},{"id":"PMU_B03","type":"Message","label":"PMU_B03 - Delete personnel record","description":"An event B03 signals to delete the record with the healthcare administration information about an individual healthcare practitioner to correct erroneous entries. \r\nThe EVN segment is used to indicate the effective or planned date.","chapters":["CH_15"]},{"id":"PMU_B04","type":"Message","label":"PMU_B04 - Active practicing person","description":"An event B04 signals that a staff member is available for work (e.g., schedules can be created) and has a relationship with the institution.  This message applies to STF-7.","chapters":["CH_15"]},{"id":"PMU_B05","type":"Message","label":"PMU_B05 - Deactivate practicing person","description":"An event B05 indicates that a staff member is temporarily unavailable for work, while maintaining a relationship with the institution.  This message applies to STF-7.","chapters":["CH_15"]},{"id":"PMU_B06","type":"Message","label":"PMU_B06 - Terminate practicing person","description":"An event B06 signals that the formal relationship between a staff member and the institution has ended (i.e., upon termination).","chapters":["CH_15"]},{"id":"PMU_B07","type":"Message","label":"PMU_B07 - Grant Certificate/Permission","description":"An event B07 indicates that a health professional is granted a certificate/permission for a special purpose.\r\n\r\nA permission is issued by an organization and documented in form of a certificate.  An update of a role results in an issuing of a new certificate.\r\n\r\nThe EVN segment is used to indicate the effective or planned date.","chapters":["CH_15"]},{"id":"PMU_B08","type":"Message","label":"PMU_B08 - Revoke Certificate/Permission","description":null,"chapters":["CH_15"]},{"id":"PPG_PCG","type":"Message","label":"PPG_PCG - PC/ pathway (goal-oriented) add","description":null,"chapters":["CH_12"]},{"id":"PPG_PCH","type":"Message","label":"PPG_PCH - PC/ pathway (goal-oriented) update","description":null,"chapters":["CH_12"]},{"id":"PPG_PCJ","type":"Message","label":"PPG_PCJ - PC/ pathway (goal-oriented) delete","description":null,"chapters":["CH_12"]},{"id":"PPP_PCB","type":"Message","label":"PPP_PCB - PC/ pathway (problem-oriented) add","description":null,"chapters":["CH_12"]},{"id":"PPP_PCC","type":"Message","label":"PPP_PCC - PC/ pathway (problem-oriented) update","description":null,"chapters":["CH_12"]},{"id":"PPP_PCD","type":"Message","label":"PPP_PCD - PC/ pathway (problem-oriented) delete","description":null,"chapters":["CH_12"]},{"id":"PPR_PC1","type":"Message","label":"PPR_PC1 - PC/ problem add","description":"The patient problem message is used to send problems from one application to another (e.g., a point of care system to a clinical repository).  Many of the segments associated with this event are optional.  This optionality allows systems in need of this information to set up transactions that fulfill their requirements.","chapters":["CH_12"]},{"id":"PPR_PC2","type":"Message","label":"PPR_PC2 - PC/ problem update","description":"The patient problem message is used to update problems from one application to another (e.g., a point of care system to a clinical repository).  Many of the segments associated with this event are optional.  This optionality allows systems in need of this information to set up transactions that fulfill their requirements.","chapters":["CH_12"]},{"id":"PPR_PC3","type":"Message","label":"PPR_PC3 - PC/ problem delete","description":"The patient problem message is used to delete problems from one application to another (e.g., a point of care system to a clinical repository).  Many of the segments associated with this event are optional.  This optionality allows systems in need of this information to set up transactions that fulfill their requirements.","chapters":["CH_12"]},{"id":"PPT_PCL","type":"Message","label":"PPT_PCL - PC/ pathway (goal-oriented) query response","description":"Retained for backwards compatibility only in version 2.4 and later; refer to Chapter 5, section 5.4.  The original mode query and the QRD/QRF segments have been replaced.\r\n\r\nThe following trigger/message event is served by PPT (a response from the system responsible for maintaining the goal-oriented pathway information).","chapters":["CH_12"]},{"id":"PPV_PCA","type":"Message","label":"PPV_PCA - PC/ goal response","description":"Retained for backwards compatibility only in version 2.4 and later; refer to Chapter 5, section 5.4.  The original mode query and the QRD/QRF segments have been replaced.\r\n\r\nThe following trigger/message event is served by PPV (a response from the system responsible for maintaining the goal information).","chapters":["CH_12"]},{"id":"PRR_PC5","type":"Message","label":"PRR_PC5 - PC/ problem response","description":"Retained for backwards compatibility only in version 2.4 and later; refer to Chapter 5, section 5.4.  The original mode query and the QRD/QRF segments have been replaced.\r\n\r\nThe following trigger/message event is served by PRR (a response from the system responsible for maintaining the problem information).","chapters":["CH_12"]},{"id":"PTR_PCF","type":"Message","label":"PTR_PCF - PC/ pathway (problem-oriented) query response","description":"Retained for backwards compatibility only in version 2.4 and later; refer to Chapter 5, section 5.4.  The original mode query and the QRD/QRF segments have been replaced.\r\n\r\nThe following trigger/message event is served by PTR (a response from the system responsible for maintaining the problem-oriented pathway information).","chapters":["CH_12"]},{"id":"QBP_E03","type":"Message","label":"QBP_E03 - HealthCare Services Invoice Status Query","description":"This message is used to query the status of a HealthCare Services Invoice. There are 3 types of queries handled by this message: 1) a specific Invoice, 2) a specific Product/Service Group or 3) a specific Product/Service Line Item. If a Provider wants to obtain information on a group of invoices (e.g., submitted in a date range), each individual Invoice must be queried.\r\n\r\nThis message may also be used to query an Invoice submitted at another Network Application ID and Network Facility ID, as long as sufficient identification information is provided to qualify the request and requestor.  These are noted as Processing Rules for this message.\r\n\r\nNote that the response to this query has the same content as an EHC^E10  Edit/Adjudication Results message.","chapters":["CH_05","CH_16"]},{"id":"QBP_E22","type":"Message","label":"QBP_E22 - Query Authorization Request Status","description":"This message is used to query the status of an Authorization Request. There are 2 types of queries handled by this message: 1) a specific Authorization Request or 2) a specific Product/Service Line Item. If a Provider wants to obtain information on a group of Authorization Requests (e.g., submitted in a date range), each individual Authorization Request must be queried.","chapters":["CH_05","CH_16"]},{"id":"QBP_Q11","type":"Message","label":"QBP_Q11 - Query by parameter requesting an RSP segment pattern response","description":"The QBP_Q11 structure supports a Segment Pattern Response and contains the MSH, QPD, RCP, and DSC segments.  Its default trigger event is Q11.  A standard or site-defined query may use this trigger event or may specify a unique trigger event value in its Query Profile.  If a unique trigger event value is chosen for a site-defined query, that value SHALL begin with Z. \r\n\r\nNote on QBP: Query By Example variant:  The query by example is an extension of Query by Parameter (QBP) in which search parameters are passed by sending them in the segment which naturally carries them. A Query Profile which uses this variant SHALL replace the ellipses in the input QBP_Q11 grammar above, with the specific segments that it accepts. \r\n\r\nNote:  The indicated trigger events are the default values for MSH-9-2-Trigger event.  Standard and site-defined queries may use these trigger events or may specify unique trigger event values in their Query Profiles.  Unique trigger event values for site-defined queries SHALL begin with Z.","chapters":["CH_05"]},{"id":"QBP_Q13","type":"Message","label":"QBP_Q13 - Query by parameter requesting an  RTB - tabular response","description":"The QBP_Q13 structure supports a Tabular Response and contains the MSH, RDF, RCP, and DSC segments.  Its default trigger event is Q13.  A standard or site-defined query may use this trigger event or may specify a unique trigger event value in its Query Profile.  If a unique trigger event value is chosen for a site-defined query, that value SHALL begin with Z.\r\n\r\nUnless otherwise specified in the query's Query Profile, the default value for the RDF segment shall be understood to contain all available fields from the Virtual Table. The Client may override the default RDF by specifying explicitly the columns to be returned.","chapters":["CH_05"]},{"id":"QBP_Q15","type":"Message","label":"QBP_Q15 - Query by parameter requesting an RDY display response","description":"The QBP_Q15 structure supports a Display Response and contains the MSH, QPD, RCP, and DSC segments.  Its default trigger event is Q15.  A standard or site-defined query may use this trigger event or may specify a unique trigger event value in its Query Profile.  If a unique trigger event value is chosen for a site-defined query, that value SHALL begin with Z.\r\n\r\nNote on QBP: Query By Example variant:  The query by example is an extension of Query by Parameter (QBP) in which search parameters are passed by sending them in the segment which naturally carries them. A Query Profile which uses this variant SHALL replace the ellipses in the input QBP_Q11 grammar above, with the specific segments that it accepts. ","chapters":["CH_05"]},{"id":"QBP_Q21","type":"Message","label":"QBP_Q21 - Get person demographics","description":null,"chapters":["CH_03"]},{"id":"QBP_Q22","type":"Message","label":"QBP_Q22 - Find candidates","description":null,"chapters":["CH_03"]},{"id":"QBP_Q23","type":"Message","label":"QBP_Q23 - Get corresponding identifiers","description":null,"chapters":["CH_03"]},{"id":"QBP_Q24","type":"Message","label":"QBP_Q24 - Allocate identifiers","description":null,"chapters":["CH_03"]},{"id":"QBP_Q25","type":"Message","label":"QBP_Q25 - Personnel Information by Segment Query","description":"Retrieve all available personnel information based upon the values of one or more commonly used search parameters","chapters":["CH_15"]},{"id":"QBP_Q31","type":"Message","label":"QBP_Q31 - QBP Query Dispense history","description":null,"chapters":["CH_04"]},{"id":"QBP_Q32","type":"Message","label":"QBP_Q32 - Find Candidates including Visit Information","description":null,"chapters":["CH_03"]},{"id":"QBP_Z73","type":"Message","label":"QBP_Z73 - Information about Phone Calls","description":null,"chapters":["CH_04"]},{"id":"QBP_Z75","type":"Message","label":"QBP_Z75 - Tabular Patient List","description":"To find patient records that closely (as specified by the Client) match a set of input criteria using a specified algorithm.","chapters":["CH_05"]},{"id":"QBP_Z77","type":"Message","label":"QBP_Z77 - Tabular Patient List","description":"To find patient records that closely (as specified by the Client) match a set of input criteria using a specified algorithm","chapters":["CH_05"]},{"id":"QBP_Z79","type":"Message","label":"QBP_Z79 - Dispense Information","description":"To retrieve patient pharmacy dispense history information from the Server","chapters":["CH_05"]},{"id":"QBP_Z81","type":"Message","label":"QBP_Z81 - Dispense History","description":"To retrieve patient pharmacy dispense history information from the Server.","chapters":["CH_05"]},{"id":"QBP_Z85","type":"Message","label":"QBP_Z85 - Pharmacy Information Comprehensive","description":"To retrieve patient pharmacy history information from the Server.","chapters":["CH_05"]},{"id":"QBP_Z87","type":"Message","label":"QBP_Z87 - Dispense Information","description":"To retrieve patient pharmacy dispense history information from the Server","chapters":["CH_05"]},{"id":"QBP_Z89","type":"Message","label":"QBP_Z89 - Lab Results History","description":"To retrieve patient laboratory results information from the Server.","chapters":["CH_05"]},{"id":"QBP_Z91","type":"Message","label":"QBP_Z91 - Who Am I","description":"Find the identity of the patient for specified medical record number(s)","chapters":["CH_05"]},{"id":"QBP_Z93","type":"Message","label":"QBP_Z93 - Tabular Dispense History","description":"Returns response sorted by Date Dispensed unless otherwise specified.","chapters":["CH_05"]},{"id":"QBP_Z95","type":"Message","label":"QBP_Z95 - Tabular Dispense History","description":"To retrieve patient pharmacy dispense history information from the Server.","chapters":["CH_05"]},{"id":"QBP_Z97","type":"Message","label":"QBP_Z97 - Dispense History","description":"To retrieve patient pharmacy dispense history information from the Server.","chapters":["CH_05"]},{"id":"QBP_Z99","type":"Message","label":"QBP_Z99 - Who Am I","description":"Find the identity of the patient for specified medical record number(s)","chapters":["CH_05"]},{"id":"QCN_J01","type":"Message","label":"QCN_J01 - Cancel query/acknowledge message","description":null,"chapters":["CH_05"]},{"id":"QRY_PC4","type":"Message","label":"QRY_PC4 - PC/ problem query","description":"Retained for backwards compatibility only in version 2.4 and later; refer to Chapter 5, section 5.4.  The original mode query and the QRD/QRF segments have been replaced.\r\n\r\nThe following trigger/message event is served by QRY (a query from another system).  The QRD-8 Who Filter identifies the patient or account number upon which the query is defined and can contain a Format Code of R (record-oriented).  If the query is based on the Patient ID and there are data associated with multiple accounts, the problem of which account data should be returned becomes an implementation issue.","chapters":["CH_12"]},{"id":"QRY_PC9","type":"Message","label":"QRY_PC9 - PC/ goal query","description":"Retained for backwards compatibility only in version 2.4 and later; refer to Chapter 5, section 5.4.  The original mode query and the QRD/QRF segments have been replaced.\r\n\r\nThe following trigger/message event is served by QRY (a query from another system).  The QRD-8 Who Filter identifies the patient or account number upon which the query is defined and can contain a Format Code of R (record-oriented).  If the query is based on the Patient ID and there are data associated with multiple accounts, the problem of which account data should be returned becomes an implementation issue.","chapters":["CH_12"]},{"id":"QRY_PCE","type":"Message","label":"QRY_PCE - PC/ pathway (problem-oriented) query","description":"Retained for backwards compatibility only in version 2.4 and later; refer to Chapter 5, section 5.4.  The original mode query and the QRD/QRF segments have been replaced.\r\n\r\nThe following trigger/message event is served by QRY (a query from another system).  The QRD-8 Who Filter identifies the patient or account number upon which the query is defined and can contain a Format Code of R (record-oriented).  If the query is based on the Patient ID and there are data associated with multiple accounts, the problem of which account data should be returned becomes an implementation issue.","chapters":["CH_12"]},{"id":"QRY_PCK","type":"Message","label":"QRY_PCK - PC/ pathway (goal-oriented) query","description":"Retained for backwards compatibility only in version 2.4 and later; refer to Chapter 5, section 5.4.  The original mode query and the QRD/QRF segments have been replaced.\r\n\r\nThe following trigger/message event is served by QRY (a query from another system).  The QRD-8 Who Filter identifies the patient or account number upon which the query is defined and can contain a Format Code of R (record-oriented).  If the query is based on the Patient ID and there are data associated with multiple accounts, the problem of which account data should be returned becomes an implementation issue.","chapters":["CH_12"]},{"id":"QSB_Q16","type":"Message","label":"QSB_Q16 - Create subscription","description":null,"chapters":["CH_05"]},{"id":"QSB_Z83","type":"Message","label":"QSB_Z83 - ORU Subscription","description":"Sends Lab Results, either filtered or unfiltered, as specified in the input parameters.","chapters":["CH_05"]},{"id":"QSX_J02","type":"Message","label":"QSX_J02 - Cancel subscription/acknowledge message","description":null,"chapters":["CH_05"]},{"id":"QVR_Q17","type":"Message","label":"QVR_Q17 - Query for previous events","description":"The Query for Previous Events is like a Query by Parameter with a Segment Pattern Response except that the response consists of zero to many messages of the type defined in the Query Profile rather than a single response message containing multiple iterations of the segment pattern.  While the messages sent in response to a QVR will reflect events which occurred in the past, the time stamp in the message header will reflect the time the message is actually constructed (current time).  It is also similar to the previous generation VQQ/RQQ Event Replay. \r\n\r\nWhile the response is similar to subscription messages, it differs from subscription in that the response messages are the result of \"interrogating\" the database rather than events being triggered in the current timeframe.\r\nIn a Query for Previous Events, the Server still has to parse the query, but avoids the handshaking protocols required in normal query/response situations. The Server acknowledges the query with the general acknowledgement message ACK. The Server then transmits a sequence of messages as if they were simulated unsolicited messages. This is useful for low end systems that unable to deal with the overhead of the query response message syntax, i.e., systems that can only process unsolicited update messages.\r\n\r\nSystems that choose to offer the QVR should offer guidance in the Query Profile, where appropriate, concerning the scope and size of the data requested by the Client.  Moreover, the Query Profile should contain language cautioning Clients of the potential for harm from getting messages out of the original sequence and/or context.  \r\n\r\nUse cases for this query are as follows: 1) to populate a database initially, 2) to recover from an extended down time on the part of the recipient, or 3) to enable systems which normally receive unsolicited data to be extended to act as a query client with minimal modification.\r\n\r\nNote:  If there is a concern that it will be difficult to distinguish these messages from any current realtime messages, e.g., if they are going down the same pipe, the data offerer might choose to designate a unique MSH-3 Sending application for the messages it sends in response to a QVR. This would allow downstream systems to recognize which messages were the result of the QVR, versus which are the result of current realtime activity on the sending system. For example, there may be 2 systems receiving pharmacy dispense messages. If system A wishes to issue a QVR to receive a historical load, system B might misinterpret the QVR results coming over the pipe as actual live data. A separate Sending Application name would allow for easy differentiation. ","chapters":["CH_05"]},{"id":"RAS_O17","type":"Message","label":"RAS_O17 - Pharmacy/treatment administration","description":"The RAS message may be created by the administering application (e.g., nursing application) for each instance of administration for an existing order. If the administering application wants to report several administrations of medication/treatment for a given order with a single RAS message, each instance is reported by a separate (repeating) RXA segment. In addition, the administration records for a group of orders may be sent in a single message by creating repeating groups of segments at the ORC level.\r\n\r\nIn the most common case, the RAS messages would be sent from a nursing application to the pharmacy or treatment application (or to the ordering application or another clinical application), which could use the data to generate the medication administration reports. Multiple RXA segments, each corresponding to a separate administration instance for a given order, may be sent with a single ORC.\r\n\r\nNote: The use of RAS with the trigger of O01 and RRA with the trigger O02 is maintained for backward compatibility as of v2.4 and is withdrawn as of v2.7.","chapters":["CH_04"]},{"id":"RCI_I05","type":"Message","label":"RCI_I05 - Return clinical information","description":null,"chapters":["CH_11"]},{"id":"RCL_I06","type":"Message","label":"RCL_I06 - Return clinical list","description":null,"chapters":["CH_11"]},{"id":"RDE_O11","type":"Message","label":"RDE_O11 - Pharmacy/treatment encoded order","description":"This message communicates the pharmacy or treatment application's encoding of the pharmacy/treatment order ,OMP, message. It may be sent as an unsolicited message to report on either a single order or multiple pharmacy/treatment orders for a patient.\r\n\r\nThe RDE/RRE message pair can also be used to communicate a refill authorization request; however, a specific trigger event has been assigned. See section 4A.3.13 \"RDE - Pharmacy/Treatment Refill Authorization Request Message (Event O25).\" As a site-specific variant, the original order segments (RXO, RXRs, associated RXCs, and any NTEs) may be sent optionally (for comparison).\r\n\r\nNote: \r\nThe RXCs which follow the RXO may not be fully encoded, but those that follow the RXE must be fully encoded.\r\nThe NTE segment(s) following the PD1 segment are intended to communicate notes and comments relative to the patient.\r\nThe NTE segment(s) following the RXO segment are intended to communicate notes and comments relative to the pharmacy/treatment order.\r\nThe NTE segment(s) following the RXE segment are intended to communicate notes and comments relative to the encoded order.\r\nThe NTE segment(s) following the RXC segment are intended to communicate notes and comments relative to the component(s).\r\nThe NTE segment following the OBX segment is intended to communicate notes and comments relative to the results.","chapters":["CH_04"]},{"id":"RDE_O25","type":"Message","label":"RDE_O25 - Pharmacy/treatment refill authorization request","description":"The RDE/RRE is used to communicate a refill authorization request originating with the pharmacy. This message replicates the standard RDE message with a different trigger event code to indicate the specific use case of a refill authorization request.","chapters":["CH_04"]},{"id":"RDR_RDR","type":"Message","label":"RDR_RDR - Pharmacy/treatment Dispense Information","description":null,"chapters":["CH_05"]},{"id":"RDS_O13","type":"Message","label":"RDS_O13 - Pharmacy/treatment dispense","description":"The RDS message may be created by the pharmacy/treatment application for each instance of dispensing a drug or treatment to fill an existing order or orders. In the most common case, the RDS messages would be routed to a Nursing application or to some clinical application, which needs the data about drugs dispensed or treatments given. As a site-specific variant, the original order segments (RXO, RXE and their associated RXR/RXCs) may be sent optionally (for comparison).\r\n\r\nThe ORC must have the filler order number and the order control code RE. The RXE and associated RXCs may be present if the receiving application needs any of their data. The RXD carries the dispense data for a given issuance of medication: thus it may describe a single dose, a half-day dose, a daily dose, a refill of a prescription, etc. The RXD is not a complete record of an order. Use the RXO and RXE segments if a complete order is needed. It is a record from the pharmacy or treatment supplier to the Nursing application (or other) with drug/treatment dispense and administration instructions.\r\n\r\nThe FT1 segment is optional and repeating in order to accommodate multiple charge, benefit and pricing situations. Example use cases demonstrating zero, one and two FT1 segments follow:\r\n\r\nIn the case where the RDS message represents a dispense event that is in process (i.e., has not been received by the patient), the financial transactions associated with the dispense do not yet exist. Until the financial transactions associated with the dispense event have been completed, no FT1 segment may exist in the message.\r\n\r\nIn the case where the RDS message represents a dispense event that has been received by the patient, and thus all financial transactions have been completed, the RDS message may contain one or more FT1 segments. Examples of single and multiple FT1 segments follow.\r\n\r\nPayment for the dispense event completed by a single payor: \r\nMSH|^&~\\|Pharm|GenHosp|CIS|GenHosp|2006082911150700||RDS^O13^RDS_O13|...<cr>\r\nPID|...<cr>\r\nORC|RE|...<cr>\r\nRXD|1|00310013110^LISINOPRIL 10MG TABLET^NDC|200607150830|100|TAB|...<cr> \r\nFT1|1|||200607151035||PY|00310013110^LISINOPRIL 10MG TABLET^NDC|||100|125.43&USD|...<cr>\r\n\r\nPayment for the dispense event involves multiple payment sources: \r\nMSH|^&~\\|Pharm|GenHosp|CIS|GenHosp|2006082213000700||RDS^O13^RDS_O13|...<cr>\r\nPID|...<cr> \r\nORC|RE|...<cr> \r\nRXD|1|00340024110^VERAPAMIL 120MG TABLET^NDC|200607200940|100|TAB|...<cr>\r\nFT1|1|||200607211055||CD|00340024110^VERAPAMIL 120MG TABLET ^NDC|||100|55.43&USD|...<cr>\r\n(amount paid by insurance) \r\nFT1|2|||200607211055||CP|00340024110^VERAPAMIL 120MG TABLET ^NDC|||100|5.00&USD|...<cr> (copay paid by patient)\r\n\r\nThe use of RDS with the trigger of O01 and RRD with the trigger O02 is maintained for backward compatibility as of v2.4 and is withdrawn as of v2.7.","chapters":["CH_04"]},{"id":"RDY_K15","type":"Message","label":"RDY_K15 - Display response in response to QBP^Q15","description":"The RDY_K15 supports a Display Response to the QBP and contains the MSH, MSA, ERR, QAK, DSP, and the DSC.  Its default trigger event is K15.  A standard or site-defined response may use this trigger event or may specify a unique trigger event value in its Query Profile.  If a unique trigger event value is chosen for a site-defined response, that value SHALL begin with Z.\r\n\r\nNote:  The indicated trigger events are the default values for MSH-9-2-Trigger event.  Standard and site-defined queries may use these trigger events or may specify unique trigger event values in their Query Profiles.  Unique trigger event values for site-defined queries SHALL begin with Z.","chapters":["CH_05"]},{"id":"RDY_Z80","type":"Message","label":"RDY_Z80 - Dispense Information (Response)","description":"Returns data formatted for screen display. Data are sorted by Medication Dispensed unless otherwise specified in SortControl.","chapters":["CH_05"]},{"id":"RDY_Z98","type":"Message","label":"RDY_Z98 - Dispense History (Response)","description":"Returns data formatted for screen display. Data are sorted by Medication Dispensed unless otherwise specified in SortControl.","chapters":["CH_05"]},{"id":"REF_I12","type":"Message","label":"REF_I12 - Patient referral","description":"This event triggers a message to be sent from one healthcare provider to another regarding a specific patient.  The referral message may contain patient demographic information, specific medical procedures to be performed (accompanied by previously obtained authorizations) and relevant clinical information pertinent to the patient's case.","chapters":["CH_11"]},{"id":"REF_I13","type":"Message","label":"REF_I13 - Modify patient referral","description":"This event triggers a message to be sent from one healthcare provider to another regarding changes to an existing referral.  Changes in a referral may include additional instructions from the referring provider, additional clinical information, and even additional information on patient demographics.","chapters":["CH_11"]},{"id":"REF_I14","type":"Message","label":"REF_I14 - Cancel patient referral","description":"This event triggers a message to be sent from one healthcare provider to another canceling a referral.  A previous referral may have been made in error, or perhaps the cancellation has come from the patient.","chapters":["CH_11"]},{"id":"REF_I15","type":"Message","label":"REF_I15 - Request patient referral status","description":"This event triggers a message to be sent between healthcare providers regarding the status of a patient referral request.  A previous referral has been made and acknowledged; however, no response has been received to indicate results and/or procedures performed.","chapters":["CH_11"]},{"id":"RGV_O15","type":"Message","label":"RGV_O15 - Pharmacy/treatment give","description":"The RDS message's RXD segment carries the dispense data for a given issuance of medication: thus it may describe a single dose, a half-day dose, a daily dose, a refill of a prescription, etc. It does not contain the given instructions or scheduling information. When this \"give\" (i.e., administration) information needs to be transmitted from the pharmacy or treatment application to another application, it is done with the RGV message.\r\n\r\nThe RGV message uses the RXG segment to record drug or treatment administration instructions. It may carry information about a single scheduled administration on a drug or treatment, or it may carry information about multiple administrations. If the pharmacy or treatment application (or some other application) needs to create an unambiguous MAR report where each administration is matched to a particular give date/time instruction, it may use the RGV message as described in the following way:\r\n\r\nFor each scheduled administration of the medication, the pharmacy/treatment issues either a single RGV message or a single RGV message with multiple RXG segments, one for each scheduled administration. The actual administrations (transmitted by one or more RAS messages) are matched against the scheduled ones by recording in each RXA segment the Give Sub-ID of the corresponding RXG segment. If more than one administration needs to be matched (as in the case of recording a change or rate of an IV solution) the administering application issues additional RXA segment(s) (corresponding to the same RXG segment). If no matching is needed, the Give Sub-ID of the RXA segments has the value zero (0).\r\n\r\nThe ORC must have the filler order number and the order control code RE. The RXE and associated RXCs may be present if the receiving application needs any of their data. The RXG carries the scheduled administration data for either a single \"give instruction\" (single dose) of medication or for multiple \"give instructions.\" The RXG is not a complete record of an order. Use the RXO and RXE segments if a complete order is needed. It is a record from the pharmacy or treatment application to the Nursing application (or other) with drug/treatment administration instructions.\r\n\r\nNote: The use of RGV with the trigger of O01 and RRG with the trigger O02 is maintained for backward compatibility as of v2.4 and is withdrawn as of v2.7.","chapters":["CH_04"]},{"id":"RPA_I08","type":"Message","label":"RPA_I08 - Return patient authorization","description":null,"chapters":["CH_11"]},{"id":"RPA_I09","type":"Message","label":"RPA_I09 - Return Modification to an Authorization","description":"This event triggers a message sent from a healthcare provider to a payor requesting changes to a previously referenced authorization.  For example, a provider may determine that a substitute testing or surgical procedure should be performed on a specified patient.","chapters":["CH_11"]},{"id":"RPA_I10","type":"Message","label":"RPA_I10 - Return Resubmission of an Authorization","description":"If a previously submitted request for treatment authorization is rejected or canceled, this event could trigger a resubmission message for a referenced authorization.  For example, the payor may have rejected a request until additional clinical information is sent to support the authorization request.","chapters":["CH_11"]},{"id":"RPA_I11","type":"Message","label":"RPA_I11 - Return Cancellation of an Authorization","description":"This event may trigger the cancellation of an authorization.  It may be used by the provider to indicate that an authorized service was not performed, or perhaps that the patient changed to another provider.  A payor may use this request to reject a submitted authorization request from a provider.","chapters":["CH_11"]},{"id":"RPI_I01","type":"Message","label":"RPI_I01 - Request for insurance information","description":null,"chapters":["CH_11"]},{"id":"RPI_I04","type":"Message","label":"RPI_I04 - Return Patient Demographic Data","description":"This event triggers a request from one healthcare provider to another for patient demographic information, including insurance and billing information.  Typically, this transaction would occur between one provider to another, but it could also be directed to a payor.","chapters":["CH_11"]},{"id":"RPL_I02","type":"Message","label":"RPL_I02 - Return Patient Selection Display List","description":"This trigger event occurs when the inquirer specifies a request for a name lookup listing.  Generally, this request is used by the responder when insufficient data is on hand for a positive match.  In this case, the requester may ask for a list of possible candidates from which to make a selection.  This event code is also used by the responder to signify that the return information contains a list of information rather than information specific to a single patient.","chapters":["CH_11"]},{"id":"RPR_I03","type":"Message","label":"RPR_I03 - Return Patient List","description":null,"chapters":["CH_11"]},{"id":"RQA_I08","type":"Message","label":"RQA_I08 - Request for treatment authorization information","description":"This event triggers a message to be sent from a healthcare provider to a payor requesting authorization to perform specific medical procedures or tests on a given patient.  The specific medical procedures must be filled out in the PR1 segments.  Each repeating PR1 segment may be paired with an AUT segment so that authorization information can be given regarding dollar amounts, number of treatments, and perhaps the estimated length of stay for treatment.  The OBR and OBX segments should be used to include any relevant clinical information that may be required to support or process the authorization.","chapters":["CH_11"]},{"id":"RQA_I09","type":"Message","label":"RQA_I09 - Request for modification to an authorization","description":"This event triggers a message sent from a healthcare provider to a payor requesting changes to a previously referenced authorization.  For example, a provider may determine that a substitute testing or surgical procedure should be performed on a specified patient.","chapters":["CH_11"]},{"id":"RQA_I10","type":"Message","label":"RQA_I10 - Request for resubmission of an authorization","description":"If a previously submitted request for treatment authorization is rejected or canceled, this event could trigger a resubmission message for a referenced authorization.  For example, the payor may have rejected a request until additional clinical information is sent to support the authorization request.","chapters":["CH_11"]},{"id":"RQA_I11","type":"Message","label":"RQA_I11 - Request for cancellation of an authorization","description":"This event may trigger the cancellation of an authorization.  It may be used by the provider to indicate that an authorized service was not performed, or perhaps that the patient changed to another provider.  A payor may use this request to reject a submitted authorization request from a provider.","chapters":["CH_11"]},{"id":"RQC_I05","type":"Message","label":"RQC_I05 - Request for patient clinical information","description":"Retained for backwards compatibility only in version 2.4 and later; refer to Chapter 5 section 5.4, \"Query Response Message Pairs.\" The original mode query and the QRD/QRF segments have been replaced.\r\n\r\nThis event is used to request clinical information for a specific patient. Generally, this transaction occurs between one provider and another (typically a laboratory or radiology, etc.). However, it may also be very useful for a payor-to-provider request for clinical observation information to be used in considering a request for treatment authorization","chapters":["CH_11"]},{"id":"RQC_I06","type":"Message","label":"RQC_I06 - Request/receipt of clinical data listing","description":"Retained for backwards compatibility only in version 2.4 and later; refer to Chapter 5 section 5.4, \"Query Response Message Pairs.\"   The original mode query and the QRD/QRF segments have been replaced.\r\n\r\nThis event code is sent from one healthcare provider to another (typically a laboratory or radiology, etc.) to request a list of available clinical observation information.  When the provider is dealing with a community model in which remote requests make transmission of large amounts of data impractical, this event code will provide for interactive lists of transactions from which more specific selections can be made.","chapters":["CH_11"]},{"id":"RQI_I01","type":"Message","label":"RQI_I01 - Request for insurance information","description":"This event triggers a message to be sent from one healthcare provider to another to request insurance information for a specified patient.","chapters":["CH_11"]},{"id":"RQI_I02","type":"Message","label":"RQI_I02 - Request/receipt of patient selection display list","description":"This trigger event occurs when the inquirer specifies a request for a name lookup listing.  Generally, this request is used by the responder when insufficient data is on hand for a positive match.  In this case, the requester may ask for a list of possible candidates from which to make a selection.  This event code is also used by the responder to signify that the return information contains a list of information rather than information specific to a single patient.","chapters":["CH_11"]},{"id":"RQI_I03","type":"Message","label":"RQI_I03 - Request/receipt of patient selection list","description":"This trigger event occurs when the inquirer specifies a request for a listing of patient names. This event differs from event I02 (request/receipts of patient selection display list) in that it returns the patient list in repeating PID segments instead of repeating DSP segments.","chapters":["CH_11"]},{"id":"RQP_I04","type":"Message","label":"RQP_I04 - Request for patient demographic data","description":"This event triggers a request from one healthcare provider to another for patient demographic information, including insurance and billing information.  Typically, this transaction would occur between one provider to another, but it could also be directed to a payor.","chapters":["CH_11"]},{"id":"RRA_O18","type":"Message","label":"RRA_O18 - Pharmacy/treatment administration acknowledgment","description":"Note: The use of RAS with the trigger of O01 and RRA with the trigger O02 is maintained for backward compatibility as of v2.4 and is withdrawn as of v2.7.","chapters":["CH_04"]},{"id":"RRD_O14","type":"Message","label":"RRD_O14 - Pharmacy/treatment dispense acknowledgment","description":null,"chapters":["CH_04"]},{"id":"RRE_O12","type":"Message","label":"RRE_O12 - Pharmacy/treatment encoded order acknowledgment","description":"Note: The use of RDE with the trigger of O01 and RRE with the trigger O02 is maintained for backward compatibility as of v2.4 and is withdrawn as of v2.7.","chapters":["CH_04"]},{"id":"RRE_O26","type":"Message","label":"RRE_O26 - Pharmacy/Treatment Refill Authorization Acknowledgement","description":null,"chapters":["CH_04"]},{"id":"RRG_O16","type":"Message","label":"RRG_O16 - Pharmacy/treatment give acknowledgment","description":"Note: The use of RGV with the trigger of O01 and RRG with the trigger O02 is maintained for backward compatibility as of v2.4 and is withdrawn as of v2.7.","chapters":["CH_04"]},{"id":"RRI_I12","type":"Message","label":"RRI_I12 - Return referal information","description":null,"chapters":["CH_11"]},{"id":"RRI_I13","type":"Message","label":"RRI_I13 - Modify Patient Referral Response","description":"This event triggers a message to be sent from one healthcare provider to another regarding changes to an existing referral.  Changes in a referral may include additional instructions from the referring provider, additional clinical information, and even additional information on patient demographics.","chapters":["CH_11"]},{"id":"RRI_I14","type":"Message","label":"RRI_I14 - Cancel Patient Referral Response","description":"This event triggers a message to be sent from one healthcare provider to another canceling a referral.  A previous referral may have been made in error, or perhaps the cancellation has come from the patient.","chapters":["CH_11"]},{"id":"RRI_I15","type":"Message","label":"RRI_I15 - Return Request Patient Referral Status ","description":"This event triggers a message to be sent between healthcare providers regarding the status of a patient referral request.  A previous referral has been made and acknowledged; however, no response has been received to indicate results and/or procedures performed.","chapters":["CH_11"]},{"id":"RSP_E03","type":"Message","label":"RSP_E03 - HealthCare Services Invoice Status Query Response","description":"This message is used to respond to a QPB^E03  Query HealthCare Services Invoice. It provides Invoice and invoice processing information to a Provider.\r\n\r\nA QBP^E03  Query HealthCare Services Invoice can be used to query against an Invoice or a specific Product/Service Line Item in an Invoice. The same response message, RSP^E03  HealthCare Services Invoice Query Response, is used for both types of query.","chapters":["CH_05","CH_16"]},{"id":"RSP_E22","type":"Message","label":"RSP_E22 - Authorization Request StatusResponse ","description":"This message is used to respond to a QPB_E22   Query Authorization Request Status. It provides Authorization status information to a Provider.","chapters":["CH_05","CH_16"]},{"id":"RSP_K11","type":"Message","label":"RSP_K11 - Segment pattern response in response to QBP^Q11","description":"The RSP_K11 supports a Segment Pattern Response to the QBP and contains the MSH, MSA, ERR, QAK, QPD, variable content segments, and the DSC.  Its default trigger event is K11.  A standard or site-defined response may use this trigger event or may specify a unique trigger event value in its Query Profile.  If a unique trigger event value is chosen for a site-defined response, that value SHALL begin with Z. \r\n\r\nNote on RSP:  The Query Profile for each QBP/RSP pair shall specify an explicit segment pattern grammar in place of the ellipses shown above in the RSP_K11 grammar.","chapters":["CH_05"]},{"id":"RSP_K21","type":"Message","label":"RSP_K21 - Get person demographics response","description":null,"chapters":["CH_03"]},{"id":"RSP_K22","type":"Message","label":"RSP_K22 - Find candidates response","description":null,"chapters":["CH_03"]},{"id":"RSP_K23","type":"Message","label":"RSP_K23 - Get corresponding identifiers response","description":null,"chapters":["CH_03"]},{"id":"RSP_K24","type":"Message","label":"RSP_K24 - Allocate identifiers response","description":null,"chapters":["CH_03"]},{"id":"RSP_K25","type":"Message","label":"RSP_K25 - Personnel Information by Segment Response","description":null,"chapters":["CH_15"]},{"id":"RSP_K31","type":"Message","label":"RSP_K31 - Dispense History Response","description":null,"chapters":["CH_04"]},{"id":"RSP_K32","type":"Message","label":"RSP_K32 - Find Candidates including Visit Information Response","description":null,"chapters":["CH_03"]},{"id":"RSP_Z82","type":"Message","label":"RSP_Z82 - Dispense History (Response)","description":"Sorted by Medication Dispensed unless otherwise specified in SortControl.","chapters":["CH_05"]},{"id":"RSP_Z84","type":"Message","label":"RSP_Z84 - Who Am I (Response)","description":"Returns response sorted by PatientLastName unless otherwise specified","chapters":["CH_05"]},{"id":"RSP_Z86","type":"Message","label":"RSP_Z86 - Pharmacy Information Comprehensive (Response)","description":"Sorted by Medication Dispensed unless otherwise specified in SortControl.","chapters":["CH_05"]},{"id":"RSP_Z88","type":"Message","label":"RSP_Z88 - Dispense Information (Response)","description":"Sorted by Medication Dispensed unless otherwise specified in SortControl","chapters":["CH_05"]},{"id":"RSP_Z90","type":"Message","label":"RSP_Z90 - Lab Results History (Response)","description":null,"chapters":["CH_05"]},{"id":"RTB_K13","type":"Message","label":"RTB_K13 - Tabular response in response to QBP^Q13","description":"The RTB_K13 supports a Tabular Response to the QBP and contains the MSH, MSA, ERR, QAK, QPD, RDF, RDT and the DSC.  Its default trigger event is K13.  A standard or site-defined response may use this trigger event or may specify a unique trigger event value in its Query Profile.  If a unique trigger event value is chosen for a site-defined response, that value SHALL begin with Z. \r\n\r\nThe RTB_K13 structure requires that, if any RDT segments are returned, they be preceded by an RDF segment containing the row definition specification for the RDT segments.  If no RDF was sent in the query, the default RDF is returned in the RTB_K13. \r\n\r\nNote:  The indicated trigger events are the default values for MSH-9-2-Trigger event.  Standard and site-defined queries may use these trigger events or may specify unique trigger event values in their Query Profiles.  Unique trigger event values for site-defined queries SHALL begin with Z.","chapters":["CH_05"]},{"id":"RTB_Z74","type":"Message","label":"RTB_Z74 - Information about Phone Calls (Response)","description":null,"chapters":["CH_04"]},{"id":"RTB_Z76","type":"Message","label":"RTB_Z76 - Tabular Patient List (Response)","description":"Response returns requested columns from the Virtual Table. If no columns were requested, all columns are returned","chapters":["CH_05"]},{"id":"RTB_Z78","type":"Message","label":"RTB_Z78 - Tabular Patient List (Response)","description":"Response returns requested columns from the Virtual Table. If no columns were requested, all columns are returned.","chapters":["CH_05"]},{"id":"RTB_Z92","type":"Message","label":"RTB_Z92 - Who Am I (Response)","description":null,"chapters":["CH_05"]},{"id":"RTB_Z94","type":"Message","label":"RTB_Z94 - Tabular Dispense History (Response)","description":"Find medications dispensed between specified date range for specified medical record numbers","chapters":["CH_05"]},{"id":"RTB_Z96","type":"Message","label":"RTB_Z96 - Tabular Dispense History (Response)","description":"Columns from the Virtual Table listed in the Input/Output Specification are specified for output in the RDF segment.\r\nIf no columns are specified in the RDF segment, all columns will be returned.\r\nResponse is sorted by Medication Dispensed unless otherwise specified in SortControl.","chapters":["CH_05"]},{"id":"SCN_S37","type":"Message","label":"SCN_S37 - Notification of anti-microbial device cycle data","description":"This message is sent from a filler application to notify other applications that anti-microbial device cycle data has been generated.  The information in the SCN segment and the other detail segments as appropriate describe details of a sterilization or decontamination cycle.","chapters":["CH_17"]},{"id":"SDN_S36","type":"Message","label":"SDN_S36 - Notification of anti-microbial device data","description":"This message is sent from a filler application to notify other applications that anti-microbial device data has been generated.  The information in the SDN segment and the other detail segments as appropriate describe the detail of a device during a sterilization or decontamination cycle.","chapters":["CH_17"]},{"id":"SDR_S31","type":"Message","label":"SDR_S31 - Request anti-microbial device data","description":"This trigger event is sent by the placer application to the filler application to request anti-microbial device data created during the decontamination/sterilization of medical supplies.  In the context of this message segment, the term 'device' refers to a sterilizer or a washer.  Sterilizers perform a sterilization process and washers perform a decontamination process.","chapters":["CH_17"]},{"id":"SIU_S12","type":"Message","label":"SIU_S12 - Notification of new appointment booking","description":"This message is sent from a filler application to notify other applications that a new appointment has been booked.  The information provided in the SCH segment and the other detail segments as appropriate describe the appointment that has been booked by the filler application.","chapters":["CH_10"]},{"id":"SIU_S13","type":"Message","label":"SIU_S13 - Notification of appointment rescheduling","description":"This message is sent from a filler application to notify other applications that an existing appointment has been rescheduled.  The information in the SCH segment and the other detail segments as appropriate describe the new date(s) and time(s) to which the previously booked appointment has been moved.  Additionally, it describes the unchanged information in the previously booked appointment.\r\n\r\nThis transaction should not be used to reschedule an appointment that has begun but has not been completed.  In such cases, and only if it logical to do so, the appointment should be discontinued and a new schedule request should be submitted.  Likewise, this transaction should not be used to reschedule a parent appointment, in which one or more children have begun or have already taken place.  Again, the parent appointment should be discontinued, and a new schedule request should be made.  This procedure removes any ambiguity between applications that may arise with an attempt to modify an appointment that is in progress.","chapters":["CH_10"]},{"id":"SIU_S14","type":"Message","label":"SIU_S14 - Notification of appointment modification","description":"This message notifies other applications that an existing appointment has been modified on the filler application.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.","chapters":["CH_10"]},{"id":"SIU_S15","type":"Message","label":"SIU_S15 - Notification of appointment cancellation","description":"A notification of appointment cancellation is sent by the filler application to other applications when an existing appointment has been canceled.  A cancel event is used to stop a valid appointment from taking place.  For example, if a patient scheduled for an exam cancels his/her appointment, then the appointment is canceled on the filler application.\r\n\r\nThis trigger event can be used to cancel a parent appointment, in which none of the children of the appointment have either begun or been completed.  Any child appointments that exist on the filler and placer applications should be considered canceled.  If one or more child appointments have begun or have been completed, then this trigger event should not be used.  Instead, the S16 (notification of appointment discontinuation) event should be used.","chapters":["CH_10"]},{"id":"SIU_S16","type":"Message","label":"SIU_S16 - Notification of appointment discontinuation","description":"A notification of appointment discontinuation is sent by the filler application to notify other applications that an appointment in progress has been stopped, or that the remaining occurrences of a parent appointment will not occur.  If none of the child appointments of a parent appointment have taken place, then a cancel trigger event should be sent instead.","chapters":["CH_10"]},{"id":"SIU_S17","type":"Message","label":"SIU_S17 - Notification of appointment deletion","description":"A notification of appointment deletion is sent by the filler application to other applications when an appointment that had been entered in error has been removed from the system.  A delete trigger event should only be used when an appointment has been erroneously scheduled.  It must be removed from the schedule so that it does not affect any statistical processing.  A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from occurring.  This trigger event should not be used for any appointment that has already begun, or that has already been completed.  Likewise, it should not be used for any parent appointment if any child appointments have either begun or been completed.\r\n\r\nThe delete trigger event should be implemented with careful forethought, as it typically has different effects and repercussions in various applications.  In some applications, a delete event cannot be undone.  This means that if a delete transaction was sent erroneously, recovery will be difficult or impossible.  In other applications, a delete transaction will not result in the physical deletion of the record(s), but will set a status or a flag.  In these cases, the filler and/or placer appointment identifiers (the numbers or codes that uniquely identify the scheduled appointment or request to the placer and filler applications) probably cannot be reused.  Since these applications maintain a record of deleted appointments, the reuse of an identifier will likely cause a conflict in the applications' processing of transactions.","chapters":["CH_10"]},{"id":"SIU_S18","type":"Message","label":"SIU_S18 - Notification of addition of service/resource on appointment","description":"The notification of addition of service/resource is triggered on the filler application when a new service or resource has been added to an existing appointment.  Services and resources are represented by the AIS, AIG, AIL, and AIP segments on an HL7 scheduling interface transaction.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.","chapters":["CH_10"]},{"id":"SIU_S19","type":"Message","label":"SIU_S19 - Notification of modification of service/resource on appointment","description":"The notification of modification of service/resource is triggered on the filler application when the information pertaining to an existing service or resource has been changed for an existing appointment.  Services and resources are represented by the AIS, AIG, AIL, and AIP segments on an HL7 scheduling interface transaction.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.\r\n\r\nThis trigger event should not be used when an existing resource or service has been replaced in relation to an existing appointment.  Instead, use two other trigger events: S20 (notification of cancellation of service/ resource on appointment), as well as S18 (notification of addition of service/resource on appointment).","chapters":["CH_10"]},{"id":"SIU_S20","type":"Message","label":"SIU_S20 - Notification of cancellation of service/resource on appointment","description":"This trigger event notifies other applications that a service or resource has been removed from an existing scheduled appointment that has not yet begun.  A cancel event is used to stop a valid service or resource from participating in the appointment.  For example, if a portable X-ray machine scheduled for an exam is no longer needed, then the resource is canceled on the filler application.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.","chapters":["CH_10"]},{"id":"SIU_S21","type":"Message","label":"SIU_S21 - Notification of discontinuation of service/resource on appointment","description":"A notification of discontinuation of service/resource is sent by the filler application to other applications when the remaining children of a parent appointment no longer require a particular service or resource.  In other words, this trigger event is sent to discontinue the performance of a service or resource in a parent appointment that has already begun.  If the first appointment in a set of recurring appointments has not yet taken place, then a cancel trigger event should be sent instead.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.","chapters":["CH_10"]},{"id":"SIU_S22","type":"Message","label":"SIU_S22 - Notification of deletion of service/resource on appointment","description":"A notification of deletion of service/resource is sent by the filler application to other applications when a scheduled appointment requiring a service or resource entered in error has been removed from the system.  A delete trigger event should only be used in those circumstances when a service or resource has been erroneously attached to an appointment, and must be removed from the schedule so that it does not affect any statistical processing.  A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from taking place.","chapters":["CH_10"]},{"id":"SIU_S23","type":"Message","label":"SIU_S23 - Notification of blocked schedule time slot(s)","description":"A notification of blocked schedule time slots is sent by the filler application to other applications when a schedule has had one or more time slots blocked and made unavailable for reasons other than the scheduling of an appointment.  For example, if an exam room is unavailable for several hours because of maintenance needs or contamination, a user may block off those several hours on the exam room's schedule.  Similarly, if a physician is unavailable because he or she has taken vacation time, his or her schedule may be blocked off for the duration of the vacation.  When these types of conditions exist, the filler application may use this transaction to notify other applications that the resources controlled by schedules are unavailable.","chapters":["CH_10"]},{"id":"SIU_S24","type":"Message","label":"SIU_S24 - Notification of opened (\"unblocked\") schedule time slot(s)","description":"A notification of blocked schedule time slots is sent by the filler application to other applications when a schedule has one or more time slots open up (\"un-blocked\") and become available for use.  Typically, the blocked period of time on a schedule is simply allowed to expire, because the blocked amount of time is generally used for non-appointment activities. This transaction can be used either to discontinue the blocked status on the schedule, or to reverse a previous block made in error.  For the purposes of this transaction, discontinuing a block currently in progress (the blocked period has started, but not yet completed) and canceling a blocked period in the future are not significantly different.  Therefore, a separate discontinue block transaction is not necessary.  If this transaction is received prior to the inception of a blocked period, then the entire block period is simply canceled according to the data provided in the transaction.  If the transaction is received after the blocked period has begun, but prior to the end of the blocked period, then the blocked period is discontinued according to the data provided in the transactions.  Applications may decide how to handle transactions that attempt to open a blocked period that has both started and ended in the past; however, these transactions can generally be ignored.\r\n\r\nFor example, if an exam room has been blocked for several hours because of maintenance activities or contamination, and if the work has been completed ahead of schedule, a user may open those several hours on the exam room's schedule.  When such a situation occurs, the filler application may use this transaction to notify other applications that the room is available.","chapters":["CH_10"]},{"id":"SIU_S26","type":"Message","label":"SIU_S26 - Notification that patient did not show up for schedule appointment","description":"A notification that a patient did not show up for an appointment.  For example, if a patient was scheduled for a clinic visit, and never arrived for that appointment, this trigger event can be used to set a status on the appointment record for statistical purposes, as well as to free resources assigned to the appointment (or any other application level actions that must be taken in the event a patient does not appear for an appointment).\r\n\r\nPatient Administration events defined in Chapter 3 can be used to indicate that a patient has arrived for an appointment, e.g., A01 (admit/visit notification), A04 (register a patient), A05 (pre-admit a patient), or A10 (patient arriving - tracking) as possible examples.  Similarly, Patient Administration transactions can be used to identify the end of an appointment, e.g., A03 (discharge/end visit) or A09 (patient departing - tracking) as possible examples.","chapters":["CH_10"]},{"id":"SIU_S27","type":"Message","label":"SIU_S27 - Broadcast Notification of Scheduled Appointments","description":null,"chapters":["CH_10"]},{"id":"SLN_S34","type":"Message","label":"SLN_S34 - Notification of sterilization lot","description":"This message is sent from a filler application to notify other applications that a new sterilization lot has been created.  The information provided in the SLT segment describes the new sterilization lot that has been created by the filler application.","chapters":["CH_17"]},{"id":"SLN_S35","type":"Message","label":"SLN_S35 - Notification of sterilization lot deletion","description":"This message is sent from a filler application to notify other applications that a sterilization lot has been deleted.  The information provided in the SLT segment describes the sterilization lot that has been deleted by the filler application.","chapters":["CH_17"]},{"id":"SLR_S28","type":"Message","label":"SLR_S28 - Request new sterilization lot","description":"A placer application (Sterilizer) sends a transaction with this trigger event to a filler application (Instrument-tracking system) to request that a new sterilization lot be added.  If it is successful, the filler application returns an application acknowledgment (if requested under the enhanced acknowledgment mode, or if the original acknowledgment mode is in use).  ","chapters":["CH_17"]},{"id":"SLR_S29","type":"Message","label":"SLR_S29 - Request Sterilization lot deletion","description":"A request sterilization lot deletion is sent by the placer application to the filler application to request that a lot that had been created in error be removed from the system.  A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from occurring.  If it is successful, an application acknowledgment is returned.\r\n\r\nThe delete trigger event should be implemented with careful forethought, as it typically has different effects and repercussions in various applications.  In some applications, a delete event cannot be undone.  This means that if a delete transaction was sent erroneously, recovery will be difficult or impossible.  In other applications, a delete transaction will not result in the physical deletion of the record(s), but will set a status or a flag.  In these cases, the filler and/or placer appointment identifiers (the numbers or codes that uniquely identify the sterilization lot or request to the placer and filler applications) probably cannot be reused.  Since an application may maintain a record of deleted sterilization lots, the reuse of an identifier may cause a conflict in the applications' processing of transactions.","chapters":["CH_17"]},{"id":"SMD_S32","type":"Message","label":"SMD_S32 - Request anti-microbial device cycle data","description":"This trigger event is sent by the placer application to the filler application to request anti-microbial device cycle data created during the decontamination/sterilization of medical supplies.  In the context of this message segment, the term 'device' refers to a sterilizer or a washer.  Sterilizers perform a sterilization process and washers perform a decontamination process.","chapters":["CH_17"]},{"id":"SRM_S01","type":"Message","label":"SRM_S01 - Request new appointment booking","description":"A placer application sends a transaction with this trigger event to a filler application to request that a new appointment be booked.  If it is successful, the filler application returns an application acknowledgment (if requested under the enhanced acknowledgment mode, or if the original acknowledgment mode is in use).  The acknowledgment may optionally contain an SCH segment and related detail segments describing the actual appointment that was booked","chapters":["CH_10"]},{"id":"SRM_S02","type":"Message","label":"SRM_S02 - Request appointment rescheduling","description":"A placer application uses this trigger event to request that an existing appointment be rescheduled.  The new Requested Start Date and Time, Appointment Duration, Repeating Interval, Repeating Interval Duration, and/or Priority are provided in the ARQ segment, along with the existing placer and filler identification numbers.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the new information for the rescheduled appointment.\r\n\r\nThis transaction should not be used to reschedule an appointment that has begun but has not been completed.  In such cases, and only if it is logical to do so, the appointment should be discontinued and a new schedule request should be submitted.  Likewise, this transaction should not be used to reschedule a parent appointment, in which one or more children have begun or have already occurred.  Again, the parent appointment should be discontinued, and a new schedule request should be made.  This procedure removes any ambiguity between applications that may arise with an attempt to modify an appointment that is in progress.","chapters":["CH_10"]},{"id":"SRM_S03","type":"Message","label":"SRM_S03 - Request appointment modification","description":"This message transmits a request for modification of an existing appointment to a filler application.  This trigger event is used to request the modification of information on an existing appointment, outside of the need to reschedule, cancel, discontinue or delete the appointment, or to add, modify, cancel, discontinue, or delete services and/or resources on the appointment.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the new information for the modified appointment.","chapters":["CH_10"]},{"id":"SRM_S04","type":"Message","label":"SRM_S04 - Request appointment cancellation","description":"The request appointment cancellation trigger event is sent by the placer application to the filler application to request that an existing appointment be canceled.  A cancel event is used to stop a valid appointment from occurring.  For example, if a patient scheduled for an exam cancels his/her appointment, then a request to cancel the appointment is sent.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the canceled appointment.\r\n\r\nThis trigger event can be used to cancel a parent appointment, in which none of the children of the appointment have either begun or have been completed.  Any child appointments that exist on the filler and placer applications should be considered canceled.  If one or more child appointments have begun or have been completed, then this trigger event should not be used.  Instead, the S05 (request appointment discontinuation) event should be used.","chapters":["CH_10"]},{"id":"SRM_S05","type":"Message","label":"SRM_S05 - Request appointment discontinuation","description":"The request appointment discontinuation is sent by the placer application to the filler application to request that an appointment in progress be stopped, or that the remaining occurrences of a parent appointment not occur as scheduled.  If none of the child appointments of a parent appointment have occurred, then a cancel trigger event should be sent instead.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the discontinued appointment.","chapters":["CH_10"]},{"id":"SRM_S06","type":"Message","label":"SRM_S06 - Request appointment deletion","description":"A request appointment deletion is sent by the placer application to the filler application to request that an appointment that had been entered in error be removed from the system.  A delete trigger event should only be used when an appointment has been erroneously requested, and must be removed from the schedule so that it does not affect any statistical processing.  A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from occurring.  This trigger event should not be used for any appointment that has already begun, or has already been completed.  Likewise, it should not be used on any parent appointment if any child appointments have either begun or been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the deleted appointment.\r\n\r\nThe delete trigger event should be implemented with careful forethought, as it typically has different effects and repercussions in various applications.  In some applications, a delete event cannot be undone.  This means that if a delete transaction was sent erroneously, recovery will be difficult or impossible.  In other applications, a delete transaction will not result in the physical deletion of the record(s), but will set a status or a flag.  In these cases, the filler and/or placer appointment identifiers (the numbers or codes that uniquely identify the scheduled appointment or request to the placer and filler applications) probably cannot be reused.  Since these applications maintain a record of deleted appointments, the reuse of an identifier will likely cause a conflict in the applications' processing of transactions.","chapters":["CH_10"]},{"id":"SRM_S07","type":"Message","label":"SRM_S07 - Request addition of service/resource on appointment","description":"The request addition of service/resource is triggered by the placer application to request that a new service or resource be added to an existing appointment.  Services and resources are represented by the AIS, AIG, AIL, and AIP segments on an HL7 scheduling interface transaction.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment.","chapters":["CH_10"]},{"id":"SRM_S08","type":"Message","label":"SRM_S08 - Request modification of service/resource on appointment","description":"The request modification of service/resource is triggered on the placer application to request that information pertaining to an existing service or resource be changed for an existing appointment.  Services and resources are represented by the AIS, AIG, AIL, and AIP segments on an HL7 scheduling interface transaction.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment.\r\n\r\nThis trigger event should not be used when an existing resource or service must be replaced or rescheduled for an existing appointment.  The following fields on the indicated segments should not be changed by this trigger event: the first three fields of the AIS, the first four fields of the AIG, the first four fields of the AIL, and the first four fields of the AIP.  Instead, use two trigger events to accomplish the replacement or rescheduling of a service or resource: S09 (request cancellation of service/resource on appointment), as well as S07 (request addition of service/resource on appointment).  ","chapters":["CH_10"]},{"id":"SRM_S09","type":"Message","label":"SRM_S09 - Request cancellation of service/resource on appointment","description":"This trigger event requests that a service or resource be removed from an existing scheduled appointment that has not yet begun.  A cancel event is used to stop a valid service or resource from participating in the appointment.  For example, if a portable X-ray machine scheduled for an exam is no longer needed, then the placer application requests that the resource be canceled on the filler application.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment.","chapters":["CH_10"]},{"id":"SRM_S10","type":"Message","label":"SRM_S10 - Request discontinuation of service/resource on appointment","description":"A request discontinuation of service/resource is sent by the placer application to the filler application when the remaining occurrences of a recurring appointment no longer require a particular service or resource.  In other words, this trigger event is sent to request that the performance of a service or resource in a recurring appointment that has already begun be stopped.  If the first appointment in a set of recurring appointments has not yet occurred, then a cancel trigger event should be sent instead.  This trigger event should only be used on appointments that have not been completed, or on parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment.","chapters":["CH_10"]},{"id":"SRM_S11","type":"Message","label":"SRM_S11 - Request deletion of service/resource on appointment","description":"A request deletion of service/resource is sent by the placer application to the filler application to request that a scheduled appointment requiring a service or resource entered in error be removed from the system. A delete trigger event should only be used when a service or resource has been erroneously attached to an appointment, and must be removed from the schedule so that it does not affect any statistical processing. A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from occurring. This trigger event should only be used on appointments that have not been completed, or on parent appointments whose children have not been completed. If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment","chapters":["CH_10"]},{"id":"SRR_S01","type":"Message","label":"SRR_S01 - Scheduled Request Response","description":null,"chapters":["CH_10"]},{"id":"SRR_S02","type":"Message","label":"SRR_S02 - Scheduled Request Response - Request Appointment Rescheduling ","description":"A placer application uses this trigger event to request that an existing appointment be rescheduled.  The new Requested Start Date and Time, Appointment Duration, Repeating Interval, Repeating Interval Duration, and/or Priority are provided in the ARQ segment, along with the existing placer and filler identification numbers.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the new information for the rescheduled appointment","chapters":["CH_10"]},{"id":"SRR_S03","type":"Message","label":"SRR_S03 - Scheduled Request Response - Request Appointment Modification ","description":"This message transmits a request for modification of an existing appointment to a filler application.  This trigger event is used to request the modification of information on an existing appointment, outside of the need to reschedule, cancel, discontinue or delete the appointment, or to add, modify, cancel, discontinue, or delete services and/or resources on the appointment.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the new information for the modified appointment","chapters":["CH_10"]},{"id":"SRR_S04","type":"Message","label":"SRR_S04 - Scheduled Request Response - Request Appointment Cancellation ","description":"The request appointment cancellation trigger event is sent by the placer application to the filler application to request that an existing appointment be canceled.  A cancel event is used to stop a valid appointment from occurring.  For example, if a patient scheduled for an exam cancels his/her appointment, then a request to cancel the appointment is sent.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the canceled appointment","chapters":["CH_10"]},{"id":"SRR_S05","type":"Message","label":"SRR_S05 - Scheduled Request Response - Request Appointment Discontinuation ","description":"The request appointment discontinuation is sent by the placer application to the filler application to request that an appointment in progress be stopped, or that the remaining occurrences of a parent appointment not occur as scheduled.  If none of the child appointments of a parent appointment have occurred, then a cancel trigger event should be sent instead.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the discontinued appointment","chapters":["CH_10"]},{"id":"SRR_S06","type":"Message","label":"SRR_S06 - Scheduled Request Response - Request Appointment Deletion ","description":"A request appointment deletion is sent by the placer application to the filler application to request that an appointment that had been entered in error be removed from the system.  A delete trigger event should only be used when an appointment has been erroneously requested, and must be removed from the schedule so that it does not affect any statistical processing.  A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from occurring.  This trigger event should not be used for any appointment that has already begun, or has already been completed.  Likewise, it should not be used on any parent appointment if any child appointments have either begun or been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the deleted appointment","chapters":["CH_10"]},{"id":"SRR_S07","type":"Message","label":"SRR_S07 - Scheduled Request Response - Request Addition of Service/Resource on Appointment ","description":"The request addition of service/resource is triggered by the placer application to request that a new service or resource be added to an existing appointment.  Services and resources are represented by the AIS, AIG, AIL, and AIP segments on an HL7 scheduling interface transaction.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment","chapters":["CH_10"]},{"id":"SRR_S08","type":"Message","label":"SRR_S08 - Scheduled Request Response - Request Modification of Service/Resource on Appointment ","description":"The request modification of service/resource is triggered on the placer application to request that information pertaining to an existing service or resource be changed for an existing appointment.  Services and resources are represented by the AIS, AIG, AIL, and AIP segments on an HL7 scheduling interface transaction.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment","chapters":["CH_10"]},{"id":"SRR_S09","type":"Message","label":"SRR_S09 - Scheduled Request Response - Request Cancellation of Service/Resource on Appointment ","description":"This trigger event requests that a service or resource be removed from an existing scheduled appointment that has not yet begun.  A cancel event is used to stop a valid service or resource from participating in the appointment.  For example, if a portable X-ray machine scheduled for an exam is no longer needed, then the placer application requests that the resource be canceled on the filler application.  This trigger event should only be used for appointments that have not been completed, or for parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment","chapters":["CH_10"]},{"id":"SRR_S10","type":"Message","label":"SRR_S10 - Scheduled Request Response - Request Discontinuation of Service/Resource on Appointment ","description":"A request discontinuation of service/resource is sent by the placer application to the filler application when the remaining occurrences of a recurring appointment no longer require a particular service or resource.  In other words, this trigger event is sent to request that the performance of a service or resource in a recurring appointment that has already begun be stopped.  If the first appointment in a set of recurring appointments has not yet occurred, then a cancel trigger event should be sent instead.  This trigger event should only be used on appointments that have not been completed, or on parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment","chapters":["CH_10"]},{"id":"SRR_S11","type":"Message","label":"SRR_S11 - Scheduled Request Response - Request Deletion of Service/Resource on Appointment ","description":"A request deletion of service/resource is sent by the placer application to the filler application to request that a scheduled appointment requiring a service or resource entered in error be removed from the system.  A delete trigger event should only be used when a service or resource has been erroneously attached to an appointment, and must be removed from the schedule so that it does not affect any statistical processing.  A delete trigger event differs from a cancel trigger event in that a delete acts to remove an error, whereas a cancel acts to prevent a valid request from occurring.  This trigger event should only be used on appointments that have not been completed, or on parent appointments whose children have not been completed.  If it is successful, an application acknowledgment is returned, optionally containing an SCH segment and related detail segments describing the modified appointment","chapters":["CH_10"]},{"id":"SSR_U04","type":"Message","label":"SSR_U04 - Specimen status request","description":"This message is used to request information concerning the location and status of specimens from one application to another (e.g., Laboratory Automation System to automated equipment). The request can be addressed for a specific container, a specific carrier, a specific tray or a specific location, depending on the arguments set in the SAC segment. The equipment specified in the EQU segment should respond with the \"Specimen Status Update.\" ","chapters":["CH_13"]},{"id":"SSU_U03","type":"Message","label":"SSU_U03 - Specimen status update","description":"This message is used to send information concerning the location and status of specimens from one application to another (e.g., automated equipment to a Laboratory Automation System). The OBX segments attached to the SAC should be used for transfer of information not included in the SAC segment. ","chapters":["CH_13"]},{"id":"STC_S33","type":"Message","label":"STC_S33 - Notification of sterilization configuration","description":"This message is sent from a filler application to notify other applications of a new sterilization configuration.  The information in the STC segment describes the detail of the new sterilization configuration.","chapters":["CH_17"]},{"id":"STI_S30","type":"Message","label":"STI_S30 - Request item","description":"A request item is sent by the placer application to the filler application to request the ID and description of an item to be sterilized or decontaminated.  If it is successful, the filler application returns an application acknowledgment (if requested under the enhanced acknowledgment mode, or if the original acknowledgment mode is in use).","chapters":["CH_17"]},{"id":"TCR_U11","type":"Message","label":"TCR_U11 - Automated equipment test code settings request","description":"This message is used to request information concerning test codes from one application to another (e.g., Laboratory Automation System to automated equipment).","chapters":["CH_13"]},{"id":"TCU_U10","type":"Message","label":"TCU_U10 - Automated equipment test code settings update","description":"This message is used to send information concerning test codes and parameters from one application to another (e.g., automated equipment to a Laboratory Automation System). This message transfers the current snapshot of the test parameters of the sending system. The sent parameter sets are supposed to replace the parameter sets existing at the receiver of this message before the trigger (there is no selective \"Add\" or \"Delete\").","chapters":["CH_13"]},{"id":"UDM_Q05","type":"Message","label":"UDM_Q05 - Unsolicited display update message","description":"There is a simple HL7 message that allows for unsolicited display update messages to be sent in HL7 format from one system to another.\r\n\r\nTrigger events for the unsolicited update are generally the completion of a particular action (concerning a given patient).  For example, a lab test might be completed, generating a STAT unsolicited display message to be sent to the appropriate location.","chapters":["CH_05"]},{"id":"VXU_V04","type":"Message","label":"VXU_V04 - Unsolicited vaccination record update","description":"When a provider wishes to update the patient's vaccination record being held in a registry, he will transmit an unsolicited update of the record (a V04 trigger event).\r\n\r\nAn unsolicited update will follow this format. The three-letter code in the leftmost column indicates the segment that is included; the column on the right specifies the chapter in which that segment is fully defined.","chapters":["CH_04"]}]