{"id":"MFK_M16","msgStructId":"MFK_M16","eventDesc":"Enhanced Inventory Item Master File Application Acknowledgment","description":"This section describes a master file message designed to communicate information that relates to the sharing of material item master catalog and material item-inventory information between materials management systems and other systems such as surgical and immunization systems.  The synchronization of the \"item master\" between systems and across the enterprise enables the success of the subsequent interfacing of transactions such as: material item requisitions (pre and post case), accounts payable invoices for the payment of material items, journal entries generated from the issue of items to departments or other inventory locations, and patient charges that allow a customer to improve patient care through the better management of materials.  To face budget challenges, healthcare organizations need materials management systems that integrate with finance to automate logistics, eliminate paperwork and analyze data to improve efficiency and reduce overall costs.  This process is a major contributor to improving the customers' bottom line by helping to eliminate materials waste, streamline ordering, ensure accurate payment of materials purchased, ensure accurate billing for materials used, and an accurate presentation of the financial statements of a healthcare facility.","sample":null,"chapters":["CH_08"],"segments":[{"id":"MSH","name":"MSH","longName":"Message Header","sequence":"1","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"SFT","name":"SFT","longName":"Software Segment","sequence":"2","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"UAC","name":"UAC","longName":"User Authentication Credential Segment","sequence":"3","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"MSA","name":"MSA","longName":"Message Acknowledgment","sequence":"4","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"ERR","name":"ERR","longName":"Error","sequence":"5","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"MFI","name":"MFI","longName":"Master File Identification","sequence":"6","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"MFA","name":"MFA","longName":"Master File Acknowledgment","sequence":"7","usage":"O","rpt":"*","isGroup":false,"segments":null}]}