{"id":"MFN_M15","msgStructId":"MFN_M15","eventDesc":"Inventory item master file notification","description":"This section is concerned with describing a master file message that should be used to communicate information that relates to the inventory of items that can be used to perform an ordered service. While an order specifies a service that is represented in an Other Observation/Service Item master file, this message is concerned with communicating attributes of those orderable items (for example lot number and expiration date) that are represented in the Other Observation/Service Item master file. These attributes are more granular than can be represented in the Other Observation/Service Item master file as there may be multiple items in inventory that meet the characteristics of the Service Item but have different specific characteristics, e.g., multiple lots of a vaccine.\r\nEach MFE/IIM structure describes a specific set of lot, expiration date, location, etc. for a Service Item. Multiple instances of MFE/IIM could be used to describe the same Service Item lot at multiple locations, or a location with multiple lots of the same Service Item.\r\nThis message is not intended to act as a complete inventory management system. Various inventory management concepts, e.g., PAR levels, invoice and purchase order tracking, are intentionally not supported. The message is intended to synchronize limited orderable item attributes, e.g., quantity on hand, lot number, expiration date, between communicating systems. Such systems may include a Pharmacy Application and a Nurse-based dispensing system. While the Pharmacy application may define the service items (communicated in [MFN^M12^MFN_12] Other Observation/Service Item master file Messages), the dispensing system would communicate the lot numbers, expiration date and quantity on hand for service items in inventory using the Inventory Item Master file message","sample":null,"chapters":["CH_08"],"segments":[{"id":"MSH","name":"MSH","longName":"Message Header","sequence":"1","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"SFT","name":"SFT","longName":"Software Segment","sequence":"2","usage":"O","rpt":"*","isGroup":false,"segments":null},{"id":"UAC","name":"UAC","longName":"User Authentication Credential Segment","sequence":"3","usage":"O","rpt":"1","isGroup":false,"segments":null},{"id":"MFI","name":"MFI","longName":"Master File Identification","sequence":"4","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":null,"name":"MF_INV_ITEM","longName":null,"sequence":null,"usage":"R","rpt":"*","isGroup":true,"segments":[{"id":"MFE","name":"MFE","longName":"Master File Entry","sequence":"5","usage":"R","rpt":"1","isGroup":false,"segments":null},{"id":"IIM","name":"IIM","longName":"Inventory Item Master","sequence":"6","usage":"R","rpt":"1","isGroup":false,"segments":null}]}]}