{"id":"ED","type":"DataType","name":"Encapsulated Data","description":"This data type transmits encapsulated data from a source system to a destination system. It contains the identity of the source system, the type of data, the encoding method of the data, and the data itself. This data type is similar to the RP (reference pointer) data type of Section 2.A.65, \"RP - reference pointer,\" except that instead of pointing to the data on another system, it contains the data which is to be sent to that system.","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"ED.1","type":"DataTypeComponent","position":"ED.1","length":0,"dataType":"HD","dataTypeName":"Hierarchic Designator","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Source Application","description":"A unique name that identifies the system which was the source of the data. Identical format and restrictions as in reference pointer (see Section 2.A.65.2, \"Application ID (HD)\")."},{"id":"ED.2","type":"DataTypeComponent","position":"ED.2","length":11,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"R","rpt":"1","tableId":"0834","tableName":"MIME Types","name":"Type Of Data","description":"Identical to “type of data” component in the reference pointer (RP) data type. See Section 2.A.65.3, \"Type of Data (ID)\".\r\n\r\nRefer to Imported Table 0834 – MIME Types for valid values."},{"id":"ED.3","type":"DataTypeComponent","position":"ED.3","length":0,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"O","rpt":"1","tableId":"0291","tableName":"Subtype of Referenced Data","name":"Data Subtype","description":"Identical to “subtype” component in the reference pointer (RP) data type. See Section 2.A.65.4, \"Subtype (ID)\".\r\n\r\nRefer to External Table 0291 - Subtype of Referenced Data for valid values."},{"id":"ED.4","type":"DataTypeComponent","position":"ED.4","length":6,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"R","rpt":"1","tableId":"0299","tableName":"Encoding","name":"Encoding","description":"The type of encoding used to represent successive octets of binary data as displayable ASCII characters. Refer to HL7 Table 0299 - Encoding for valid values."},{"id":"ED.5","type":"DataTypeComponent","position":"ED.5","length":0,"dataType":"TX","dataTypeName":"Text Data","usage":"R","rpt":"1","tableId":null,"tableName":null,"name":"Data","description":"Displayable ASCII characters which constitute the data to be sent from source application to destination application. The characters are limited to the legal characters of the ST data type, as defined in Section 2.A.75, \"ST - string data,\" and, if encoded binary, are encoded according to the method of Section 2.A.24.2, \"Type of Data (ID)\".\r\n\r\nIf the encoding component (see Section 2.A.24.4, \"Encoding (ID)\") = \"A\" (none), then the data component must be scanned before transmission for HL7 delimiter characters, and any found must be escaped by using the HL7 escape sequences defined in Section 2.7 – \"Use of escape sequences in text fields.\" On the receiving application, the data field must be de-escaped after being parsed.\r\n\r\nIf the encoding component ED.4 does not equal \"A\", then, after encoding, the (encoded) data must be scanned for HL7 delimiter characters, and any found must be escaped by using the HL7 escape sequences. Only then can the component be added to the HL7 segment/message. On the receiving application, the data field must be de-escaped after being parsed out of the message before being decoded. This can be expressed as \"encode\", \"escape\", \"parse\", \"de-escape\" or \"decode\"."}]}