{"id":"PRL","type":"DataType","name":"Parent Result Link","description":"Uniquely identifies the parent result’s OBX segment related to the current order, together with the information in OBR-29 - Parent.\r\n\r\nUsage Note: This data type is applied only to OBR-26 - Parent Result where it serves to make information available for other types of linkages (e.g., toxicology). This important information, together with the information in OBR-29 - Parent, uniquely identifies the parent result’s OBX segment related to this order. The value of this OBX segment in the parent result is the organism or chemical species about which this battery reports. For example, if the current battery is an antimicrobial susceptibility, the parent results identified OBX contains a result that identifies the organism on which the susceptibility was run. This indirect linkage is preferred because the name of the organism in the parent result may undergo several preliminary values prior to finalization.\r\n\r\nWe emphasize that this field does not take the entire result field from the parent. It is meant only for the text name of the organism or chemical subspecies identified. This field is included only to provide a method for linking back to the parent result for those systems that could not generate unambiguous Observation IDs and sub-IDs.\r\nThis field is present only when the parent result is identified by OBR-29 - Parent and the parent spawns child orders for each of many results. See Chapter 7, \"Observations\", for more details about this linkage.\r\n\r\nNote: Replaces the CM data type used in sections 4.5.3.26 - OBR-26 and 7.4.1.26 - OBR-26 as of v 2.5.","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"PRL.1","type":"DataTypeComponent","position":"PRL.1","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"R","rpt":"1","tableId":null,"tableName":null,"name":"Parent Observation Identifier","description":"Contains the unique identifier of the parent observation as defined in the OBX-3 of the parent result. The value is the same as the OBX-3 of the parent."},{"id":"PRL.2","type":"DataTypeComponent","position":"PRL.2","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Parent Observation Sub-identifier","description":"Contains the sub-ID of the parent result as defined in the OBX-4 of the parent result. The value is the same as the OBX-4 of the parent."},{"id":"PRL.3","type":"DataTypeComponent","position":"PRL.3","length":0,"dataType":"TX","dataTypeName":"Text Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Parent Observation Value Descriptor","description":"Contains a descriptor of the parent observation value as specified in the OBX-5 of the parent result.\r\n\r\nAs an example, the third component may be used to record the name of the microorganism identified by the parent result directly. The organism in this case should be identified exactly as it is in the parent culture."}]}