{"id":"RCD","type":"DataType","name":"Row Column Definition","description":"This specifies the format of a column in terms of a segment field name, a data type, and a maximum length.\r\n\r\nExample: This defines a column containing the value of the \"last name\" component of PID-5, expressed as a ST data type with a maximum width of 20.\r\n|@PID.5.1^ST^20|","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"RCD.1","type":"DataTypeComponent","position":"RCD.1","length":12,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Segment Field Name","description":"This component contains the segment field name.\r\n\r\nNaming conventions:\r\nSegment field names are designated by the “@” symbol concatenated with the HL7 segment ID followed by the sequence number for the field separated by a period. See sections 2.5.2, \"Segments and segment groups\" and 2.5.3.1, \"Position (sequence within the segment)\" for a definition of segment ID and sequence number. If the field is divided into components, the designation may be suffixed with \".nn\", to identify a particular component (a suffix of “.3” indicates the third component of the field); otherwise, the whole field is assumed. If the field is further divided into subcomponents, the designation is suffixed with “.nn.mm\", which identifies the component and subcomponent requested by relative position.\r\n\r\nSite-specific segment field names may be used. In this case, the site-specific segment ID (if the field is not being added to an existing HL7 segment) and the sequence number must be defined so that they do not conflict with existing HL7 segment IDs and field sequence numbers.\r\nValues for this field are defined in the function-specific chapters of this specification.\r\n\r\nNote: If the “@” is being used as one of the delimiter characters defined in MSH-2-encoding characters, it must be “escaped.”  See Section 2.7.1, \"Formatting Codes\"."},{"id":"RCD.2","type":"DataTypeComponent","position":"RCD.2","length":3,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"O","rpt":"1","tableId":"0440","tableName":"Data Types","name":"Hl7 Data Type","description":"The two or three character HL7 data type. Refer to HL7 Table 0440 – Data Types for valid values."},{"id":"RCD.3","type":"DataTypeComponent","position":"RCD.3","length":5,"dataType":"NM","dataTypeName":"Numeric","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Maximum Column Width","description":"The maximum width of the column, as dictated by the responding system. This may vary from the HL7-defined maximum field length."}]}