{"id":"XTN","type":"DataType","name":"Extended Telecommunication Number","description":"Example 1: A Work fax number\r\n^WPN^FX^^^734^6777777\r\n\r\nExample 2: Telephone number with extension\r\n^WPN^PH^^^734^6777777^1\r\n\r\nExample 4: home e-mail address. In this example, assume that a person has a primary home e-mail address such as someone@somewhere.com.  The components would be:\r\n^PRN^Internet^someone@somewhere.com","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"XTN.1","type":"DataTypeComponent","position":"XTN.1","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"W","rpt":"1","tableId":"PhoneNumber","tableName":"Phone Number","name":"Telephone Number","description":"Attention: The XTN-1 component was deprecated as of v2.3 and the detail was withdrawn and removed from the standard as of v2.6."},{"id":"XTN.2","type":"DataTypeComponent","position":"XTN.2","length":3,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"O","rpt":"1","tableId":"0201","tableName":"Telecommunication Use Code","name":"Telecommunication Use Code","description":"A code that represents a specific use of a telecommunication number. Refer to HL7 Table 0201 - Telecommunication Use Code for valid values. This component along with XTN.3 describes the nature of the telecommunication data that follows. Best practice requires the population of XTN.2 when XTN.4 or XTN.7 is populated. "},{"id":"XTN.3","type":"DataTypeComponent","position":"XTN.3","length":8,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"R","rpt":"1","tableId":"0202","tableName":"Telecommunication Equipment Type","name":"Telecommunication Equipment Type","description":"A code that represents the type of telecommunication equipment. Refer to HL7 Table 0202 - Telecommunication Equipment Type for valid values. This component along with XTN.2 describes the nature of the telecommunication data that follows and is necessary to accurately interpret it."},{"id":"XTN.4","type":"DataTypeComponent","position":"XTN.4","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"C","rpt":"1","tableId":null,"tableName":null,"name":"Communication Address","description":"This component is required if, and only allowed if, XTN.7 or XTN.12 are not populated.  Note: If any of the HL7 delimiters are found in the Communication Address, such as @, the appropriate HL7 escape sequence SHALL be used when encoding an Internet address (see Chapter 2, \"Control\", section 2.7.1, \"Formatting Codes\")."},{"id":"XTN.5","type":"DataTypeComponent","position":"XTN.5","length":0,"dataType":"SNM","dataTypeName":"String Of Telephone Number Digits","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Country Code","description":"The numeric code assigned by the International Telecommunication Union in standard E.164 to access telephone services in another country.  For example, \"+1\" is the country code for the United States, \"+49\" is the code for Germany."},{"id":"XTN.6","type":"DataTypeComponent","position":"XTN.6","length":0,"dataType":"SNM","dataTypeName":"String Of Telephone Number Digits","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Area/City Code","description":"The numeric code to access telephone services in another area/city within a country. This number historically needs not be dialed if the caller is located in the same area/city as the phone number of the called party.\r\n\r\nThe use and size of area/city codes is however country specific: some countries do not use area/city codes, or the use of area/city codes may be mandatory when dialing, or area/city codes may be used to group phone numbers based on other criteria than geographic location, such as cell-phone area/city-codes, or free information numbers (e.g., 800 numbers).\r\n\r\nMost countries have a prefix for Area/City codes which only has to be dialed if one doesn't use a country code. This prefix (mostly \"0\", sometimes \"9\") should be omitted from the content of this field. If the prefix for the Area/Code is also mandatory if one uses the country code (e.g., in Italy) then this field should also contain the prefix."},{"id":"XTN.7","type":"DataTypeComponent","position":"XTN.7","length":0,"dataType":"SNM","dataTypeName":"String Of Telephone Number Digits","usage":"C","rpt":"1","tableId":null,"tableName":null,"name":"Local Number","description":"The numeric code used to contact the called party, exclusive of country and area/city codes. The Local Number is required when, and allowed only if, XTN.4 and XTN.12 are not populated. \r\n\r\nThe size of the Local Number is country specific.\r\n\r\nNote that the Local Number does not include the numeric codes that have to be dialed once a connection has been established. Examples include (automated) organizational phone systems which allow external callers to dial additional numeric codes. These additional numeric codes should be specified as an extension."},{"id":"XTN.8","type":"DataTypeComponent","position":"XTN.8","length":0,"dataType":"SNM","dataTypeName":"String Of Telephone Number Digits","usage":"C","rpt":"1","tableId":null,"tableName":null,"name":"Extension","description":"The numeric code to contact the called party used within an organization, e.g., the number used if both caller and called party are located within the same organization. The extension is often the same as the last few digits of the Local Number. The use of extensions is country and site specific, and may depend on the type of phone system (PBX) used by the organization."},{"id":"XTN.9","type":"DataTypeComponent","position":"XTN.9","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Any Text","description":"Contains comments with respect to the telephone number.\r\n\r\nExample: |^^^^^^^^Do not use after 5PM|"},{"id":"XTN.10","type":"DataTypeComponent","position":"XTN.10","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Extension Prefix","description":"The characters established within a company’s internal telephone system network used as a prefix to the Extension component for internal dialing. Note that the use of Extension Prefix requires that the Extension component be valued and that digits, as well as special characters (e.g., *, #) may be used."},{"id":"XTN.11","type":"DataTypeComponent","position":"XTN.11","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Speed Dial Code","description":"The characters established within a company’s internal telephone system used in place of the (external) telephone number to facilitate calling because its length is shorter than that of the telephone number. Note that digits, as well as special characters (e.g., *, #) may be used."},{"id":"XTN.12","type":"DataTypeComponent","position":"XTN.12","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"C","rpt":"1","tableId":null,"tableName":null,"name":"Unformatted Telephone Number","description":"An expression of the telephone number as an unparsable string. The Unformatted Telephone number is required when, and allowed only if, XTN.4 and XTN.7 are not populated.\r\n\r\nThe phone number was entered as free text and sending system does not know how to parse it. \r\nExample: |^^^^^^^^^^^1-800-Dentist|"},{"id":"XTN.13","type":"DataTypeComponent","position":"XTN.13","length":0,"dataType":"DTM","dataTypeName":"Date/time","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Effective Start Date","description":"The first date, if known, on which the telecommunication number is valid and active."},{"id":"XTN.14","type":"DataTypeComponent","position":"XTN.14","length":0,"dataType":"DTM","dataTypeName":"Date/time","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Expiration Date","description":"The last date, if known, on which the telecommunication number is valid and active."},{"id":"XTN.15","type":"DataTypeComponent","position":"XTN.15","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"O","rpt":"1","tableId":"0868","tableName":"Telecommunication Expiration Reason","name":"Expiration Reason","description":"Indicates why this contact number/e-mail was marked as \"ended\".  Refer to User-defined Table 0868 – Telecommunication Expiration Reason for valid values."},{"id":"XTN.16","type":"DataTypeComponent","position":"XTN.16","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"O","rpt":"1","tableId":"0618","tableName":"Protection Code","name":"Protection Code","description":"Indicates whether this information is considered sensitive or should be protected in some way. Refer to User-defined table 0618 - Protection Code for suggested values.\r\n\r\nThe specific set of codes and appropriate handling of such telecommunications addresses will vary by jurisdiction and is subject to site-specific negotiation. For example, a provider address marked as 'unlisted' might not be printed in an internal address listing."},{"id":"XTN.17","type":"DataTypeComponent","position":"XTN.17","length":0,"dataType":"EI","dataTypeName":"Entity Identifier","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Shared Telecommunication Identifier","description":"A unique identifier for the phone number or e-mail address.\r\n\r\nThis component allows a phone number to be uniquely identified, and enables the linking of a single phone number to multiple people and contexts. For example, each member of a family living at the same location would share the same phone number, having the same identifier. A correction to the phone number of one family member could be automatically propagated to other members of the family.\r\n\r\nHL7 does not assume responsibility for the processing rules for this component."},{"id":"XTN.18","type":"DataTypeComponent","position":"XTN.18","length":0,"dataType":"NM","dataTypeName":"Numeric","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Preference Order","description":"For an entity having multiple telecommunication addresses, indicates which is the \"most preferred\" (lowest number) to \"least preferred\" (highest number).\r\n\r\nIf the preference order is unique across all usages for a given type, then it indicates the preference across all usages, (e.g. first try my home number, then my business number). If the preference order is unique across all usages and types, then it indicates the preference across all types of telecommunication addresses.  (E.g., first try my phone; if that doesn't work, use my pager.) Otherwise, the preference order is assumed to only apply within a specific type and usage.\r\n\r\nPreference order numbers need not be sequential (i.e., three numbers with the priority orders of 0, 5 and 15 are legitimate).  The preference order numbers must be non-negative."}]}