{"id":"HD","type":"DataType","name":"Hierarchic Designator","description":"The HD is designed to be a more powerful application identifier.  It is also designed to be used either as a local version of a site-defined application identifier or a publicly-assigned UID.  Syntactically, the HD is a group of two application identifiers: one defined by the first component, and one defined by the second and third components.\r\n\r\nThe HD allows any site to act as an assigning authority (on a local or user-defined basis), even if it technically does not have the right to issue new IDs within an identification scheme.  HDs which have defined third components (defined UID types) must be unique within the series of ID’s defined by that component.","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"HD.1","type":"DataTypeComponent","position":"HD.1","length":0,"dataType":"IS","dataTypeName":"Coded value for user-defined tables","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Namespace ID","description":"Refer to user-defined table 0300 - Namespace ID for suggested values"},{"id":"HD.2","type":"DataTypeComponent","position":"HD.2","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Universal ID","description":"The HD’s second component, Universal ID (UID), is a string formatted according to the scheme defined by the third component, Universal ID type (UID type).  The UID is intended to be unique over time within the UID type.  It is rigorously defined.  Each UID must belong  to one of the specifically enumerated schemes for constructing UID’s (defined by the UID type).  The UID (second component) must follow the syntactic rules of the particular universal identifier scheme (defined by the third component). "},{"id":"HD.3","type":"DataTypeComponent","position":"HD.3","length":0,"dataType":"ID","dataTypeName":"Coded Value","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Universal ID Type","description":"The third component governs the interpretation of the second component of the HD.  If the third component is a known UID refer to HL7 table 0301 - Universal ID type for valid values, then the second component is a universal ID of that type"}]}