{"id":"TQ","type":"DataType","name":"Timing Quantity","description":"Quantity/timing (ORC-7, OBR-27) provides a means of specifying when the service described by the order segment is to be performed and how frequently.  It is a complex multicomponent field that can have repeats; i.e., more than one quantity/timing specification, separated by repeat delimiters, may appear.  It is a distinct data type (see section 2.4.5.20).","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"TQ.1","type":"DataTypeComponent","position":"TQ.1","length":0,"dataType":"CQ","dataTypeName":"Composite Quantity With Units","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Quantity","description":"quantity of the service that should be provided at each service interval.  E.g, if two blood cultures to be obtained every 4 hours, the quantity would be 2.  If three units of blood are to be typed and cross-matched, the quantity would be 3.  The default value is 1.  When units are required, they can be added, specified by a subcomponent delimiter"},{"id":"TQ.2","type":"DataTypeComponent","position":"TQ.2","length":0,"dataType":"CM_RI","dataTypeName":"Interval","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Interval","description":"determines the interval between repeated services."},{"id":"TQ.3","type":"DataTypeComponent","position":"TQ.3","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Duration","description":"Indicates how long the service should continue after it is started.  The default is INDEF (do indefinitely)."},{"id":"TQ.4","type":"DataTypeComponent","position":"TQ.4","length":0,"dataType":"TS","dataTypeName":"Time Stamp","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Start Date/Time","description":"May be specified by the orderer, in which case it indicates the earliest date/time at which the services should be started.  In many cases, however, the start date time will be implied or will be defined by other fields in the order record (e.g., urgency - STAT).  In such a case, this field will be empty"},{"id":"TQ.5","type":"DataTypeComponent","position":"TQ.5","length":0,"dataType":"TS","dataTypeName":"Time Stamp","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"End Date/Time","description":"when filled in by the requester of the service, this field should be the latest date-time that the service should be performed.  If it has not been performed by the specified time, it should not be performed at all.  The requester may not always fill in this value, yet the filling service may fill it in on the basis of the instruction it receives and the actual start time."},{"id":"TQ.6","type":"DataTypeComponent","position":"TQ.6","length":0,"dataType":"ID","dataTypeName":"Coded Value","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Priority","description":"describes the urgency of the request.  The following values are suggested (the default for Priority is R)"},{"id":"TQ.7","type":"DataTypeComponent","position":"TQ.7","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Condition","description":"This is a free text field that describes the conditions under which the drug is to be given.  For example, PRN pain, or to keep blood pressure below 110.  The presence of text in this field should be taken to mean that human review is needed to determine the how and/or when this drug should be given"},{"id":"TQ.8","type":"DataTypeComponent","position":"TQ.8","length":0,"dataType":"TX","dataTypeName":"Text Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Text","description":"full text version of the instruction (optional)."},{"id":"TQ.9","type":"DataTypeComponent","position":"TQ.9","length":0,"dataType":"ID","dataTypeName":"Coded Value","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Conjunction","description":" non-null component indicates that a second timing specification is to follow using the repeat delimiter.  This field can take three values: \r\n\r\nS =  Synchronous \r\nA =  Asynchronous \r\nC =  This is an actuation time "},{"id":"TQ.10","type":"DataTypeComponent","position":"TQ.10","length":0,"dataType":"CM_OSD","dataTypeName":"Order Sequence","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Order Sequencing","description":"there are many situations, such as the creation of an order for a group of intervenous (IV) solutions, where the sequence of the individual intervenous solutions (each an order in itself) needs to be specified.  There are other situations, where part of the order's instructions contains a results condition of some type, such as \"PRN pain.\"  There is currently a free text \"condition\" component of ORC-4-quantity/timing which allows any condition to be specified.  However, to support a fully encoded version of order sequencing, or results condition, we have defined in the following paragraphs a 10th component of ORC-4quantity/timing"}]}