{"id":"ERR","segmentId":"ERR","longName":"Error","description":"The ERR segment is used to add error comments to acknowledgment messages.\r\n\r\nUse Cases:\r\nSeverity: A receiving application needs to communicate 2 \"error or exception statements.\" One is an \"error;\" the other is a \"warning\". To accomplish this, an acknowledgement message with 2 ERR segments is sent. Upon receipt, the sending application can display both, including the appropriate severity, to the user.\r\n\r\nApplication Error Code: A receiving application generates an error that reports an application error code and returns this information in its response. This code in turn is used by helpdesk staff to pinpoint the exact cause of the error, or by the application to prompt an appropriate response from the user. (Ex. Deceased date must be greater than or equal to birth date).\r\n\r\nApplication Error Parameter: A receiving application encounters an error during processing of a transaction. In addition to an error code, the application provides an error parameter that gives greater detail as to the exact nature of the error. The receiving application looks up the message corresponding to the error code, substitutes in the parameter, and displays the resulting message to the user.\r\n\r\nDiagnostic Information: While processing a transaction, a receiving application encounters an exception. When the exception is thrown, it provides a volume of detailed information relating to the error encountered. The receiving application captures the information and sends it in its response. The user reports the error to the help desk, and on request, faxes a copy of the diagnostic information to assist analyzing the problem.\r\n\r\nUser Message: A user executes an application function that generates a transaction that is sent to another application for further processing. During this processing, the receiving application encounters an error and, as part of the error handling routine, retrieves a User Message that it returns in its response. The originating application receives the error and displays it to the end user with the intent that the error condition can be resolved and the user can re-execute the function without error.\r\n\r\nInform Person Code: After submitting a dispense transaction, a response is returned to the user indicating that the patient may be abusing drugs. Given the sensitivity of this warning, the error is returned with an indicator stating that the patient should not be informed of the error with the implication that steps should be taken to rule out or confirm the warning.\r\n\r\nOverride Type: If a business rule states that a prescription on hold cannot be dispensed, an override type might be \"Dispense Held Prescription\" to allow the prescription to be dispensed in exception to the rule.\r\n\r\nOverride Reason Codes: A patient is given a prescription; however, before completing the prescription, the remaining pills are spoiled. The patient returns to their pharmacy and explains the situation to their pharmacist. The pharmacist decides to replace the spoiled drugs; however, when attempting to record the event, a message is returned indicating that the dispense would exceed the maximum amount prescribed. The pharmacist overrides the rule and specifies an Override Reason Code indicating a replacement of lost product.\r\n\r\nHelp Desk Contact: Help desk contact information is stored in a database. When an application error is encountered, the database is queried and the most current help desk contact information is returned in the error message. This is displayed to the user by the receiving application.\r\n\r\nBetter Error Location Information: Receiving system detects an error with the 3rd repetition of the ROL.4 (Role Person - XCN).16 (Name Context – CE).4(Alternate Identifier – CWE). The application identifies the specific repetition and component when raising the error, simplifying diagnosis of the problem.\r\n\r\nSupport for multiple Error Locations: Two fields are marked as conditional, with the condition that one of the two must be specified. The sending application leaves both blank. The receiving application detects the problem, and sends back a single error indicating that one of the fields must be filled in. The ERR segment identifies both positions within the message that relate to the error.","sample":"","chapters":["CH_02"],"fields":[{"id":"ERR.1","type":"Field","position":"ERR.1","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"W","rpt":"1","tableId":null,"tableName":null,"name":"Error Code And Location","description":null},{"id":"ERR.2","type":"Field","position":"ERR.2","length":0,"dataType":"ERL","dataTypeName":"Error Location","usage":"O","rpt":"*","tableId":null,"tableName":null,"name":"Error Location","description":null},{"id":"ERR.3","type":"Field","position":"ERR.3","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"R","rpt":"1","tableId":"0357","tableName":"Message Error Condition Codes","name":"Hl7 Error Code","description":null},{"id":"ERR.4","type":"Field","position":"ERR.4","length":1,"dataType":"ID","dataTypeName":"Coded Value For Hl7 Defined Tables","usage":"R","rpt":"1","tableId":"0516","tableName":"Error Severity","name":"Severity","description":null},{"id":"ERR.5","type":"Field","position":"ERR.5","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"O","rpt":"1","tableId":"0533","tableName":"Application Error Code","name":"Application Error Code","description":null},{"id":"ERR.6","type":"Field","position":"ERR.6","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"10","tableId":null,"tableName":null,"name":"Application Error Parameter","description":null},{"id":"ERR.7","type":"Field","position":"ERR.7","length":0,"dataType":"TX","dataTypeName":"Text Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Diagnostic Information","description":null},{"id":"ERR.8","type":"Field","position":"ERR.8","length":0,"dataType":"TX","dataTypeName":"Text Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"User Message","description":null},{"id":"ERR.9","type":"Field","position":"ERR.9","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"O","rpt":"*","tableId":"0517","tableName":"Inform Person Code","name":"Inform Person Indicator","description":null},{"id":"ERR.10","type":"Field","position":"ERR.10","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"O","rpt":"1","tableId":"0518","tableName":"Override Type","name":"Override Type","description":null},{"id":"ERR.11","type":"Field","position":"ERR.11","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"O","rpt":"*","tableId":"0519","tableName":"Override Reason","name":"Override Reason Code","description":null},{"id":"ERR.12","type":"Field","position":"ERR.12","length":0,"dataType":"XTN","dataTypeName":"Extended Telecommunication Number","usage":"O","rpt":"*","tableId":null,"tableName":null,"name":"Help Desk Contact Point","description":null}]}