{"id":"CM_RFR","type":"DataType","name":"Reference Range","description":null,"dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"CM_RFR.1","type":"DataTypeComponent","position":"CM_RFR.1","length":0,"dataType":"CM_RANGE","dataTypeName":"Wertebereich","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Reference Range","description":"This subcomponent contains the reference (:normal) range.  The format of this field is where the range is taken to be inclusive (i.e., the range includes the end points).  In this specification, the units are assumed to be identical to the reporting units given in OM2-3-units of measure)"},{"id":"CM_RFR.2","type":"DataTypeComponent","position":"CM_RFR.2","length":0,"dataType":"IS","dataTypeName":"Coded value for user-defined tables","usage":"O","rpt":"1","tableId":"0001","tableName":"Sex","name":"Sex","description":"This subcomponent contains the sex of the patient.  Refer to user-defined table 0001 - Sex for suggested values"},{"id":"CM_RFR.3","type":"DataTypeComponent","position":"CM_RFR.3","length":0,"dataType":"CM_RANGE","dataTypeName":"Wertebereich","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Age Range","description":"This component contains the age range (in years or fractions thereof) specified as two values separated by a subcomponent delimiter (in order to allow a simple and consistent machine interpretation of this component).  Ages of less than one year should be specified as a fraction (e.g., 1 month = 0.0830, 1 week = 0.01920, 1 day = 0.0027300).  However, for most purposes involving infants, the gestational age (measured in weeks) is preferred.  The lower end of the range is not indicated; the upper end is, assuring that series of ranges do not overlap"},{"id":"CM_RFR.4","type":"DataTypeComponent","position":"CM_RFR.4","length":0,"dataType":"CM_RANGE","dataTypeName":"Wertebereich","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Age Gestation","description":"This component contains the gestational age and is relevant only when the reference range is influenced by the stage of pregnancy.  A range of values is required.  The gestational age is measured in weeks from conception.  For example, <1&10> implies that the normals apply to gestational ages from 1 week to 4 weeks inclusive (1&4).  The lower end of the range is not included; the upper end is, assuring  that series of age ranges do not overlap"},{"id":"CM_RFR.5","type":"DataTypeComponent","position":"CM_RFR.5","length":0,"dataType":"TX","dataTypeName":"Text Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Species","description":"This component is assumed to be human unless otherwise stated.  The species should be represented as text (e.g., rabbit, mouse, rat). "},{"id":"CM_RFR.6","type":"DataTypeComponent","position":"CM_RFR.6","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Race/subspecies","description":"n the case of humans (the default), the race is specified when race influences the reference range.  When normal ranges for animals are being described, this component can be used to describe subspecies or special breeds of animals"},{"id":"CM_RFR.7","type":"DataTypeComponent","position":"CM_RFR.7","length":0,"dataType":"TX","dataTypeName":"Text Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Conditions","description":"This component contains the condition as simply free text.  This component allows for definition of normal ranges based on any arbitrary condition, e.g., phase of menstrual cycle or dose of a particular drug.  It is provided as a way to communicate the normal ranges for special conditions.  It does not allow automatic checking of these text conditions"}]}