{"id":"EI","type":"DataType","name":"Entity Identifier","description":"The entity identifier defines a given entity within a specified series of identifiers.\r\n\r\nThe specified series, the assigning authority, is defined by components 2 through 4.  The assigning authority is of the hierarchic designator data type, but it is defined as three separate components in the EI data type, rather than as a single component as would normally be the case.  This is in order to maintain backward compatibility with the EI’s use as a component in several existing data fields. Otherwise, the components 2 through 4 are as defined in Section 2.8.18, “HD - hierarchic designator.”  Hierarchic designators are unique across a given HL7 implementation","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"EI.1","type":"DataTypeComponent","position":"EI.1","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Entity Identifier","description":"The first component, entity identifier, is usually defined to be unique within the series of identifiers created by the assigning authority, defined by a hierarchic designator, represented by components 2 through 4.  (See Section 2.8.18, “HD - hierarchic designator”.) "},{"id":"EI.2","type":"DataTypeComponent","position":"EI.2","length":0,"dataType":"IS","dataTypeName":"Coded value for user-defined tables","usage":"O","rpt":"1","tableId":"0300","tableName":"Namespace ID","name":"Namespace ID","description":"Refer to user-defined table 0300 - Namespace ID for suggested values"},{"id":"EI.3","type":"DataTypeComponent","position":"EI.3","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Universal ID","description":"The HD’s second component, universal ID (UID), is a string formatted according to the scheme defined by the third component, universal ID type (UID type).  The UID is intended to be unique over time within the UID type.  It is rigorously defined.  Each UID must belong to one of the specifically enumerated schemes for constructing UID’s (defined by the UID type).  The UID (second component) must follow the syntactic rules of the particular universal identifier scheme (defined by the third component). "},{"id":"EI.4","type":"DataTypeComponent","position":"EI.4","length":0,"dataType":"ID","dataTypeName":"Coded values for HL7 tables","usage":"O","rpt":"1","tableId":"0301","tableName":"Universal ID type","name":"Universal ID Type","description":"Refer to HL7 table 0301 - Universal ID type for valid values."}]}