{"id":"QIP","type":"DataType","name":"Query Input Parameter List","description":"Definition:  This field contains the list of parameter names and values to be passed to the stored procedure","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"QIP.1","type":"DataTypeComponent","position":"QIP.1","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Field Name","description":"This component contains the field name.\r\n\r\nField naming conventions:\r\nFields are designated by the “@” symbol concatenated with the HL7 item number for the field.  If the field is divided into components, the designation may be suffixed with “.nn,” to identify a particular component (a suffix of “.3” indicates the third component of the field); otherwise, the whole field is assumed.  If the field is further divided into subcomponents, the designation is suffixed with “.nn.mm,” which identifies the component and subcomponent requested by relative position.\r\n\r\nSite-specific fields may be used, provided that they begin with the letter “Z.” In this case, site-specific item numbers must be defined that do not conflict with existing HL7 item numbers.\r\n\r\nValues for this field are defined in the function-specific chapters of this specification. "},{"id":"QIP.2","type":"DataTypeComponent","position":"QIP.2","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Value1&value2&value3","description":"This component contains the field value or values in the form “value1& value2 & value3 …”\r\n\r\nA single valued parameter contains only a single subcomponent in the second component:  thus no subcomponent delimiters are needed (e.g., <field name> ^ <value>).  A simple list of values (i.e., a one-dimensional array) may be passed instead of a single value by separating each value with the subcomponent delimiter: ,”<field name> ^ <value1 & value2 &…>” "}]}