{"id":"TQ","type":"DataType","name":"Timing Quantity","description":"Quantity/timing (ORC-7, OBR-27) provides a means of specifying when the service described by the order segment is to be performed and how frequently.  It is a complex multicomponent field that can have repeats; i.e., more than one quantity/timing specification, separated by repeat delimiters, may appear.  It is a distinct data type (see Section 2.8.41, “TQ - timing quantity”).  The components of a single quantity/timing specification are described in the Sections: 4.4.1, “Quantity component  (CQ),” through 4.4.10, “Order sequencing component (CM).”","dataType":null,"dataTypeName":null,"length":0,"usage":null,"rpt":null,"tableId":null,"tableName":null,"sample":"","fields":[{"id":"TQ.1","type":"DataTypeComponent","position":"TQ.1","length":0,"dataType":"CQ","dataTypeName":"Composite Quantity With Units","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Quantity","description":"This field is the quantity of the service that should be provided at each service interval.  For example., if two blood cultures are to be obtained every 4 hours, the quantity would be 2.  If three units of blood are to be typed and cross-matched, the quantity would be 3.  The default value is 1.  When units are required, they can be added, specified by a subcomponent delimiter. "},{"id":"TQ.2","type":"DataTypeComponent","position":"TQ.2","length":0,"dataType":"RI","dataTypeName":"Repeat Interval","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Interval","description":"This field determines the interval between repeated services.\r\n\r\nThe default is one time only, the first subcomponent is the repeat pattern, and the second subcomponent is the explicit time at which pattern is to be executed"},{"id":"TQ.3","type":"DataTypeComponent","position":"TQ.3","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Duration","description":"This field indicates how long the service should continue after it is started.  The default is INDEF (do indefinitely)\r\n\r\nS<integer> = <integer> seconds \r\nM<integer> = <integer> minutes \r\nH<integer> = <integer> hours \r\nD<integer> = <integer> days \r\nW<integer> = <integer> weeks \r\nL<integer> = <integer> months \r\nX<integer> = <integer> times at interval specified in the order.  A request for 2 blood cultures Q2H X3 would imply obtaining 2 blood cultures 3 different times at 2-hour intervals for a total of 6 blood cultures. \r\nT<integer> = at the interval and amount stated until a total of <integer> “DOSAGE” is accumulated.  Units would be assumed to be the same as in the QUANTITY field. INDEF = do indefinitely - also the default "},{"id":"TQ.4","type":"DataTypeComponent","position":"TQ.4","length":0,"dataType":"TS","dataTypeName":"Time Stamp","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Start Date/time","description":"This field may be specified by the orderer, in which case it indicates the earliest date/time at which the services should be started.  In many cases, however, the start date/time will be implied or will be defined by other fields in the order record (e.g., urgency - STAT).  In such a case, this field will be empty.  \r\n\r\nThe filling service will often record a value in this field after receipt of the order, however, and compute an end time on the basis of the start date/time for the filling service’s internal use. "},{"id":"TQ.5","type":"DataTypeComponent","position":"TQ.5","length":0,"dataType":"TS","dataTypeName":"Time Stamp","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"End Date/time","description":"When filled in by the requester of the service, this field should be the latest date/time that the service should be performed.  If it has not been performed by the specified time, it should not be performed at all.  The requester may not always fill in this value, yet the filling service may fill it in on the basis of the instruction it receives and the actual start time.  \r\n\r\nRegardless of the value of the end date/time, the service should be stopped at the earliest of the date/times specified by either the duration or the end date/time."},{"id":"TQ.6","type":"DataTypeComponent","position":"TQ.6","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Priority","description":"This field describes the urgency of the request.  The following values are suggested (the default for Priority is R):\r\n\r\nS = Stat With highest priority \r\nA = ASAP Fill after S orders \r\nR = Routine Default \r\nP = Preop  \r\nC = Callback  \r\nT = Timing critical A request implying that it is critical to come as close as possible to the requested time, e.g., for a trough antimicrobial level. \r\nPRN = As needed\r\n\r\nIf using the value “T” (timing critical), the degree of criticality can be specified thus:\r\n \r\nFormat: \r\nTS<integer> = timing critical within <integer> seconds \r\nTM<integer> = timing critical within <integer> minutes \r\nTH<integer> = timing critical within <integer> hours \r\nTD<integer> = timing critical within <integer> days \r\nTW<integer> = timing critical within <integer> weeks \r\nTL<integer> = timing critical within <integer> months \r\n\r\nFor the sequential orders specification, these values specify the time criticality with which the predecessor order must be followed by the given order. \r\nThe priority component may repeat; separate repeating values with the repeat delimiter separated by a space"},{"id":"TQ.7","type":"DataTypeComponent","position":"TQ.7","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Condition","description":"This is a free text field that describes the conditions under which the drug is to be given.  For example, PRN pain, or to keep blood pressure below 110.  The presence of text in this field should be taken to mean that human review is needed to determine the how and/or when this drug should be given"},{"id":"TQ.8","type":"DataTypeComponent","position":"TQ.8","length":0,"dataType":"TX","dataTypeName":"Text Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Text","description":"This field is a full text version of the instruction (optional)"},{"id":"TQ.9","type":"DataTypeComponent","position":"TQ.9","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Conjunction","description":"This non-null component indicates that a second timing specification is to follow using the repeat delimiter.  This field can take three values:  \r\n\r\nS =  Synchronous  \r\nDo the next specification after this one (unless otherwise constrained by the following components: ORC4^4-start date/time and ORC-4^5-end date/time).  \r\nAn “S” specification implies that the second timing sequence follows the first, e.g., when an order is written to measure blood pressure Q15 minutes for the 1st hour, then every 2 hours for the next day.  \r\n\r\nA =  Asynchronous  \r\nDo the next specification in parallel with this one (unless otherwise constrained by the following components: ORC-4^4-start date/time and ORC-4^5-end date/time).  The conjunction of “A” specifies two parallel instructions, as are sometimes used in medication, e.g., prednisone given at 1 tab on Monday, Wednesday, Friday, and at 1/2 tab on Tuesday, Thursday, Saturday, Sunday.  \r\n\r\nC =  This is an actuation time \r\nIt will be followed by a completion time for the service.  This code allows one to distinguish between the time and priority at which a service should be actuated (e.g., blood should be drawn) and the time and priority at which a service should be completed (e.g., results should be reported)"},{"id":"TQ.10","type":"DataTypeComponent","position":"TQ.10","length":0,"dataType":"CM_OSD","dataTypeName":"Order Sequence","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Order Sequencing","description":"There are many situations, such as the creation of an order for a group of intravenous (IV) solutions, where the sequence of the individual intravenous solutions (each a service in itself) needs to be specified, e.g., hyperalimentation with multi-vitamins in every third bottle. \r\n\r\nThere are other situations where part of the order’s instructions contains a results condition of some type, such as “PRN pain.”  There is currently a free text “condition” component of ORC-4-quantity/timing which allows any condition to be specified.  However, to support a fully encoded version of order sequencing, or results condition, we have defined in the following paragraphs a 10th component of ORC-4-quantity/timing.  \r\n\r\nThe sequencing conditions supported by this 10th component are based on the completion of a  predecessor service"}]}