{"id":"ARV","segmentId":"ARV","longName":"Access Restriction","description":"The ARV segment is used to communicate the requested/required type of access restrictions from system to system, at both the person/patient and the encounter/visit level.\r\n\r\nExamples:\r\nA person/patient may have the right to object to any or all of his/her information to be disclosed. In addition, the patient may request that protected information not be disclosed to family members or friends who may be involved in their care or for notification purposes.\r\n\r\nA realm or organization may have certain privacy policies.\r\n\r\nA patient may have the right to opt out of being included on facility directories.\r\nIn an international context, a physician may be culturally obligated to protect the patient's privacy.\r\n\r\nAny \"opt-in\" or \"opt-out\" restrictions are communicated in ARV-3 - Access Restriction Value. This segment replaces PD1-12 and PV2-22, which have been deprecated in V2.6. The ARV segment is optional and is sent after the PID/PD1 segments to describe access restrictions associated with the person/patient. The ARV segment is optional and is sent after the PV1/PV2 segments to describe access restrictions associated with that specific encounter.\r\n\r\nUsage Notes:\r\n\r\nThe individual system security may want to utilize the Access Restriction Value along with the Access Restriction Reason (and/or with the Confidentiality Code from another segment, e.g., OM1-30 or other data) in order to implement the appropriate type of protection for the person, patient, visit and/or visit data. Each system has the flexibility to incorporate/map the access values into their security system appropriately; the actual implementation for access to protected data is determined by the individual system. The Access Restriction Values supported by an enterprise/system would be defined and determined by that organization.\r\n\r\nIt is expected that these access restriction values would be utilized in combination with other system security information (e.g., patient locations, user department, caregiver-patient relationships, other access restriction parameters) to determine user access.\r\n\r\nSystem implementers should carefully control access to the restriction codes and values, as they themselves hold sensitive information.","sample":"","chapters":["CH_03"],"fields":[{"id":"ARV.1","type":"Field","position":"ARV.1","length":4,"dataType":"SI","dataTypeName":"Sequence Id","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Set Id","description":null},{"id":"ARV.2","type":"Field","position":"ARV.2","length":0,"dataType":"CNE","dataTypeName":"Coded With No Exceptions","usage":"R","rpt":"1","tableId":"0206","tableName":"Segment action code","name":"Access Restriction Action Code","description":null},{"id":"ARV.3","type":"Field","position":"ARV.3","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"R","rpt":"1","tableId":"0717","tableName":"Access Restriction Value","name":"Access Restriction Value","description":null},{"id":"ARV.4","type":"Field","position":"ARV.4","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"O","rpt":"*","tableId":"0719","tableName":"Access Restriction Reason Code","name":"Access Restriction Reason","description":null},{"id":"ARV.5","type":"Field","position":"ARV.5","length":0,"dataType":"ST","dataTypeName":"String Data","usage":"O","rpt":"*","tableId":null,"tableName":null,"name":"Special Access Restriction Instructions","description":null},{"id":"ARV.6","type":"Field","position":"ARV.6","length":0,"dataType":"DR","dataTypeName":"Date/time Range","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Access Restriction Date Range","description":null}]}