{"id":"OVR","segmentId":"OVR","longName":"Override Segment","description":"This segment allows a sender to override specific receiving application's business rules to allow for processing of a message that would normally be rejected or ignored.\r\n\r\nIn many instances, business rules will be set as guidelines relative to patient care. In some instances it is in the patient's better interest to circumvent these guidelines. In other cases, business rules may exist to support normal process flow, but which may be bypassed or ignored under certain special circumstances. This segment is linked to the proposed ERR segment changes in that the first attempt to process a transaction that violates a business rule may result in an error that must be overridden. The ERR provides a mechanism to identify errors that may be overridden, as well as the allowed override codes.\r\n\r\nUse case #1: A patient has received a prescription with a duration of 30 days and receives the full amount at their pharmacy. While at home the patient accidentally spills the container and spoils a significant proportion of the prescription. The patient returns to their pharmacy and explains the situation to the pharmacy technician. The technician consults with their supervising pharmacist. Knowing the patient, thepharmacist decides to override the business rule stating that the dispensed amount for a prescription may not exceed the prescribed amount. In recording the decision, the pharmacy technician specifies that the Override Type is a \"Compassionate Refill\" and that the Override Code, or reason for the override, is \"Spoilage\". The technician also provides Override Comments to provide an explanation of the situation for future reference. While recording the decision, the technician's user ID is automatically stored in an Override Recorded By field. The pharmacist's ID is stored in the Override Responsible Provider field.\r\n\r\nUse case #2:A hospital wishes to submit an invoice to an insurer who is providing secondary coverage. The invoice is being submitted over a week after the service was performed, which is outside the insurer's normal accept time window. The insurer would normally reject the invoice. However, the submitter includes an Override Type of \"late submission\" as well as an Override Code indicating that the invoice is late due to delays with the primary payor. The secondary insurer examines the override reason and accepts the invoice.\r\n\r\nUsage Note: The override segment should be included in messages adjacent to the segment(s) containing the information that would trigger the business rule(s) that needs to be overridden. The segment should be optional (you shouldn't always need to override business rules), and should be allowed to repeat in circumstances where there may be more than one business rule overridden at the same time. Committees may wish to provide suggested values for override types or codes for use with the OVR segment in different messages.","sample":"","chapters":["CH_02"],"fields":[{"id":"OVR.1","type":"Field","position":"OVR.1","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"O","rpt":"1","tableId":"0518","tableName":"Override Type","name":"Business Rule Override Type","description":null},{"id":"OVR.2","type":"Field","position":"OVR.2","length":0,"dataType":"CWE","dataTypeName":"Coded With Exceptions","usage":"O","rpt":"1","tableId":"0521","tableName":"Override Code","name":"Business Rule Override Code","description":null},{"id":"OVR.3","type":"Field","position":"OVR.3","length":0,"dataType":"TX","dataTypeName":"Text Data","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Override Comments","description":null},{"id":"OVR.4","type":"Field","position":"OVR.4","length":0,"dataType":"XCN","dataTypeName":"Extended Composite Id Number And Name For Persons","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Override Entered By","description":null},{"id":"OVR.5","type":"Field","position":"OVR.5","length":0,"dataType":"XCN","dataTypeName":"Extended Composite Id Number And Name For Persons","usage":"O","rpt":"1","tableId":null,"tableName":null,"name":"Override Authorized By","description":null}]}