{"id":"CH_07","title":"Observation Reporting","description":"This chapter describes the transaction set required for sending structured patient-oriented clinical data from one computer system to another.  A common use of these transaction sets will be to transmit observations and results of diagnostic studies from the producing system (e.g., clinical laboratory system, EKG system) (the filler), to the ordering system (e.g., HIS order entry, physician’s office system) (the placer).  However, the transaction set is not limited to such transactions.  Observations can be sent from producing systems to archival medical record systems (not necessarily the order placer) and from such medical record systems to other systems that were not part of the ordering loop, e.g., an office practice system of the referring physician for inpatient test results ordered by an inpatient surgeon.  This chapter also provides mechanisms for registering clinical trials and methods for linking orders and results to clinical trials and for reporting experiences with drugs and devices. These transaction sets permit the transmission of any kind of clinical observations including (but not limited to) clinical laboratory results, the results of imaging studies (excluding the image), EKG pulmonary function studies, measures of patient status and condition, vital signs, intake and output, severity and/or frequency of symptoms, drug allergies, problem lists, diagnostic lists, physician and nursing history, physicals, progress notes, operative notes and so on. An observation can be one of many data types.  The main ones are text, numbers and codes.  This provides the flexibility needed to transmit observations that are recorded as continuous values (e.g., glucose, diastolic blood pressure), as categorical values, e.g., patient position (sitting, reclining or standing), VDRL (reactive, weakly reactive or nonreactive), or as text. An entire History and Physical could be transmitted as an observation whose value is one large chunk of formatted text."}